[
  {
    "Name": "A Creative Guide To Abortion Pills: Lindsey L33 x Future Front Texas x Plan C",
    "Slug": "a-creative-guide-to-abortion-pills-l33-x-fftx-plan-c",
    "Author": "Plan C Team",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c27f0fb75ff65c2213d_632c90b442b77742686aa946_FFTX%2520(1).png",
    "Content": "<p id=\"\"><strong id=\"\">IN THIS 10-MINUTE GUIDE*, WE EXPLORE ABORTION PILLS IN THE US. </strong></p><p id=\"\"><em id=\"\">‍</em>This art film guide was created by Future Front Texas, a nonprofit 501c3 collaborative of 30,000 artists. Future Front approached it a collaborative, community-centered response to the introduction of SB-8 in Texas in September 2021. From October through December 2021, requests for abortion pills from Texans nearly tripled—and the FFTX&nbsp;community realized they didn’t know much about how they worked or the legal risks.</p><p id=\"\">In collaboration with 20+ Texas-based creatives, filmmaker Lindsey L33 and Plan C, Future Front went on a journey from Fall 2021 through Summer 2022 to research abortion pill options in the US and turn that into art. During that time, Roe v. Wade was overturned and Texas’ current trigger ban on abortion went into effect, endangering Texans’ lives, as well as introducing criminalization and additional legal risks for those seeking abortions. </p><p id=\"\">The landscape is evolving, and new resources for pregnant people will continue to emerge. As we align around a vision for the future of reproductive rights and access, and how to take care of ourselves and each other, we can still use our voices to share information and research. So, beyond a guide, this is a call to action. .</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">USE THESE STATEMENTS TO MAKE YOUR OWN ART AND CREATIVE PROJECTS.</strong>‍</p><p id=\"\">Collectively, our hope is to inspire the creative communities we work and live in to speak openly and candidly about abortion access across the US through art, education and activism. Use #AbortionIsHereToStay to create new videos, visual art or otherwise. Or do your own research and create your own. To learn more about the abortion pill options available in your area, and potential legal risks, head to the guide at <a href=\"https://plancpills.org/guide\" id=\"\">plancpills.org/guide</a>.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-normal\" style=\"padding-bottom:106.5%\" data-rt-type=\"video\" data-rt-align=\"normal\" data-rt-max-width=\"\" data-rt-max-height=\"106.5%\" data-rt-dimensions=\"240:426\" data-page-url=\"https://vimeo.com/754496969\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/754496969\"></iframe></div></figure><p id=\"\"><strong id=\"\">No. 1 — Abortion Pills Are Here To Stay.</strong></p><p id=\"\">But many people are unaware. Or not quite sure how to get them. That’s because abortion pills have been highly stigmatized and restricted. Unfortunately, restrictions on access to reproductive health care are nothing new. But that doesn’t mean abortion pills are not safe, effective and available. </p><p id=\"\">Abortion pills were developed in the 1980s and approved by France in 1988. Since, they’ve become mainstream in countries all around the world, used for up to 90% of abortions in countries like Canada and Sweden approved in China, Sweden and Great Britain, among other countries. And over half of abortions in the US are with pills. </p><p id=\"\">So, what does that mean for us today? Changes in medical protocols mean that abortion pills are now available by mail and telemedicine in many states—and can be mailed directly to your doorstep. No matter where you are, there are advocates and organizations that can help.</p><p id=\"\">‍</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-normal\" style=\"padding-bottom:106.5%\" data-rt-type=\"video\" data-rt-align=\"normal\" data-rt-max-width=\"\" data-rt-max-height=\"106.5%\" data-rt-dimensions=\"240:426\" data-page-url=\"https://vimeo.com/754497050\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/754497050\"></iframe></div></figure><p id=\"\"><strong id=\"\">No. 2 — Abortion Pills Are Still An Option In The USA, Even With The Overturn of Roe v. Wade.</strong>‍</p><p id=\"\">Even with the overturn of Roe v. Wade. Medically speaking, abortion pills are extremely safe and effective–so safe that millions of people around the world use them to successfully self-manage abortions at home. But, in the United States it can be legally risky to self-manage your abortion, so do your research. </p><p id=\"\">Some people have been criminalized for self-managing their abortions. No one should be criminalized for managing their own health care, and legal information and help is available so do your research. You have options. To learn more about abortion pills by mail in your area, and potential legal risks, head to www.plancpills.org.</p><p id=\"\">‍</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-normal\" style=\"padding-bottom:106.5%\" data-rt-type=\"video\" data-rt-align=\"normal\" data-rt-max-width=\"\" data-rt-max-height=\"106.5%\" data-rt-dimensions=\"240:426\" data-page-url=\"https://vimeo.com/754497097\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/754497097\"></iframe></div></figure><p id=\"\"><strong id=\"\">No. 3 — Abortion Pills Can Be Ordered Online.</strong><br>And delivered right to your door in all 50 states. Because this is the 21st Century. And we all deserve healthcare on our own terms.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-normal\" style=\"padding-bottom:106.5%\" data-rt-type=\"video\" data-rt-align=\"normal\" data-rt-max-width=\"\" data-rt-max-height=\"106.5%\" data-rt-dimensions=\"240:426\" data-page-url=\"https://vimeo.com/754497141\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/754497141\"></iframe></div></figure><p id=\"\"><strong id=\"\">No. 4 — You Don’t Have To Be Pregnant To Order Abortion Pills.</strong><br>You don’t have to be pregnant to order abortion pills. You can get pills in advance, to keep in your medicine cabinet, in case your period is late. Because that’s the kind of healthcare we all deserve.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-normal\" style=\"padding-bottom:106.5%\" data-rt-type=\"video\" data-rt-align=\"normal\" data-rt-max-width=\"\" data-rt-max-height=\"106.5%\" data-rt-dimensions=\"240:426\" data-page-url=\"https://vimeo.com/754497235\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/754497235\"></iframe></div></figure><p id=\"\">‍<strong id=\"\">No. 5 — Abortion Pills Can Be Taken At Home.<br></strong>Because pills are now available online or prescribed tele-medically, many use abortion pills at home. Some things that might make you more comfortable are:</p><p id=\"\">A heating pad<br>Ibuprofen<br>Comfortable clothes, including comfy underwear<br>Super absorbent maxi pads<br>A cozy blanket and pillows<br>Ginger ale to sip in case of nausea<br>Ice chips and/or popsicles to suck on in case of vomiting<br>Snacks (including plain crackers or white bread, in case of nausea)<br>Something distracting, like movies, tv, magazines, coloring books, or video games<br>A friend or other support person to help, if needed</p><p id=\"\">‍</p><p id=\"\">If you make your own art, creative projects or community work around these statements (or reproductive rights, in general), feel free to share them with us by emailing hello@futurefronttexas.org for inclusion in our Texan Feminist Initiative.</p><p id=\"\"><strong id=\"\">THANK YOU TO ALL WHO CONTRIBUTED TO THIS GUIDE. </strong></p><p id=\"\"><em id=\"\">From Future Front, the \"delightfully Texan\" cast and crew:<br>‍</em>Director And Filmmaker LINDSEY L33<br>Writer, Creative Producer And Facilitator Jane Hervey<br>Director of Photography Angela Herr<br>Animator and Production Assistant Julie Wier<br>Production Assistant Maria Rivera-Felizardo<br>Actor Willow Beauchamp<br>Actor and Production Assistant May Hoopes<br>Actor KB Brookins<br>Actor Kathleen Tiernan<br>Actor Jay Fields<br>Actor Gabriela Campsteyn<br>Actor Erika Martinez<br>Actor Jacquelyn Gonzalez<br>Actor Rebecca Gonzalez<br>Advisor Sydney Greene<br>Advisor Sam Davis<br>Advisor Jules Wendel<br>Advisor Irma Garcia</p>",
    "Date": "Wed Sep 28 2022 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Abortion pills are everywhere at Sundance: on the screen, on a truck, in the snow.",
    "Slug": "abortion-pills-are-everywhere-at-sundance-on-the-screen-on-a-truck-in-the-snow",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c260cdede4ab2d53f16_63dab1527282a668461053e5_sundance.jpeg",
    "Content": "<p id=\"\">Park City, UT– On Monday January 23rd, “<a href=\"/sundance\" target=\"_blank\" id=\"\">PLAN C</a>”, a documentary by filmmaker Tracy Droz Tragos, premiered at the Sundance Film Festival. Featuring the vital work of the nonprofit abortion pill access campaign Plan C as well as other providers and activist groups, the initial screening (one of five) was accompanied by a number of activations staged by the organization, aligned artists, and the filmmaking team. While a snow sculpture dominated the landscape nearby, attendees streamed into the auditorium and passersby at the festival received buttons and information from a mobile truck about how to get abortion medication in all fifty states.<br></p><p id=\"\">Over the course of a four-year span covering the pandemic and the end of <em id=\"\">Roe</em>, Americans’ access to abortion has changed dramatically, and Tracy Droz Tragos captures the fast pace of the news cycle and its effect on women. Tragos spent her time closely observing activist providers and Plan C’s work, particularly that of Plan C’s cofounder Francine Coeytaux. <br></p><p id=\"\">An early review from <em id=\"\">Paste</em> says: “The film’s breaking news reporting is so raw and vital, that it’s hard to get a sense of much beyond immediate reactions. This double-edged sword cuts deep: Its filmmaking is too timely to be dismissed and its topic too important to be done full justice.” <em id=\"\">Flickering Myth</em> says: “An endlessly empathetic and altogether more urgent slice of journalistic filmmaking.” (Links to the film are available for reviewers upon request.)</p><p id=\"\"><strong id=\"\">See Getty Images of the screening </strong><a href=\"https://www.gettyimages.dk/photos/plan-c-film-premiere?phrase=plan%20c%20film%20premiere&assettype=image&sort=newest&license=rf,rm&utm_campaign=Press%20Releases&utm_medium=email&_hsmi=243241188&_hsenc=p2ANqtz-95JFXfQ06peCYz8Jdl6D3ZacT4N994DbwAsZi6rD13_WfrJ6BS8OKXjra1DaJUTspWmwDDujcGrmhtE-QDgxCWljDM5A&utm_content=243241188&utm_source=hs_email\" target=\"_blank\" id=\"\"><strong id=\"\">here.</strong></a></p><p id=\"\"><strong id=\"\">See additional coverage from the premiere red carpet </strong><a href=\"https://www.flickr.com/photos/sundanceorg/albums/72177720305467511?utm_campaign=Press%20Releases&utm_medium=email&_hsmi=243241188&_hsenc=p2ANqtz-9WmbrfEc9NMTPClEO6srt5HXSO2JZiGWVUQObYw0zX2D7tDj66hV7zstwwSN1G5oReAKo2wo9f0S1awxqy4_VX7wLfQQ&utm_content=243241188&utm_source=hs_email\" target=\"_blank\" id=\"\"><strong id=\"\">here</strong></a><strong id=\"\">.</strong><br></p><p id=\"\">On Sunday 1/22, world-renowned Swedish-American artist Michele Pred created her latest large-scale installation “Abortion is a Human Right”, a 50-foot snow sculpture of abortion pills, with participants including Plan C, WISP, Shout Your Abortion’s Amelia Bonow, and film producer Tanya Selvaratnam. Aerial photos captured the enormity of the pills as they loomed with activists behind them, and symbolically the outsize impact that the human right to abortion — and its denial — has on people’s lives.</p><p id=\"\"><strong id=\"\">See photos of the installation </strong><a href=\"https://kylieflyphoto.pixieset.com/sundanceactivation/?utm_campaign=Press%20Releases&utm_medium=email&_hsmi=243241188&_hsenc=p2ANqtz--0nxrBy48Y-FWZwsoRmx0bag_eQI-OM79SJSAShsDw54qOPHAZkikGP4Rs2Zg990VJmAcq4ihe_1yvm_eQ6wDEEtBJ3Q&utm_content=243241188&utm_source=hs_email\" target=\"_blank\" id=\"\"><strong id=\"\">here</strong></a><strong id=\"\">.</strong><br></p><p id=\"\">In addition to the film, the art installation, and several panel discussions, a mobile truck featuring a billboard with Plan C’s tagline, “Abortion Pills By Mail” circulated throughout Park City and Salt Lake City including college campuses and a Crisis Pregnancy Center. The truck was accompanied by Plan C team members and volunteers, who handed out buttons and flyers with info on how to become un-pregnant as well as where to screen the film. Their presence will emphasize a core message of Plan C: that safe, self-managed abortion with pills is here to stay, and pills can even be ordered in advance by people who may want to be un-pregnant in the future. <br></p><p id=\"\"><strong id=\"\">See photos of the billboard truck in Utah </strong><a href=\"https://drive.google.com/drive/folders/1c67TJL-xcbhCUl10YfPDuYSZ3DnRQ_SJ?_hsmi=243241188&_hsenc=p2ANqtz-_yqo1yXmas8PHZfCM8XsdmlukHfxLu5GRNl3ITHWgB7RZ7727PMf7NJxzLr2kzFI8pD4fut28ZQ2kYBoggoDxQ01YK6A\" target=\"_blank\" id=\"\"><strong id=\"\">here</strong></a>.<br></p><p id=\"\"><strong id=\"\">About abortion pills: </strong>Abortion pills are an FDA-approved medication recommended by the World Health Organization for use up to 12 weeks, and considered safe and effective for self-use. Abortion pills consist of two medications, Mifepristone and Misoprostol, taken one or two days apart. Millions of people self-manage their abortions around the world each year, and groups like Plan C are working to both increase direct access and understanding of the method and push for eventual Over the Counter (OTC) status of the medications. </p><p id=\"\"><strong id=\"\">About Plan C: </strong>Plan C is a reproductive health information campaign for universal abortion pill access in the US. Plan C’s website and Guide to Pills includes information on safe self-managed abortion, referrals to medical and legal hotlines, and a research-driven directory of abortion pills by mail: where they’re found online, with or without telehealth support, from all 50 states. Plan C works closely with partners in reproductive justice, healthcare, and tech to catalyze new initiatives that disrupt old barriers to access.</p><p id=\"\">To learn more, visit <a href=\"https://www.plancpills.org\" target=\"_blank\" id=\"\">www.plancpills.org</a>. You can find the campaign on Facebook, Twitter, and Instagram. &nbsp;</p>",
    "Date": "Wed Jan 25 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Abortion with pills can be done safely and effectively with misoprostol-only",
    "Slug": "abortion-with-pills-can-be-done-safely-and-effectively-with-misoprostol-only",
    "Author": "Christie Pitney, WHNP-BC, CNM",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\"><em id=\"\">A note on gendered language:</em></strong><em id=\"\"> The Plan C team knows that abortion is not just a women’s issue and that trans and non-binary folks also have and need access to abortions. We always try our best to use inclusive language, but some of the research studies and links included in this page do use gendered language.</em></p><p id=\"\">Abortion pills, often called ‘medication abortion’ or ‘the abortion pill,’ are a safe and effective way to end a pregnancy. <a href=\"https://www.guttmacher.org/article/2022/02/medication-abortion-now-accounts-more-half-all-us-abortions\" id=\"\">More than half</a> of all abortions in the US are now done with pills. There are two ways (aka protocols or methods) to have an abortion with pills. One is through a combination of two medicines: Mifepristone and Misoprostol, (often called ‘Mife’ and ‘Miso’). The other is using <a href=\"https://societyfp.org/wp-content/uploads/2023/02/SFP_ScienceSays_misoprostol.pdf\" id=\"\">only Misoprostol</a>. These videos explain <a href=\"https://youtu.be/pB3JsJiz82E\" id=\"\">how to take</a> Misoprostol and <a href=\"https://www.youtube.com/watch?v=AyZgY7zbCBM\" id=\"\">what to expect</a> when having an abortion with pills.</p><p id=\"\">Conservatives and the anti-abortion movement are politically motivated to <a href=\"https://docs.google.com/document/d/1f4J5BB9H2Bl4vu1n-qf0D4vuHtOcEV2yLYv2B-x0tqs/edit\" id=\"\">restrict access to Mifepristone</a>, and in the future Misoprostol-alone may be the only option US clinicians can offer, but you may still be able to get both mifepristone and misoprostol online from places like Aid Access, websites that sell pills, or from trusted advocates in your community. See <a href=\"https://www.plancpills.org/find-pills\" id=\"\">our guide</a> for how to access abortion pills by mail in your state.</p><h2 id=\"\">How does someone take misoprostol for a safe at home abortion?</h2><p id=\"\"><strong id=\"\">Step one:</strong> Put four (200 mcg each) Miso pills between your cheeks and gum line or under your tongue and hold them there for 30 minutes. Don’t talk, eat, or drink while they dissolve. After 30 minutes, drink some water and swallow whatever is left of the pills (it’s totally ok if they haven’t fully dissolved or if it took less than 30 minutes for them to dissolve). Another way to take miso is to insert it into your vagina, but there is a chance it could be seen on a vaginal exam if you go for follow up care.</p><p id=\"\"><strong id=\"\">Step two: </strong>Optional, but if you start having pain, you can take 800mg of Ibuprofen/Motrin every 6 hours as needed (or another painkiller if you’re allergic to Ibuprofen). Another painkiller that can be taken with Ibuprofen/Motrin is 1,000mg of Acetaminophen/Tylenol every 6 hours as needed. This will help with cramps. </p><p id=\"\"><strong id=\"\">Step three:</strong> Wait 3 hours (your 3 hour timer can start as soon as you put the miso under your tongue or in your cheeks). Put another four (200mcg each) Miso pills in your cheeks or under your tongue and hold them there for 30 minutes. Don’t talk, eat, or drink while they dissolve. After 30 minutes, swallow.</p><p id=\"\"><strong id=\"\">Step four:</strong> Wait 3 hours and repeat step 3 again! - Put four (200mcg each) miso pills in your cheeks or under your tongue and hold them there for 30 minutes. Don’t talk, eat, or drink while they dissolve. After 30 minutes, swallow.</p><p id=\"\">Make sure you take all 12 pills even if you start to bleed before you’ve taken all of them! Additional doses of misoprostol can be used as needed to ensure the abortion is complete. More information on the protocol is available from <a href=\"https://www.acog.org/clinical/clinical-guidance/practice-bulletin/articles/2020/10/medication-abortion-up-to-70-days-of-gestation\" id=\"\">ACOG</a> and the <a href=\"https://www.mahotline.org/how-to-use-abortion-pills/#misoprostol-only-pdf\" id=\"\">Miscarriage and Abortion Hotline</a>.</p><p id=\"\">You should expect to have heavy cramping and bleeding–it will probably be more intense than a heavy period. This is normal. If it is a very early pregnancy, you might not have heavy bleeding. You may also experience side effects including nausea, dizziness, vomiting, diarrhea, headache, and/or fever and chills. All of that is normal and not cause for concern. Be sure to think about self care! Stay hydrated, eat a meal, use a heating pad or hot compress, have pain meds ready. Do everything that makes you comfortable during a period. It’s often helpful to have a support person with you. If you want a virtual support person, contact our friends at the <a href=\"https://abortionhotline.org/\" id=\"\">Reprocare Healthline</a>. If you’re having an abortion at home and worried you may be experiencing complications, you can contact the <a href=\"https://www.mahotline.org/\" id=\"\">Miscarriage and Abortion Hotline</a> - a free, confidential hotline run by medical professionals. Call or text them at 1-833-246-2632. </p><h2 id=\"\">How do you know if your abortion was successful?</h2><p id=\"\">For most people, the abortion will be complete within 24 hours after taking misoprostol. Most pregnancy symptoms (nausea, dizziness, feeling tired) you were having before the abortion usually stop within 1-2 days. Breast tenderness can take about a week to go away. Bleeding and cramping after the abortion is different for everyone but can generally last for 1-4 weeks. It takes a while for your hormone levels to return to normal so a pregnancy test will still be positive for a few weeks. They will usually be negative 4-5 weeks after the abortion. An ultrasound is usually not necessary to confirm the abortion was successful.</p><p id=\"\">You may feel like you want to go to a clinic to confirm your pregnancy has ended. For some people, this can feel reassuring to know everything went according to plan. This isn’t medically necessary unless you continue to experience pregnancy symptoms. If pregnancy symptoms persist, we recommend using <a href=\"https://www.abortionclinics.com/reproclinics/\" id=\"\">ReproClinics</a> (Abortion Clinic Online’s list of abortion friendly reproductive health clinics), <a href=\"http://stillopenclinics.org/\" id=\"\">stillopenclinics.org</a> (INeedAnA’s list of former abortion clinics that are still open for other services), or Planned Parenthood’s website to find a followup provider who is familiar with abortion care. It’s important to avoid places offering “free ultrasounds” as those are typically anti-abortion crisis pregnancy centers, aka <a href=\"https://www.ineedana.com/fake-clinics\" id=\"\">fake clinics</a>.</p><p id=\"\">Note: You do NOT need to tell your healthcare provider, unsupportive family and friends, or police that you took abortion pills. Medically there is no difference between using abortion pills and having a miscarriage. If you have legal questions about <a href=\"https://abortionpillinfo.org/en/page/416/q-is-it-legal-to-use-abortion-pills-without-a-clinician\" id=\"\">self managing</a> an abortion, the <a href=\"https://www.reprolegalhelpline.org/\" id=\"\">Repro Legal Helpline</a> can help answer your questions and keep your information confidential.</p><h2 id=\"\">Looking for more FAQs?</h2><p id=\"\">For more information on the abortion pill and ordering online, check out our <a href=\"https://www.plancpills.org/find-pills\" id=\"\">Plan C Pills guide</a> to accessing abortion pills online in all 50 states and our <a href=\"https://www.plancpills.org/guide-how-to-get-abortion-pills\" id=\"\">FAQ</a> page.</p><p id=\"\">If you have additional questions about medication abortion or need assistance while having one, there is a <a href=\"https://www.mahotline.org/\" id=\"\">hotline run by medical professionals</a>. You can contact them at 1-833-246-2632. They're available via call or text for 18 hours a day.</p><p id=\"\">If you'd like peer support throughout the process of planning or having an abortion with pills at home, check out <a href=\"https://abortionhotline.org/\" id=\"\">reprocare's peer-based hotline</a> - open 7 days a week at 833-226-7821</p><p id=\"\">If you need help paying for your abortion with pills contact the <a href=\"https://abortionfreedomfund.org/\" id=\"\">Abortion Freedom Fund</a> or local <a href=\"https://abortionfunds.org/need-abortion/\" id=\"\">abortion funds</a> in your state.</p><h2 id=\"\">Here are some more great resources on at home abortions with misoprostol-only:</h2><p id=\"\">The Reproductive Health Access Project created <a href=\"https://www.reproductiveaccess.org/wp-content/uploads/2020/11/2022-07-How-to-Use-MAB-Pills-Miso-Only_final.pdf\" id=\"\">this flyer about self-managed miso-only abortions</a>.</p><p id=\"\">A <a href=\"https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(21)00461-7/fulltext#seccestitle150\" id=\"\">recent study</a> showed that self managed abortions with accompaniment are safe and found the &nbsp;misoprostol-only protocol to be up to 99% effective.</p><p id=\"\"><a href=\"https://info999.s3.amazonaws.com/mav2/story.html\" id=\"\">This video</a> (with sound) infographic explains how to take both misoprostol-alone and mifepristone with misoprostol.</p><p id=\"\">Check out this <a href=\"https://www.youtube.com/playlist?list=PLa-oDa0bl_LO5udAfTft0A7Q44_x_VMFO\" id=\"\">video playlist</a> from Doctors Without Borders all about self-managed abortion. The playlist includes <a href=\"https://www.youtube.com/watch?v=pB3JsJiz82E&list=PLa-oDa0bl_LO5udAfTft0A7Q44_x_VMFO&index=5&t=1s\" id=\"\">this video</a> that is specifically about misoprostol-only abortions and <a href=\"https://www.youtube.com/watch?v=AyZgY7zbCBM\" id=\"\">this one</a> on what to expect.</p><p id=\"\">‍<em id=\"\">Christie Pitney, WHNP-BC, CNM is an advanced practice midwife with Forward Midwifery and cofounder of Abortion Freedom Fund. She serves as clinician advisor for Plan C. </em></p>",
    "Date": ""
  },
  {
    "Name": "Bing Search",
    "Slug": "bing-search",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/669edf558eed489d62b9df9a_SocialMedia_062624_Repro-Bing-1%2B(1).png",
    "Content": "<p id=\"\">Co-authored by <a href=\"https://www.plancpills.org/\" target=\"_blank\" id=\"\">Plan C</a> and <a href=\"https://www.womenonweb.org/en/\" target=\"_blank\">Women on Web.</a><em id=\"\"> </em>Read the original post <a href=\"https://www.reprouncensored.org/blog/bing\">on ReproUncensored.org here</a>.</p><p id=\"\"><em id=\"\">Bing search engine is found filtering search results using the word “abortion”, while misspelling the word “abortion” is delivering more accurate search results for abortion-seekers.</em></p><p id=\"\">Every day, thousands of people worldwide rely on search engines to access crucial information about abortion care. For many, these searches are not leisure browsing—they are urgent pleas for help, made in times of crisis and with a real need for safe, helpful, and accurate responses. We know search engines use algorithms, but by nature of an “internet browser,” we assume they are designed to serve up results that are fact-based and a best match for the query. In fact, According to studies 75% of users click on one of the first three results of a search engine results page.</p><p id=\"\">In a time of heightened politics and late-stage capitalism, we realize this is not guaranteed–and recently we made a significant and troubling discovery on the search platform Bing, specific to terms having to do with abortion. Bing, which has a global reach of 1.1B people a month and boasts about <strong id=\"\">3 million monthly searchers in the US,</strong> holds a significant stake in the search engine market. Additionally, platforms like DuckDuckGo, AOL, and Yahoo pull their search results from Bing, extending the reach of its influence and, with just this March 2024, 23.71% of desktop search results coming from these platforms alone.</p><p id=\"\">Despite these market shares, recent extensive research from our team has revealed an alarming pattern: there seems to be a filter on Bing search results using the word “abortion,” which systematically eliminates<strong id=\"\"> or filters out essential abortion resources for seekers.</strong></p><figure id=\"\" class=\"w-richtext-figure-type-image \" data-rt-type=\"image\" data-rt-align=\"\"><div id=\"\"><img alt=\"\" src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/669edbb060140cd193fca371_Screen%2BShot%2B2024-06-18%2Bat%2B5.34.05%2BAM.png\" width=\"auto\" height=\"auto\" loading=\"auto\" id=\"\"></div></figure><p id=\"\">We found out that searches for terms like \"abortion hotline\" or \"abortion clinic guide\" <strong id=\"\">provide vastly different results depending on the introduction of typos in the term “abortion”</strong>. &nbsp;Misspelling the word “abortion” (think: \"ab<em id=\"\">bb</em>ortion\" or \"a<em id=\"\">N</em>bortion\") unexpectedly surface different and more accurate results including direct resources and services, while in searches with their correctly spelled counterparts (“abortion”) abortion services and organizations are mysteriously absent from results. This phenomenon extends to various organizations crucial for abortion care, including the Center for Reproductive Rights, the M+A Hotline and services like Aid Access and Abuzz Health, and the National Network of Abortion Funds. In addition, there were several instances of this occurring in foreign language searches, and it was notably evident for English search queries related to specific countries, such as “abortion access in Germany”.</p><p id=\"\"><strong id=\"\">Our conclusion is that this is no accident or glitch,</strong> this is a filter that Bing team members have built to manipulate search results, perhaps to sidestep abortion controversy all together. We do not think it is nefarious or anti-access/anti-abortion because it also seems to filter out Crisis Pregnancy Centers or “fake clinics.” </p><p id=\"\"><strong id=\"\">Example 1: pregnancy justice</strong></p><ul id=\"\"><li>Google #1 result: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li><li>Bing's #1 result: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li><li>Bing's Sidebar: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li></ul><p id=\"\">pregnancy justice abortion</p><ul id=\"\"><li>Google #1 result: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li><li>Bing's ## result: (<a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a> does not appear at all)</li><li>Bing's Sidebar: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li></ul><p id=\"\">pregnancy justice abbbortion</p><ul id=\"\"><li>Google #1 result: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li><li>Bing's #1 result: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li><li>Bing's Sidebar: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li></ul><p id=\"\">pregnancy justice abbbortion abortion</p><ul id=\"\"><li>Google #1 result: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li><li>Bing's #1 result: (<a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a> does not appear at all)</li><li>Bing's Sidebar: <a href=\"http://pregnancyjusticeus.org/\" id=\"\">pregnancyjusticeus.org</a></li></ul><p id=\"\"><strong id=\"\">Example 2: i need an abortion</strong></p><ul id=\"\"><li>Google #2 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li><li>Bing's ## result: (<a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a> does not appear at all)</li></ul><p id=\"\">i need aortion</p><ul id=\"\"><li>Google #3 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li><li>Bing's #1 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li></ul><p id=\"\">i need aortion abortion</p><ul id=\"\"><li>Google #6 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li><li>Bing's ## result: (<a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a> does not appear at all)</li></ul><p id=\"\">i need an abbbortion</p><ul id=\"\"><li>Google #2 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li><li>Bing's #2 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li></ul><p id=\"\">i need an abbbortion abortion</p><ul id=\"\"><li>Google #3 result: <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a></li><li>Bing's ## result: (<a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a> does not appear at all)<br></li></ul><p id=\"\">But the impacts reach farther than Bing.com – &nbsp;because of the partnerships described above in which Bing's search results are pulled into other engines, filtering extends to influence search results on platforms like AOL and DuckDuckGo - the latter of which is widely recommended in the abortion space as a secure and trusted browser. This exacerbates the impact of Bing’s filter manipulation across a broader spectrum of users – and coupled with Bing's autocorrect feature (which corrects typo terms back to their original, in this case defaulting the searcher back to the filtered, limited “abortion” search results), poses a significant barrier to individuals seeking accurate and reliable information about their abortion care.</p><p id=\"\"><strong id=\"\">The consequences of this filter are impossible to calculate but certainly, they are far-reaching, harmful, and potentially life-altering for abortion-seekers. </strong>Individuals in urgent need of accurate information may be directed instead towards irrelevant, misleading, confusing, or incomplete sources – from news articles to abortion blogs that don’t list resources to ones that actively discourage it – jeopardizing the individual’s health and well-being and altering their long-term outcomes as they make these important and time-sensitive decisions. </p><p id=\"\">Moreover, the systematic manipulation of search results raises larger concerns about our ability as a society to navigate the next chapter of reproductive rights against politico-religious strategies to limit and control information and services.<strong id=\"\"> We have questions about the ethical and business consequences of such manipulation, particularly in the realm of artificial intelligence.</strong> We know that ChatGPT pulls, or has pulled, search results from Microsoft’s Bing. Microsoft’s search tool might be informing and training their AI and impacting the future of discoverability/search. Though at the moment of writing, GPT4 / Copilot seems to be very capable of answering abortion access questions accurately and thoughtfully. </p><figure id=\"\" class=\"w-richtext-figure-type-image \" data-rt-type=\"image\" data-rt-align=\"\"><div id=\"\"><img alt=\"\" src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/669edbd1c847c638d00d9cb8_Screen%2BShot%2B2024-06-18%2Bat%2B5.36.13%2BAM.png\" width=\"auto\" height=\"auto\" loading=\"auto\" id=\"\"></div><figcaption id=\"\"><em id=\"\">Search “i need an abortion” vs “i need an aNbortion.” In search 1, ineedana is nowhere to be found. In search 2 with the abortion typo, ineedana.com is the second result.</em> </figcaption></figure><p id=\"\">The revelation of systematic filtering in Bing's search results for abortion underscores the critical <strong id=\"\">need for transparency, accountability, and ethical standards in digital platforms. </strong>As we navigate the complexities of information dissemination in the digital age, search engines hold great power – and with this, they must uphold their responsibility to provide accurate, comprehensive, and unbiased information as promised, especially on topics as sensitive, complex, and time-critical as abortion access. </p><p id=\"\"><strong id=\"\">Our ask is that</strong><strong> Microsoft must immediately cease the removal of accurate information about abortion access from their search results</strong>. <em>Know someone in Microsoft or Bing leadership?&nbsp;Drop us a line digital@plancpills.org.</em><br><br>As more and more people turn to Bing and Copilot for guidance in their most vulnerable moments, the stakes are too high to overlook the consequences of search results manipulation.</p><p id=\"\"><strong id=\"\">Here's How You Can Help:</strong></p><p id=\"\">Share this post and let your communities know about the corrupt search results. By spreading awareness, we can work together to advocate for transparency, accountability, and ethical considerations in digital platforms, ensuring access to accurate and reliable information, especially on sensitive topics like abortion access.</p><p>Follow&nbsp;<a href=\"http://instagram.com/reprouncensored\">@reprouncensored</a> and join <a href=\"http://ReproUncensored.org\">ReproUncensored.org's</a> efforts. </p><p>Share direct resources (plancpills.org, ineedana.com, mahotline.org, reprocare.com)&nbsp;instead of directing people to faulty search engines. Abortion seekers don't need search if they have information directories like Plan C and Ineedana and hotlines like the M+A&nbsp;Hotline and Reprocare. </p>",
    "Date": "Sat Jul 20 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Can I get in trouble for using abortion pills?",
    "Slug": "can-i-get-in-trouble-for-using-abortion-pills-extended",
    "Author": "",
    "Thumbnail": "",
    "Content": "<p id=\"\">It is possible, but not common. This blog can help you understand potential risks so that you can make your own decisions about risk with accurate information. </p><p id=\"\">No one should ever be punished for providing their own medical care. Yet, from 2000 to 2020, at least 61 people who have self-managed an abortion or have helped someone else <a href=\"https://www.ifwhenhow.org/resources/self-care-criminalized-preliminary-findings/\" target=\"_blank\">are known to have been arrested or prosecuted </a>(during the same time period, 100,000 people or more self-managed abortions). It is unknown how recent changes in abortion laws will affect future criminalization of people who self-manage their abortions. Those who are already at greater risk of criminalization because of their race, gender identity, economic status, or other factors may have a higher risk of prosecution. People who live in very conservative states also may face a higher risk of prosecution. Only one state currently has a law that says that self-managing an abortion is illegal (Nevada, after 23 weeks gestation).</p><p id=\"\">Plan C believes that each person should have access to information to make their own decisions about risk, including legal risk. The information below is not intended to endorse self-managed use nor is it legal advice. It is what we know from the experiences of people who have self-managed their abortions. </p><p id=\"\">The <a href=\"https://www.reprolegalhelpline.org/sma-contact-the-helpline/\" target=\"_blank\" id=\"\">Repro Legal Helpline</a> provides free and confidential legal advice that can help people better understand the laws and legal risk they may face. Contact them <a href=\"https://www.reprolegalhelpline.org/sma-contact-the-helpline/\" target=\"_blank\" id=\"\">online</a> or call <a href=\"tel:8448682812\" id=\"\">844-868-2812</a>.</p><h5 id=\"\">‍<strong id=\"\">Why have some people gotten in legal trouble?</strong></h5><p id=\"\">Self-managed abortion is not a criminal act, and restricting abortion access is considered by leading justice organizations to be a human rights violation. However, some people who have used abortion pills on their own have gotten in<a href=\"https://www.ifwhenhow.org/wp-content/uploads/2021/11/20_04_Final_SMA_TheLaw_COVID-19_FactSheet_PDF.pdf\" target=\"_blank\" id=\"\"> legal trouble</a> in the United States. Between 2000 and 2020, there have been <a href=\"https://www.ifwhenhow.org/resources/self-care-criminalized-preliminary-findings/\" target=\"_blank\" id=\"\">at least 61 cases </a>where people have been prosecuted for self-managing their abortions (charges have varied from concealing a birth to homicide) or helping someone else self-manage an abortion. During that same time, research suggests that a hundred thousand (or likely more) people have self-managed their abortions. We do not know how new laws about abortion will affect the criminalization of people for self-managing an abortion. </p><h5 id=\"\">These examples can help you understand the ways in which people have gotten in legal trouble in the past:</h5><blockquote id=\"\"><strong id=\"\">Example 1:&nbsp;</strong>“I went to urgent care because I was scared about the bleeding, and my doctor reported me to the police.”</blockquote><p id=\"\">Everyone should be able to access urgent care when they are concerned about their health. But, in a few cases urgent care staff have called the police on people who have taken abortion pills that they purchased online. This is not ethical and should not happen. When seeking urgent or emergent care, people are not required to report to clinicians that they have used abortion pills. The symptoms after taking abortion pills are the same as a miscarriage. <a href=\"https://gynuity.org/resources/info/faq-on-misoprostol-detection-in-blood/\" id=\"\">Blood tests do not reveal any differences between a miscarriage and a medication abortion</a>. Medical providers can safely and effectively care for patients who have used abortion pills without needing to know their full medical history.</p><p id=\"\">Federal law (<a href=\"https://www.cms.gov/medicareprovider-enrollment-and-certificationsurveycertificationgeninfopolicy-and-memos-states-and/reinforcement-emtala-obligations-specific-patients-who-are-pregnant-or-are-experiencing-pregnancy-0\" id=\"\">EMTALA</a>) also says that clinicians must provide abortion care to address a medical emergency for all patients who present at a hospital emergency department. This applies even in states that have restrictions on abortion. </p><p id=\"\">People can often avoid the need for urgent care by consulting with a knowledgeable clinician by phone. The <a href=\"https://www.mahotline.org\" id=\"\">Miscarriage and Abortion Hotline</a> offers free text and phone assistance to anyone who has medical questions.</p><blockquote id=\"\"><strong id=\"\">Example 2:&nbsp;</strong>“The tissue that came out was bigger than I expected and I didn’t know what to do with it.”</blockquote><p id=\"\">Sometimes people have been reported to the police because of the way in which they disposed of the miscarriage tissue. Most early abortion tissue is just blood and clots (like a heavy period) that can be flushed down the toilet. But sometimes when abortion pills are taken later in pregnancy there is more tissue. It can be hard to know how to dispose of it (this is true when someone has a miscarriage, too). Some people have been discovered when tissue has been found in the public sewer system, when they have told friends about their situation and the friends have reported them to the police, or when they have shared information with their medical provider and been reported. </p><blockquote id=\"\"><strong id=\"\">Example 3:&nbsp;</strong>“My boyfriend found information in my search history and reported me.”</blockquote><p id=\"\">Digital communications (like email and texts) can be used as evidence against someone who has done an abortion on their own (without a prescription). People often use Incognito Mode (also called a Private Window) when searching for sensitive information<em id=\"\">. </em>Most private browser settings/incognito window searches won’t retain your cookies, browsing history, search records, passwords, or personally identifiable information<em id=\"\">. </em>Some people protect their digital privacy by using free VPNs (Virtual Private Networks) like <a href=\"https://protonvpn.com\" target=\"_blank\" id=\"\">Proton VPN</a> or by using the <a href=\"https://www.torproject.org/\" id=\"\">TOR Browser.</a><em id=\"\"> </em>VPNs can be used on computers and phones. When used in combination with Private Windows or Incognito Mode, they can keep your identity and location private when you search for information and make purchases (like buying abortion pills online), as long as you aren’t logging into accounts which are linked to you. People also use encrypted email (like<a href=\"https://proton.me/mail\" target=\"_blank\" id=\"\"> Proton Mail</a>) and secure texting (like<a href=\"https://signal.org\" target=\"_blank\" id=\"\"> Signal</a>) to keep online communications private. Some people use a public library computer to avoid a data trail (ask your library if they delete search histories and have systems in place to protect your confidentiality). Some people try to keep online purchases discreet by using online currency such as<a href=\"https://bitcoin.org/en/\" target=\"_blank\" id=\"\"> Bitcoin</a>, but without some complicated additional steps those purchases can still be linked to an individual person. The Electronic Frontier Foundation has some additional tips about data privacy <a href=\"https://www.eff.org/deeplinks/2022/05/digital-security-and-privacy-tips-those-involved-abortion-access\" id=\"\">here</a>.</p><blockquote id=\"\">Example 4: “I told my friend and she reported me to the police.”</blockquote><p id=\"\">When facing an unplanned pregnancy or self-managing an abortion, it is reasonable to want support from friends. Unfortunately, sometimes people have been criminalized for self-managing an abortion when a friend or acquaintance has reported them to the police. Reports by friends and acquaintances accounted for more than a quarter of the 61 known criminalizations between 2000 and 2020. &nbsp;</p><h5 id=\"\"><strong id=\"\">Have Legal Questions?</strong></h5><p id=\"\">Once someone has decided to have an abortion, they should be able to do so safely, effectively, and with dignity. No one should be arrested or jailed for ending their own pregnancy. But, if someone who chooses to use abortion pills outside of the established medical system gets into trouble it is important for them to get legal help. Organizations that can help people get legal help are:</p><ul id=\"\"><li id=\"\"><a href=\"https://www.reprolegalhelpline.org/sma-contact-the-helpline/\" target=\"_blank\" id=\"\">Repro Legal Helpline</a> provides free, confidential legal support <a href=\"https://www.reprolegalhelpline.org/sma-contact-the-helpline/\" target=\"_blank\" id=\"\">online</a> or at 844-868-2812. They also defend people who are prosecuted or threatened with prosecution for self-managing their abortion. This<a href=\"https://www.reprolegalhelpline.org/sma-faq/\" target=\"_blank\" id=\"\"> fact sheet</a> also has some great information about legal issues.</li><li id=\"\"><a href=\"https://www.pregnancyjusticeus.org/get-help/\" id=\"\"><strong id=\"\">Pregnancy Justice</strong></a>: Pregnancy Justice defends women who are pregnant and attempt to have abortion, actually have an abortion, or are mistaken as someone who has had an abortion.</li></ul><h5 id=\"\"><strong id=\"\">Remember:</strong></h5><ul id=\"\"><li id=\"\">Between 2000 and 2020, at least 61 people have been arrested and prosecuted for self-managing their abortion or helping someone else. It is unclear how new abortion laws will affect the future criminalization of people for self-managing an abortion. We know that tens of thousands of people are successfully accessing and using pills by mail in restricted states each month.</li><li id=\"\">Those who choose to use abortion pills on their own do not have to tell anyone that they took abortion pills (and doing so may increase the risk of prosecution).</li><li id=\"\">There is no way for a medical provider to know whether someone took abortion pills. The bleeding looks the same as a miscarriage.</li><li id=\"\">Medical providers can give appropriate follow up care for bleeding and pain without knowing whether someone took abortion pills.</li><li id=\"\">Some people use VPNs and other technology to protect their privacy.</li><li id=\"\"><a href=\"https://www.reprolegalhelpline.org/\" target=\"_blank\" id=\"\">Legal assistance</a> is available to those who need it.</li></ul>",
    "Date": "Wed Jan 01 2020 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Election 2024: The Trump administration is an incoming disaster for reproductive justice, but abortion is here to stay.",
    "Slug": "election-2024-the-trump-administration-is-an-incoming-disaster-for-reproductive-justice-but-abortion-is-here-to-stay",
    "Author": "Plan C",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\">Plan C: The Trump administration is an incoming disaster for reproductive justice, but abortion is here to stay.&nbsp;</strong></p><p id=\"\">Contact: <a href=\"mailto:press@plancpills.org\" id=\"\">press@plancpills.org</a>&nbsp;</p><p id=\"\">Releases and background at: <a href=\"http://plancpills.org/media\" id=\"\">plancpills.org/media</a> and <a href=\"http://plancpills.org/about\" id=\"\">plancpills.org/about</a>&nbsp;</p><p>‍</p><p id=\"\"><em>November 6, 2024</em></p><p id=\"\">Donald Trump’s second administration is an incoming disaster for reproductive justice. While we can expect the worst for abortion rights, we also know that <strong id=\"\">no matter what, abortion is here to stay</strong>. In all 50 states, even those with bans, abortion access will not be fully dictated by politics or policy, and cannot be stopped. Since the fall of <em id=\"\">Roe</em>, a robust network has formed to help abortion seekers get the care they need in every state. Activist and international providers, community groups, and online vendors will continue to provide abortion seekers with abortion pills and information about how to use them safely, no matter what may come at a federal level.</p><p id=\"\">It’s small comfort, but we’re heartened to see how many of the state abortion referendums passed with large margins: state bans were overturned by ballot measure in MO and AZ, although not FL, SD, or NE; abortion rights were confirmed to the state constitutions in NY, MA, MT, NV, and CO. American voters have affirmed their support for reproductive freedom, repeatedly, when given the choice at the ballot box.&nbsp;</p><p id=\"\">Despite Donald Trump’s double-talk on this issue during the campaign, we fully expect the Trump Administration to push for a national abortion ban and support the many unjust state bans and restrictions that criminalize abortion seekers, providers, advocates, and community members who help with access. We expect to see the tenets of Project 2025 considered or implemented during a Trump administration, including the misapplication of the Comstock Act to prohibit mailing of abortion pills, threats to shield laws, and other attempts to keep life-saving, safe medication out of the hands of people who need it.&nbsp;</p><p id=\"\">As we prepare for this incoming administration and the attack against abortion access, the most important tool we have at this time is information: letting people know that safe abortion access exists, and how to find it. The road ahead is uncertain but in the weeks before Inauguration Day, <strong id=\"\">there are specific actions people can take now to protect their access and share information</strong>:&nbsp;</p><p>‍</p><ol id=\"\"><li><strong id=\"\">Order Plan C stickers.</strong> To date, supporters across the US have ordered more than two million free stickers to put up in their hometowns and on their travels. Stickers link to the Plan C Guide and passively spread information about how people are accessing abortion pills and support, from any state.</li></ol><p id=\"\"><a href=\"http://plancpills.org/stickers\" id=\"\">plancpills.org/stickers</a></p><p>‍</p><ol start=\"2\" id=\"\"><li><strong id=\"\">Get pills in advance. </strong>The Guide also lists ways people are accessing highly affordable abortion pills now before they need them (as low as $25), to keep on hand just in case.&nbsp;</li></ol><p id=\"\">Visit <a href=\"http://plancpills.org/pills-in-advance\" id=\"\">plancpills.org/pills-in-advance</a> to learn more and find pill options.</p><p id=\"\"><em id=\"\">And if you want to support people to access pills, </em><a href=\"https://abortionfreedomfund.org/donate\" id=\"\"><em id=\"\">donate</em></a><em id=\"\"> to Abortion Freedom Fund.</em>&nbsp;</p><p>‍</p><ol start=\"3\" id=\"\"><li><strong id=\"\">Spread the word about resources. </strong>It’s a new era, and it’s important for everyone to know about the new systems beyond traditional clinic care that have evolved in the years post-<em id=\"\">Roe</em>. &nbsp;Learn about and bookmark the resources that exist and will continue to help people access abortion from all states:&nbsp; <br><ul id=\"\"><li>For pills and info on using them, visit plancpills.org&nbsp;</li><li>For clinics, travel and pills by mail visit ineedana.com&nbsp;&nbsp;</li><li>For medical support mahotline.org</li><li>For legal support reprolegalhelpline.org&nbsp;</li></ul></li></ol><p id=\"\">New resource <a href=\"http://youalwayshaveoptions.com\" id=\"\"><strong id=\"\">YouAlwaysHaveOptions.com</strong></a><strong id=\"\"> </strong>was created by SYA, Plan C and other movement partners seeking one simple way to direct people to core resources related to pills, clinics, funding, and medical and legal support. People can save the link, and share widely in response to ongoing news about bans and restrictions.</p><p id=\"\"><a href=\"https://url1005.email.actionnetwork.org/ss/c/u001.v2UrIOJHHKkg0Pk-aGvhy86aRQ40LcVh_OnSJ8gVg4RQuwI61CAmtFDbJ3TzWFA1VUqm10KbZ1Yk3DNMEKdbIki5_r5RsE7fDlnEJbcjyY-pM99AjRqItL_XE_157t3xaE7ppls4wefxMkFg4X8S7Ek4Jx0Sp6E6lJePoHhNhke2dLp8M_Dk5eMlgdn0tGm8Elpx8dncJXR7zukTZ-wmi2XzmlRkkwAyc1lYh3uK552d2SmFoDHPQVYJ-Qd4DS6AbmghQ51b5U24g5V9XJyLxAeXX2P7JkZZSUlsa-xt5ZQD7FAEz5fB39dIMs6pVHEQTyLrp4iAd5Nx2Hbri8xZIbr_O6naoWfi6bjnW88C_ct63dDhVElX5XRZQ88j3EIgtvtkOXwgCUGoS5W0MEuIIyiy9u5-cqMDdFcrSXOrtJjE5PI-YRysNBa46Rw6L0gVqWqekj20w83CWvrMIkof-Wry_bCjXmQ38JnVlMIXRKKcgStF555EGD3BdveUqEFdnOP99lC0Flqg8RJmMfTF61nswWrGF3qRe6I4nMDuHVdOSPlx0zXwNSf30_EpCsUCPui_QCFJwKImIjbUgDtyW3Lm6Axj0LuI34tlZu02YulafY1AHVC0EayAEvi8Z-LGnySJmIPqb4bTh1I8x7bk_NQNPXQDrqhzLgIl8qmEa2BfPypRHWpJKt14BphhPEg9D98Gg-GxUuhu1Uw73j9OplWh3I3ZDtxYpWrssXYlPXd1qUsRn2ZilwrT1xl-PoHTj_MSiuXfRlUnMm94FT5ZokeTZIBen3XszdPhd8NFwL5z09A6pz4HmWo3AazuPy8E/4b7/p7hBtykYQjC4GrBvte8tWg/h3/h001.K_6EyZBwmiYyJTN-SbWryHrjDCtIdxvYJ033wV1jniY\"><strong id=\"\">YOU ALWAYS HAVE OPTIONS</strong></a>&nbsp;</p><p id=\"\">Plan C remains committed to sharing information about how to access pills in all states through our <a href=\"https://www.plancpills.org/\" id=\"\"><em id=\"\">Guide to Pills</em></a> as laws and availability evolve so people have the information necessary to access safe options in the face of unjust bans.&nbsp;&nbsp;</p><p>‍</p><p id=\"\"><em id=\"\">“I’m horrified to be looking at yet another Trump administration, and expect that this iteration will be much worse for abortion seekers than his first. But abortion pills are here to stay. Community distribution networks and overseas providers will remain intact, and abortion pills will continue to come into the country. Through it all, PlanCPills.org will provide information about how to access these safe and effective pills in every state.”&nbsp;</em></p><ul id=\"\"><li id=\"\"><em id=\"\">Elisa Wells, Cofounder, Plan C Pills</em></li></ul><p>‍</p><p id=\"\">You can learn more about how to access abortion pills by mail at plancpills.org, and contact us for a quote or conversation at <a href=\"mailto:press@plancpills.org\" id=\"\">press@plancpills.org</a>.&nbsp;&nbsp;</p><p>‍</p><p id=\"\"><strong id=\"\">About Plan C:</strong></p><p>‍</p><p id=\"\">Plan C is an information campaign and catalyst for access to abortion pills by mail in the US.&nbsp;</p><p>‍</p><p id=\"\">Since 2015, Plan C has helped to lead the way in normalizing self-directed abortion care in the US: actively increasing awareness of this safe and effective method and catalyzing new routes of direct access to pills by mail and with free and confidential support, from any state. Plan C maintains the only comprehensive, research-based <a href=\"http://plancpills.org\" id=\"\"><em id=\"\">Guide to Pills</em></a>, which includes both mainstream and alternate routes of access to pills by mail and support in the US. Plan C also runs creative campaigns, works with brands and media, and builds cross-sector partnerships to educate and advocate, make the method more known and available and reach audiences facing the biggest barriers to care. We do this under a vision of disentangling this safe and effective medication from politics, and moving agency over abortion back to the individual seeker.</p>",
    "Date": "Mon Jun 24 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "What the Jan 12th SCOTUS decision means for FDA restrictions on abortion pills",
    "Slug": "jan-2021-scotus",
    "Author": "",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c2702987bcb496a6f86_600130a529438c2b934c0cf1_Plan%2520C%2520-%2520%2520SCOTUS.png",
    "Content": "<p id=\"\">On January 12, 2021, despite the ongoing national emergency due to the COVID-19 pandemic, the US Supreme Court reinstated a federal restriction on the dispensing of mifepristone, one of the two medications in a medication abortion. <br><br>In our opinion, the media oversimplified (and dare we say misinterpreted) this situation with headlines like “<em id=\"\">Justices Say Women Must Obtain Abortion Pill in Person</em>\" (NPR) and “<em id=\"\">Supreme Court Halts Mail Delivery of Abortion-Inducing Pills</em>” (Bloomberg). <br><br><strong id=\"\">We believe these headlines are not correct.</strong> In fact, the judges did not rule on whether or not pills can be mailed. More accurate is the NY Times headline that reads “<a href=\"https://www.nytimes.com/2021/01/12/us/supreme-court-abortion-pill.html\" target=\"_blank\"><strong id=\"\"><em id=\"\">Supreme Court Revives Abortion-Pill Restriction</em></strong></a><em id=\"\">.</em>” What the court did do was put the power to restrict mifepristone back into the hands of the FDA, essentially stating that it is not the business of the courts to determine scientific and medical matters. <br><br>This puts the country back in the same situation we were in at the beginning of the COVID-19 pandemic: FDA restrictions are in place which keep mifepristone out of pharmacies and dictate how and when it should be dispensed by the companies who make it and their contracting physicians. <br><br>Over the past year, in response to the needs created by the pandemic, numerous online companies have launched, providing care virtually via telemedicine and mailing pills to patient doorsteps. They had done their due diligence and launched in states where they could do so in conformance with the FDA regulations and local regulations. But now, with this new ruling, this model of care is once more under scrutiny.<br><br>The patient-centered approach of online provision of abortion pills during a pandemic both increases access to early abortion and reduces the risk of infection. This model of care should not be subject to political tug-of-war. We support those courageous medical providers who are continuing to provide their patients with the best care possible for their health and well-being.<br><br>We will continue to push against any announcement or action that seeds confusion and fear about accessing this critically-needed health care service. Anything that creates more obstacles to abortion care disproportionately affects those with already limited access due to geography, socioeconomics or race.<br><br><strong id=\"\">Now more than ever, individuals have a right to demand equitable access to this safe, effective and proven option for basic health care. &nbsp;</strong><br><br>We will continue to make updates to the website and the <a href=\"/\"><strong id=\"\">Guide to Pills</strong></a> as we know more about how organizations and services choose to interpret this change.<br></p>",
    "Date": "Wed Jan 13 2021 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Writing a \"Letter to the Editor\" for your local paper",
    "Slug": "letters-to-the-editor",
    "Author": "Plan C",
    "Thumbnail": "",
    "Content": "<h3 id=\"\">Why consider writing a “letter to the editor?”</h3><ul id=\"\"><li>Public interest in abortion access has grown following the repeal of <em id=\"\">Roe vs. Wade</em>, but much of the general public is still unaware that medication abortion, aka abortion pills, are available by mail in all states. At times this includes even the editors and reporters who are working on this issue!&nbsp;</li><li>Media in states with restrictive reproductive rights laws may be less likely to represent all possible abortion care options to their audiences. Informed residents need effective ways to overcome these blocks to accurate information.</li><li>So many of us are busy:&nbsp;but we hope that by drafting this customizable letter template, we make it easy for anyone who wants to take action.</li></ul><h3 id=\"\">The Goal(s):</h3><ul id=\"\"><li>To help abortion seekers in states with bans learn about their options to receive abortion pills by mail&nbsp;&nbsp;</li><li>To help activists step into or deepen their engagement with abortion issues by communicating with local media outlets in discussions of abortion rights&nbsp;</li><li>To increase general public visibility and awareness of mail-order medication abortion options, particularly in states with restrictive laws, and </li><li>To educate or inform journalists on the pills by mail option to inform future articles.&nbsp;</li></ul><p>‍</p><h3 id=\"\">The&nbsp;Template: </h3><p><em>This is our suggested framing: but there is no one rightway to write a letter. Use this as a guide, check your facts, and make sure you're comfortable being public on a potentially public piece.&nbsp;Then, go for it. </em>‍</p><p>I appreciated your recent [<em id=\"\">article/post/video</em>] regarding the crucial issue of access to abortion care [<em id=\"\">add any additional details about the specific piece</em>]. However, I noticed that this [<em id=\"\">article/post/video</em>] did not mention the option of abortion pills by mail, now a reality in all states. Even in [<em id=\"\">name your state</em>] and restricted states, abortion pills are available and accessible for anyone with a mailing address and an internet connection.</p><p id=\"\">Medication abortion is the combination of mifepristone and misoprostol, <a href=\"https://pubmed.ncbi.nlm.nih.gov/26241252/\" id=\"\">99% effective</a> and <a href=\"https://www.plannedparenthood.org/learn/abortion/the-abortion-pill/how-safe-is-the-abortion-pill\" id=\"\">safer than Tylenol</a>. In recent years, abortion pills have become a critical tool in increasing safe abortion access in the US, particularly for the tens of millions of residents in states that restrict or ban care. In fact, tens of thousands of people per month are safely accessing medication abortion online, which statistically make up for any perceived drop in the number of abortions after the <em id=\"\">Dobbs</em> decision. (This <a href=\"https://societyfp.org/wp-content/uploads/2024/02/SFPWeCountPublicReport_2.28.24.pdf\" id=\"\">#WeCount Study</a> shows that 16% of all abortions are now with telehealth, and more recent <a href=\"https://jamanetwork.com/journals/jama/article-abstract/2816817#:~:text=Findings%20In%20this%20cross%2Dsectional,based%20on%20pre%2DDobbs%20levels.\" id=\"\">Univ. of Texas research</a> demonstrates the increase in self-managed care.)</p><p id=\"\">This is because <a href=\"https://reproductiverights.org/maps/abortion-laws-by-state/\" id=\"\">multiple states have passed shield laws to help providers</a> offer telemedicine and mail pills into states with bans, community activist networks are mailing pills for free, and hotlines like <a href=\"http://mahotline.org\" id=\"\">M+A Hotline</a> and <a href=\"http://reprolegalhelpline.org\" id=\"\">ReproLegalHelpline</a> give free and confidential answers to abortion seekers’ questions as they go. Nonprofits like <a href=\"http://ineedana.com\" id=\"\">ineedana.com</a> and <a href=\"http://www.plancpills.org\" id=\"\">Plan C</a> host state-by-state directories of information on these and other options, which can be found on their websites.</p><p id=\"\">Thank you for your consideration of these details, which are critical to any article intending to accurately describe and represent the current abortion access landscape.&nbsp;</p><p id=\"\">‍</p><p id=\"\">Sincerely,</p><p id=\"\">[<em id=\"\">your name</em>]</p><p id=\"\">‍</p><p>Contact us with any questions at community@plancpills.org. </p>",
    "Date": "Fri Mar 01 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Mife + Miso Animated Series",
    "Slug": "mife-miso-animated-series",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65970bc844be478ddf9ea269_mail-envelope-animation.png",
    "Content": "<figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-floatleft\" style=\"max-width:20%\" data-rt-type=\"image\" data-rt-align=\"floatleft\" data-rt-max-width=\"20%\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65970f1f15f92ea4d0f82a09_ma_flying.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></figure><p id=\"\">We worked with <a href=\"https://www.runawaytrainproductions.co/\" target=\"_blank\">Runaway Train Productions</a> and <a href=\"https://reelblackstudios.com/\" target=\"_blank\">Reel Black Studios</a> to create a series of 4 educational animations with mife + miso pills as the “heroes” of the story. Topics included miso-only protocols, the M+A Hotline, and the availability of pills in advance. &nbsp;</p><h3 id=\"\">1. Abortion Pills in Advance</h3><p id=\"\">This animation was designed to help people learn more about how people are getting pills in advance, and consider whether ordering pills in advance is right for them. Together we can make this option more known and available and move control over repro autonomy back to the hands of people who need it. And what better day to put pills in hands than the would-be anniversary of <em id=\"\">Roe</em>?</p><p id=\"\"><a href=\"https://drive.google.com/file/d/1yiga2JLq8z023-vii5EXK5k4RWRyqEPA/view?usp=drive_link\" target=\"_blank\" id=\"\">View the English Video</a> </p><p id=\"\"><a href=\"https://drive.google.com/file/d/17yUrFbnuJf7x_mLnKSwAWmjcZPF8BIcs/view?usp=drive_link\" target=\"_blank\" id=\"\">View the Spanish Video</a> </p><p id=\"\">‍</p><h3 id=\"\">1. The M+A&nbsp;Hotline </h3><p id=\"\">In the wake of the SCOTUS decision that stayed any new disruption to mifepristone, Plan C and the M+A Hotline launched a new informational animation&nbsp;about the hotline’s free and confidential services for anyone seeking to self-manage an abortion with pills.&nbsp;</p><p id=\"\"><a href=\"https://drive.google.com/file/d/1UPTmrDUk0_T6bSSuhvZNrEIwKVNeR9m9/view?usp=drive_link\" target=\"_blank\" id=\"\">View the English Video</a> </p><p id=\"\"><a href=\"https://drive.google.com/file/d/1vax-L9sNQaqcIbU1Y4Ll30fVCJ-_Z3P0/view?usp=drive_link\" target=\"_blank\" id=\"\">View the Spanish Video</a> </p><div data-rt-embed-type='true'><blockquote class=\"instagram-media\" data-instgrm-captioned data-instgrm-permalink=\"https://www.instagram.com/reel/CrcReiuo2Qr/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:540px; min-width:326px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\"><div style=\"padding:16px;\"> <a href=\"https://www.instagram.com/reel/CrcReiuo2Qr/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\" background:#FFFFFF; line-height:0; padding:0 0; text-align:center; text-decoration:none; width:100%;\" target=\"_blank\"> <div style=\" display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #F4F4F4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\"></div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\"></div> <div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\"></div></div></div><div style=\"padding: 19% 0;\"></div> <div style=\"display:block; height:50px; margin:0 auto 12px; width:50px;\"><svg width=\"50px\" height=\"50px\" viewBox=\"0 0 60 60\" version=\"1.1\" xmlns=\"https://www.w3.org/2000/svg\" xmlns:xlink=\"https://www.w3.org/1999/xlink\"><g stroke=\"none\" stroke-width=\"1\" fill=\"none\" fill-rule=\"evenodd\"><g transform=\"translate(-511.000000, -20.000000)\" fill=\"#000000\"><g><path d=\"M556.869,30.41 C554.814,30.41 553.148,32.076 553.148,34.131 C553.148,36.186 554.814,37.852 556.869,37.852 C558.924,37.852 560.59,36.186 560.59,34.131 C560.59,32.076 558.924,30.41 556.869,30.41 M541,60.657 C535.114,60.657 530.342,55.887 530.342,50 C530.342,44.114 535.114,39.342 541,39.342 C546.887,39.342 551.658,44.114 551.658,50 C551.658,55.887 546.887,60.657 541,60.657 M541,33.886 C532.1,33.886 524.886,41.1 524.886,50 C524.886,58.899 532.1,66.113 541,66.113 C549.9,66.113 557.115,58.899 557.115,50 C557.115,41.1 549.9,33.886 541,33.886 M565.378,62.101 C565.244,65.022 564.756,66.606 564.346,67.663 C563.803,69.06 563.154,70.057 562.106,71.106 C561.058,72.155 560.06,72.803 558.662,73.347 C557.607,73.757 556.021,74.244 553.102,74.378 C549.944,74.521 548.997,74.552 541,74.552 C533.003,74.552 532.056,74.521 528.898,74.378 C525.979,74.244 524.393,73.757 523.338,73.347 C521.94,72.803 520.942,72.155 519.894,71.106 C518.846,70.057 518.197,69.06 517.654,67.663 C517.244,66.606 516.755,65.022 516.623,62.101 C516.479,58.943 516.448,57.996 516.448,50 C516.448,42.003 516.479,41.056 516.623,37.899 C516.755,34.978 517.244,33.391 517.654,32.338 C518.197,30.938 518.846,29.942 519.894,28.894 C520.942,27.846 521.94,27.196 523.338,26.654 C524.393,26.244 525.979,25.756 528.898,25.623 C532.057,25.479 533.004,25.448 541,25.448 C548.997,25.448 549.943,25.479 553.102,25.623 C556.021,25.756 557.607,26.244 558.662,26.654 C560.06,27.196 561.058,27.846 562.106,28.894 C563.154,29.942 563.803,30.938 564.346,32.338 C564.756,33.391 565.244,34.978 565.378,37.899 C565.522,41.056 565.552,42.003 565.552,50 C565.552,57.996 565.522,58.943 565.378,62.101 M570.82,37.631 C570.674,34.438 570.167,32.258 569.425,30.349 C568.659,28.377 567.633,26.702 565.965,25.035 C564.297,23.368 562.623,22.342 560.652,21.575 C558.743,20.834 556.562,20.326 553.369,20.18 C550.169,20.033 549.148,20 541,20 C532.853,20 531.831,20.033 528.631,20.18 C525.438,20.326 523.257,20.834 521.349,21.575 C519.376,22.342 517.703,23.368 516.035,25.035 C514.368,26.702 513.342,28.377 512.574,30.349 C511.834,32.258 511.326,34.438 511.181,37.631 C511.035,40.831 511,41.851 511,50 C511,58.147 511.035,59.17 511.181,62.369 C511.326,65.562 511.834,67.743 512.574,69.651 C513.342,71.625 514.368,73.296 516.035,74.965 C517.703,76.634 519.376,77.658 521.349,78.425 C523.257,79.167 525.438,79.673 528.631,79.82 C531.831,79.965 532.853,80.001 541,80.001 C549.148,80.001 550.169,79.965 553.369,79.82 C556.562,79.673 558.743,79.167 560.652,78.425 C562.623,77.658 564.297,76.634 565.965,74.965 C567.633,73.296 568.659,71.625 569.425,69.651 C570.167,67.743 570.674,65.562 570.82,62.369 C570.966,59.17 571,58.147 571,50 C571,41.851 570.966,40.831 570.82,37.631\"/></g></g></g></svg></div><div style=\"padding-top: 8px;\"> <div style=\" color:#3897f0; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:550; line-height:18px;\">View this post on Instagram</div></div><div style=\"padding: 12.5% 0;\"></div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"><div> <div style=\"background-color: #F4F4F4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\"></div> <div style=\"background-color: #F4F4F4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\"></div> <div style=\"background-color: #F4F4F4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\"></div></div><div style=\"margin-left: 8px;\"> <div style=\" background-color: #F4F4F4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\"></div> <div style=\" width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg)\"></div></div><div style=\"margin-left: auto;\"> <div style=\" width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\"></div> <div style=\" background-color: #F4F4F4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\"></div> <div style=\" width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\"></div></div></div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\"></div> <div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\"></div></div></a><p style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; line-height:17px; margin-bottom:0; margin-top:8px; overflow:hidden; padding:8px 0 7px; text-align:center; text-overflow:ellipsis; white-space:nowrap;\"><a href=\"https://www.instagram.com/reel/CrcReiuo2Qr/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px; text-decoration:none;\" target=\"_blank\">A post shared by Plan C (@plancpills)</a></p></div></blockquote> <script async src=\"//www.instagram.com/embed.js\"></script></div><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-floatright\" style=\"max-width:20%\" data-rt-type=\"image\" data-rt-align=\"floatright\" data-rt-max-width=\"20%\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65970db815f92ea4d0f72ea5_EN_1%20.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></figure><h3 id=\"\">3. Miso-Only Protocols</h3><p id=\"\">When mife isn’t available or wanted, miso-only abortions can be a safe option to self-manage your abortion and is found to be 84-96% effective. This 1-min animation was created to help anyone understand the miso-only method, an important part of the self-managed abortion ecosystem especially in a post-Roe US.</p><p id=\"\"><a href=\"https://drive.google.com/file/d/1_zawqsDMD7RI21QwiRE_9dRVXITnbs0V/view?usp=drive_link\" target=\"_blank\" id=\"\">View the English Video</a> </p><p id=\"\"><a href=\"https://drive.google.com/file/d/1d623lsJZPYAhiQUYzdcM5up3NI9ZQyR3/view?usp=drive_link\" target=\"_blank\" id=\"\">View the Spanish Video</a> </p><h3 id=\"\">4. Plan C's Impact </h3><p id=\"\">No matter how courts and politicians try to block access, resources like the M+A Hotline and the Plan C Guide will continue to share information, sources of support, and alternate routes of access to pills. And it's working -- see how many people we've reached this year in our recent animation. Abortion pills are here to stay, and these resources are here for the people accessing and using them.</p><p id=\"\"><a href=\"https://drive.google.com/file/d/1BuvRyYzgLY9de16IC_XI8-Xp3H8eY8EV/view?usp=drive_link\" target=\"_blank\" id=\"\">View the English Video</a> </p><p id=\"\"><a href=\"https://drive.google.com/file/d/1SkcWFDP70L8960LCtvYyaN2rCFnfGFAy/view?usp=drive_link\" target=\"_blank\" id=\"\">View the Spanish Video</a> </p>",
    "Date": ""
  },
  {
    "Name": "First-of-a-Kind Abortion Ads Launch at NYC Subway Stations with Information About Self-Managed Abortion, Including Access Options, Hotlines, and Resources",
    "Slug": "mta-subway-campaign",
    "Author": "Ben Currey",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c26c64d19388048e820_62a3b8bd82cb978d01171f73_unnamed.png",
    "Content": "<p id=\"\">DATE: April 8, 2022Media Contact: Ben Currey, <a href=\"mailto:ben.currey@berlinrosen.com\" id=\"\">ben.currey@berlinrosen.com</a>, (551) 265-0397</p><p id=\"\">*** FOR IMMEDIATE RELEASE ***First-of-a-Kind Abortion Ads Launch at NYC Subway Stations with Information About Self-Managed Abortion, Including Access Options, Hotlines, and Resources</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a492649a5e22222e6072f6_FqTbscAy6O09QtqBlt6R0-Q1D_c9prjP2U1Wj9RN4lj18KXJdjluva-_L1KvGVVMybcmgX3N-zKT4_fwcGNjMEbZHE2B14hxtPCRJChvQOazi0Etd9Yhs80HKA8ivg933fOna_Ul91etwvg_RRyI0Q.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></figure><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a4927cc78b913885764235_0GmJvM-UpyHYKa3XoR-pk-GkntSkS1gHxsrCxSHuRmkPR_47V7FmrMFvhqIHGUy6qdpj5crzmZK-qiQMtCrlKhDPOQyzmA82h4DLOmtyUAjYPsmBVziIZ5QemVmIukC-dR173LIQhimd16DEnClGkQ.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div><figcaption>English and Spanish Ads Are Being Displayed At NYC Subway Stations</figcaption></figure><p id=\"\"><strong>New York, NY</strong> – Today, partners in reproductive rights, health, and justice celebrated the launch of New York City subway ads about self-managed abortion, including access options, hotlines, and resources for people seeking care and legal counsel. The ads, which are running in both English and Spanish, are being displayed at subway stations in New York City. One ad is for a confidential helpline, run by the legal organization group If/When/How: Lawyering for Reproductive Justice, that provides free legal information and advice in response to a variety of questions people have about their reproductive lives, including self-managed abortion, and is available to anyone who fears they may be criminalized or anyone who has been criminalized for self-managing their abortion. The other ad directs people to a guide, created by the research-based campaign Plan C, that provides state-by-state information about how people can access abortion pills by mail, both through mainstream telehealth services in more than 20 states and through online services in all 50 states. Both ads are designed to be shared on social media and seen by New Yorkers and out-of-state visitors alike; even in states with fewer restrictions on abortion access, people may be interested in self-managed abortions and may be seeking information about options and resources. </p><p id=\"\">“As politicians and courts continue their assault on abortion access, we are spreading the word that these medically safe and effective pills are available by mail in all 50 states,” said Elisa Wells, Plan C Co-Founder and Co-Director. “Everyone deserves access to this modern medical technology, and we provide the information that people need to take back control of their reproductive autonomy.” </p><p id=\"\">Plan C invited If/When/How to share the ad space to highlight the organization’s Repro Legal Helpline, which provides legal information and advice to help people understand their rights and potential legal risks when self-managing an abortion.</p><p id=\"\">“We don’t want people to be alone or confused about their legal rights or possible legal risk if they are thinking about self-managing their abortion,” said Rebecca Wang, J.D., Legal Support Counsel at If/When/How. “Criminalization of pregnancy outcomes thrives when abortion is restricted, stigmatized, and isolated, and the helpline is a resource to provide people with the support and legal information they need to make fully informed decisions about what is best for them and their families.”</p><p id=\"\"><em>About Self-Managed Abortion</em></p><p id=\"\">Anyone who decides to end a pregnancy should be able to choose to self-manage an abortion at home or somewhere they feel safe — with the control in their hands, surrounded by people they love, and with the kind of support they want. </p><p id=\"\"><em>Medically Safe and Effective Medication Abortion</em></p><p id=\"\">Today, there are medically safe and effective options for ending a pregnancy, including FDA-approved medication abortion pills. Access to this medication, accurate information, and back-up care in the rare cases it's needed mean that people can self-manage abortions at home or in another safe place of a person’s choosing, with as little or much clinician support as desired. &nbsp;</p><p id=\"\"><strong>The Plan C Guide to Pills</strong> helps people learn about all the abortion access options available in their state, including getting medication abortion by mail through new telehealth services and online suppliers such as Aid Access and online pharmacies. Plan C’s FAQ and Resource sections provide links to instructions, medical support, and legal information. Traffic to this research-driven directory of services and information has risen by nearly 400 percent in the past six months, demonstrating the growing demand for information about where to find abortion pills by mail. Learn more at <a href=\"http://www.plancpills.org\" id=\"\">www.plancpills.org</a>.</p><p id=\"\"><em>Legal Risks &amp; Resources</em> </p><p id=\"\">While self-managed abortion has existed as long as pregnancy itself, with the advent of new medical technologies, it is medically safer and more accessible than ever before. However, the threat of arrest may turn what would otherwise be a dignified abortion experience into a traumatizing or demoralizing one, particularly for those who live under heightened government surveillance and are more frequently harmed by state violence, including BIPOC people and people living in poverty. No one should be criminalized for self-managing their own abortion or helping someone else do so. The American Medical Association, American College of Obstetricians and Gynecologists, American Bar Association, and National Lawyers Guild all oppose the criminalization of self-managed abortion.</p><p id=\"\"><strong>The Repro Legal Helpline, part of If/When/How: Lawyering for Reproductive Justice</strong>, <a href=\"http://www.reprolegalhelpline.org/\" target=\"_blank\">provides free, legal information for anyone with questions about the legal risks of self-managed abortion</a>. The organization also provides direct representation for people who have been criminalized, and maintains a Repro Legal Defense Fund to support people who are investigated, arrested, or prosecuted for self-managing abortions. More information about the free and confidential helpline and fund are available at <a href=\"http://www.reprolegalhelpline.org/\" target=\"_blank\">reprolegalhotline.org</a> and <a href=\"https://reprolegaldefensefund.org/\" target=\"_blank\">reprolegaldefensefund.org</a>.</p><p id=\"\">Plan C (plancpills.org) is a reproductive health campaign for universal abortion pill access in the US. Plan C’s website and Guide to Pills includes information on medically safe self-managed abortion, medical and legal hotlines, and a research-driven directory of abortion pills by mail: where they’re found online, with or without telehealth support, in all 50 states. Plan C works closely with partners in reproductive justice, healthcare, and tech to catalyze new initiatives that disrupt old barriers to access. </p><p id=\"\">To learn more visit <a href=\"http://www.plancpills.org\" id=\"\">www.plancpills.org</a>. For updates, follow us on Facebook, Twitter, TikTok and Instagram. </p><p id=\"\">If/When/How: Lawyering for Reproductive Justice transforms the law and policy landscape so that all people have the power to determine if, when, and how to define, create, and sustain families with dignity and to actualize sexual and reproductive wellbeing on their own terms. We envision a transformation of the legal systems and institutions that perpetuate oppression into structures that realize justice, and a future when all people can self-determine their reproductive lives free from discrimination, coercion, or violence. </p><p id=\"\">To learn more about If/When/How, visit <a href=\"http://www.ifwhenhow.org\" id=\"\">www.ifwhenhow.org</a>.</p>",
    "Date": "Fri Apr 08 2022 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Mystery Shopper\" Report Card now live",
    "Slug": "mystery-shopper-report-card-now-live",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c27b52f089cc15635c8_5fa1c3daab40aa62a1cb7918_ScreenShot2019-12-04at7.13.46PM.png",
    "Content": "<p id=\"\"><strong>This is a historical record of the original Plan C report card. For current abortion pill provider data, please see the</strong><a href=\"/\" id=\"\"><strong> Plan C Guide</strong></a><strong>.</strong></p><p>‍</p><p id=\"\"><strong>Photos of Abortion Pills Obtained Online</strong></p><p id=\"\">All of the pills pictured here contained real active ingredients as determined by chemical assay. Two brands (Pregout and Pregnot) contained considerably less misoprostol than indicated on the label, which may make them less effective.</p><p id=\"\"><strong id=\"\">MIFEGEST KIT </strong>Manufactured by Zydus Healthcare (Fortiza)Contains: 1 mifepristone tablet (200 mg), 4 misoprostol tablets (200 mcg)Quality: Acceptable &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p><p id=\"\"><strong id=\"\">PREGOUT KIT </strong>Manufactured by Akums Drug and PharmaceuticalsContains: 1 mifepristone tablet (200 mg), 4 misoprostol tablets (200 mcg)Quality: the mifepristone pills contained acceptable levels of active ingredient; the misoprostol pills contained low levels of active ingredient.Note: each blister bubble on the package was pricked with a pin, which could account for the low level of misoprostol content (it degrades when exposed to air) &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p><p id=\"\"><strong id=\"\">PREGNOT KIT </strong>Manufactured by Akums Drug and PharmaceuticalsContains: 1 mifepristone tablet (200 mg), 4 misoprostol tablets (200 mcg)Quality: the mifepristone pills contained acceptable levels of active ingredient; the misoprostol pills contained low levels of active ingredient.Note: each blister bubble on the package was pricked with a pin, which could account for the low level of misoprostol content (it degrades when exposed to air)<em id=\"\">Compiled by Plan C , November 27, 2017</em> </p>",
    "Date": "Mon Nov 13 2017 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "NWHN x Plan C SCOTUS Survival Guide",
    "Slug": "nwhn-x-plan-c-scotus-survival-guide",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c25197bccef4eeb5540_6545911b9d318a433923328e_Screenshot%25202023-11-03%2520at%25205.32.23%2520PM.png",
    "Content": "<p id=\"\"><a href=\"https://nwhn.org/wp-content/uploads/2023/12/Fifth-Circuit-_-SCOTUS-Survival-Guide-Revised-12.13.23.pdf\" target=\"_blank\"><strong id=\"\">Plan C x NWHN: SCOTUS Survival Guide (Oct 2023)&nbsp;</strong></a></p><p id=\"\">Download this briefing on the SCOTUS&nbsp;Mifepristone case, and what we all need to know as the courts debate access to this essential medicine. TL;DR: it's unjust, unscientific and out of step with reality -- but if the case rules against Mifepristone, there will still be routes of access from overseas via community networks. </p>",
    "Date": "Fri Nov 03 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "OP-ED: How I Tested the New (to the U.S.) World of Abortion by Mail",
    "Slug": "op-ed-how-i-tested-the-new-to-the-u-s-world-of-abortion-by-mail",
    "Author": "Kayla King",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c259f6d3c6f7eae48d1_5fa1be9cd9ab8c5a9aa8d4ac_Anchorage%2520Press-%2520Plan%2520C-%2520A%2520vital%2520resource%2520for%2520women%2520in%2520Dunleavy%2527s%2520Alaska.png",
    "Content": "<p id=\"\"><em id=\"\">Kayla King is a student, abortion rights activist, barista, and native Texan currently residing in central California. </em></p><p id=\"\">It can be scary to be a sexually active young woman in Texas these days-- all of the restrictions on access to birth control and abortion can make securing trustworthy reproductive healthcare challenging. I went through my teenage years in Texas hoarding condoms and using as many forms of birth control at one time as safely possible (the pill, condoms, emergency contraception, a diaphragm even). I have been incredibly lucky to avoid pregnancy thus far, but my luck seems to be inversely proportional to my age. In our volatile political climate, I, like many others, worry about the future of abortion rights, especially in a state like Texas, where restrictions on access are politically motivated, often under the guise of \"protecting women's' health\". Texas is politically notorious for restricting access to women’s healthcare. In the last year, Texas has been in <a href=\"http://www.texastribune.org/2017/11/02/brief-nov-2/\" id=\"\">federal court three times</a> with lawsuits regarding various unconstitutional anti-choice laws, including a fetal burial and cremation rule, attempting to kick Planned Parenthood off state Medicaid funding, and <a href=\"https://rewire.news/legislative-tracker/law/texas-omnibus-abortion-bill-sb-8/\" id=\"\">SB 8</a>, a omnibus anti-choice bill introduced shortly after Trump’s inauguration. &nbsp;Many other states continue to pass similar unconstitutional laws restricting access to clinical abortion in the era of this anti-choice administration.</p><p id=\"\">Medication abortion has been legal in the United States since 2000, when the FDA first approved Mifeprex in combination with Misoprostol to induce abortion in a clinical setting. 24 years after the landmark case of Roe, the only method of legal abortion in the United States until this point was surgical. Since then, the popularity of abortion with pills has grown. Nearly half of people seeking to end a pregnancy within 10 weeks opt to have a medication abortion. When the FDA finally approved medication abortion, many of the restrictions on surgical abortion were also applied to abortion with pills. Medication abortion could be used to greatly expand abortion access, as more medical professionals could provide it than those able to provide surgical abortion, and many <a href=\"http://www.scienceinpublic.au/publichealthcongress/tabbot-foundation_release\" id=\"\">women are comfortable and feel safe</a> taking it outside of a clinic. However, much of the same politically minded restrictions on surgical abortion were blanketed across medication abortion. Although the context of medication abortion is vastly different than a surgical abortion, restrictions that apply to surgical abortion were used to limit the transformative potential that medication abortion could have on our reproductive healthcare landscape. The ease, effectiveness, and safety of medication abortion has the potential to radically transform the way we view early abortion, given that it were more accessible. Regulators and legislators were unable or unwilling to expand the accessibility of early abortion. &nbsp;So for example, a person seeking an early abortion in Texas will have to contend with a plethora of politically motivated (not evidence based or health minded) restrictions that can cost the individual hundreds of dollars in transportation, housing, and additional unnecessary appointments in which a doctor must follow a state-mandated script of falsehoods about the health risks of abortion. Under these regulations, many who seek medication abortion are also subject to invasive and unnecessary medical procedures (transvaginal ultrasound, anyone?). All of this hassle to take one pill under doctor supervision, and a few more at home. One facing these obstacles can’t help but wonder if there can be a safe and effective way to end an early pregnancy without these interferences of the state.</p><p id=\"\">Just in case I should ever need it, I began looking at ways to access abortion pills outside of the traditional medical system. An Internet search quickly identified three international non-profits that offer medication abortion services-- <a href=\"http://www.womenonweb.org\" id=\"\">Women on Web</a>, <a href=\"http://www.safe2choose.org\" id=\"\">Safe2Choose</a>, and <a href=\"http://www.womenhelp.org\" id=\"\">Women Help Women</a>. Women on Web and more recently Safe2Choose and Women Help Women have been delivering medication abortion &nbsp;for over 10 years to women living in countries where abortion is illegal. Literally, delivering abortion care! In more than one hundred countries around the globe, a person can go online to these sites, calculate their gestational age based on the date of their last regular menstrual period and order a combination of Mifepristone and Misoprostol, to be delivered to their door for use in the privacy of their own home. When taken within 10 weeks of a missed period, the pills are about 95-98% effective at ending a pregnancy. A recent<a href=\"http://www.thejournal.ie/abortion-pills-study-ireland-3392557-May2017/\" id=\"\"> study </a>involving women in Ireland who had used this service found that it was comparable in safety and effectiveness to clinical care and that the women appreciated the convenience of this home-based care. But this convenient, safe, private, and more affordable option is not available to people in the United States. For several reasons, including the complexity of the legal status of abortion by state and the messy politics involved, these websites do not currently ship to the United States. Although &nbsp;abortion is technically legal in the U.S.,, that does not mean it is accessible to many people.</p><p id=\"\">While searching Google for organizations like Women Help Women and Safe2Choose, I stumbled across PlanCPills.org. Plan C is a U.S. based initiative raising awareness of the option of a safe, effective, and affordable abortion in one’s own home. <a href=\"https://plancpills.org/\" id=\"\">Plan C </a>is spreading the word about how &nbsp;people right here in the United States are leveraging the World Wide Web to access medication abortion in their own homes. Immediately, I emailed Plan C and asked about how I could join in their mission to expand access to this transformative technology.</p><p id=\"\">Plan C recently published a study with Gynuity Health Projects in the international journal Contraception about the feasibility of ordering Mifepristone and Misoprostol online for delivery to U.S. addresses. Check out the <a href=\"http://www.contraceptionjournal.org/article/S0010-7824(17)30475-4/fulltext\" id=\"\">full article</a>, or this <a href=\"https://static1.squarespace.com/static/55411f70e4b033b0c2b7dc0d/t/5a21cc7d71c10b8bdcea9b69/1512164477436/PlanCReportCard11.28.17.pdf\" id=\"\">\"report card\" </a>about the sites tested, but here’s a quick recap— 20 out of 22 orders places were received, most within less than two weeks. Shockingly, 15/20 packages shipped actually shipped from within the U.S. The median cost for a full dosage of both Mifepristone and Misoprostol was $200 (The average cost of an in-clinic abortion is $500 using the same pills). Pills from each shipment underwent a chemical assay and were found to contain the labeled active ingredients to induce abortion, though the amount of ingredient was lower than expected in some brands of pills.</p><p id=\"\">Seeing the success of the Plan C researchers, I decided to try it for myself. At this point, I had formally joined the Plan C team as an intern. Although they had already finished the formal research phase, I wanted to know what it would be like to order pills on my own. My main interest in this project was the interaction of user and seller, how one exactly could go about finding and ordering these pills online. I decided to use buygenericmed.com, which a colleague at Plan C recommended I try. &nbsp;I went to my favorite café, and after logging onto their Wi-Fi and getting a seven-day free trial of a VPN (Virtual Private Network, to obfuscate my web traffic and protect my identity), and entered the website into my browser. The front page of the site listed birth control options. I clicked into this page and found a package of both Mifepristone and Misoprostol front and center. For $115, I could get a \"MTP kit “ or “medical termination of pregnancy” kit, containing both drugs shipped to my door. For only $80, I could buy misoprostol alone. Misoprostol is less effective in inducing abortion when used alone-- ending about 85% of pregnancies, but the World Health Organization recommends it when mifepristone is unavailable. I chose to spring the extra $35 and selected the combination pack.&nbsp;</p><p id=\"\">I placed my order, entering only my name and shipping address. Immediately I received an confirmation email &nbsp;letting me know that my order had been received. The next week, I completed a payment request from the seller on PayPal International for $115. The PayPal feature felt more secure than other payment methods I had heard of. According to the Plan C study, some sellers asked for a money transfer requiring bank account info, a money order, or a credit card number on their site. &nbsp;As time passed, I was beginning to get nervous. Had I thrown $115 away? Was I really going to get these pills? Had I fallen for a scam designed to trap desperate people in their time of need? My anxious questions piled up with the junk in my mailbox, conspicuously lacking the package I was looking for. Glad I wasn’t pregnant and in need of the pills before the 10-week window closes, I dutifully checked my mailbox every day, anxiously waiting and badgering my mailman. Four weeks after placing my order, I got an email confirming that the package had cleared customs, and would soon be in my mailbox. The U.S. inspects less than 2% of packages coming across its borders, so the chances of it getting through customs were high, but it was &nbsp;comforting to get confirmation.</p><p id=\"\">One week later , an unassuming brown envelope presented itself in my mailbox. Shipped from New Delhi, taped on to it were customs forms and across the opening, strips of fluorescent green tape, a reassurance from U.S. Customs and Border Patrol. Upon opening this envelop, nestled amongst bubble wrap was a small manila envelope with a foil blister pack containing one Mifepristone and four Misoprostol pills, labeled as containing quantities of the active ingredient to induce abortion. Although the shipping time for this website was much longer than the average for the study, I was in no hurry for this experiment. &nbsp;This was quite a thrill! It had actually worked. I was in awe of this new reality; I had ordered abortion pills online and had them delivered to my door. And although my pills took a bit longer to ship, the top ranked site on Plan C’s <a href=\"https://static1.squarespace.com/static/55411f70e4b033b0c2b7dc0d/t/5a21cc7d71c10b8bdcea9b69/1512164477436/PlanCReportCard11.28.17.pdf\" id=\"\">“report card”</a> shipped the pills in 4 days for only $80. I suddenly had a greater understanding of Plan C’s tagline, “convenience, confidentiality, control”. More than a great alliteration, Plan C’s mission has the potential to change the way early abortion is understood and exercised in the U.S.</p><p id=\"\">Although the process of ordering pills online was relatively simple for me, I know from reading the news that not everyone who orders pills online is so fortunate and privileged. At least 18 people have been prosecuted for ordering or taking abortion pills on their own. According a recent report from the <a href=\"https://www.sialegalteam.org/\" id=\"\">Self Induced Abortion (SIA) Legal Team</a>, prosecutors abuse a patchwork of outdated and ambiguous laws to punish women who end their own pregnancies. These prosecutors have denigrated fetal harm laws, originally designed to protect pregnant people, as well as misapplied criminal abortion laws, many left over from the era before Roe. Seven states-- Arizona, Delaware, Idaho, Nevada, New York, Oklahoma, and South Carolina-- have laws against self-induced abortion. The SIA Legal Team recommends that these states repeal these laws, as they do not prevent people from seeking to end their own pregnancies, and only serve to create distrust of the medical system and invites law enforcement into healthcare settings, creating circumstances that may prevent people from seeking care when they need it. &nbsp;When I set out to order my pills, I was aware of these issues yet relatively unconcerned because I ordered the pills as an experiment and with the intent to have them just in case; I did not need them to end an existing pregnancy. I also happen to live in California right now, where I am not as fearful of legal backlash and know that the SIA Legal Team is available for people who might need legal assistance.</p><p id=\"\">&nbsp;</p><p id=\"\">Although these legal obstacles deserve careful consideration, the future that Plan C imagines is a revolution in reproductive health technology. In time, early abortion in the United States could be a simple as picking up pills at the grocery store, or ordering them on Amazon. Women are eager to embrace new reproductive health technologies, and women around the globe have long accepted the concept of mail order abortion. Plan C offers us an image of a country that allows women to be trusted with their own reproductive health decisions.</p><p id=\"\">The pills have been sitting on my bathroom shelf for the last month, nestled between vitamins and ibuprofen. &nbsp;This is a great spot for them. They are there just in case I should ever need them. Having these pills at my disposal is an act of power, reclaiming my rights, refusing to let my health and my life be left to the whims of whatever politicians are in office today or tomorrow. A friend of mine heard this story and ordered some pills of her own, and they now sit &nbsp;on her bathroom shelf, just in case. Plan C’s work and research opens up a possibility of radical self health care that has previously been unavailable to Americans. The research about Women on Web's international service has corroborated that for most people, this alternative option is safe, effective, and even preferred. The feeling of reclaimed autonomy over my body, a feeling I had never fully felt under the oppressive Texas political climate, is here to stay. People deserve access to this technology, to have full control over their own bodies and destinies. We don’t have to be at the mercy of whoever is in office, the mercy of our credit card limit, the mercy of our insurance companies policies on abortion coverage, the mercy of our parents thoughts on abortion, the mercy of the distance from our homes to a clinic. We can take back our power, our bodies, and our rights. &nbsp;The fact that women all over the world have this access, and that it has been restricted and even concealed from us here in the U.S. is a shame. It is time for us to trust ourselves, to trust women, and to embrace this technology.<br></p>",
    "Date": "Tue Aug 21 2018 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "OP-ED: Telemedicine pioneer AidAccess.org is under attack by the FDA",
    "Slug": "op-ed-telemedicine-pioneer-aidaccess-org-is-under-attack-by-the-fda-nbsp-nbsp",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c2594df73c9e7c641b2_5fa1c136df389b20a6b866fb_unnamed0.jpeg",
    "Content": "<p id=\"\"><em id=\"\">What you need to know: </em></p><p id=\"\">On March 8th - International Women's Day - the FDA sent a letter warning online abortion pill provider&nbsp;<a href=\"http://aidaccess.org/\" target=\"_blank\" id=\"\">AidAccess.org</a>&nbsp;to cease distributing mifepristone and misoprostol, the two drugs that make up the most effective medication abortion regimen. Aid Access launched last year from the Netherlands to serve pregnant people without access to clinic-based abortion care&nbsp;or prefer to self-manage their abortions at home.</p><p id=\"\">Since its approval in 2000, the FDA has subjected mifepristone to politically motivated, medically unnecessary restrictions guaranteed to limit access. Despite a better safety track record than some over-the-counter drugs, the FDA prevents the sale of mifepristone at pharmacies, making it inaccessible and too expensive for many Americans who can’t afford to travel to a registered clinic to get the abortion pill.</p><p id=\"\"><strong id=\"\">The crackdown is further evidence that the FDA's priority is to make medication abortion harder to access, not to support women.</strong>&nbsp;Aid Access provides a vital service to those wanting to safely and effectively self-manage their abortions. If the FDA is truly worried about the safety of imported abortion pills, it's time to lift the restrictions on mifepristone&nbsp;and allow&nbsp;this safe and effective #21stCenturyAbortion technology to be distributed through pharmacies, like most other medications.&nbsp;<br><br>We believe medication abortion&nbsp;is one option of many that people ought to be able to choose for themselves. Reproductive health care needs are as unique as the people who have them, and we must trust that people will make the best decisions for themselves and their families.<br><br><em id=\"\">Read articles about the FDA's letter here:&nbsp;</em><br><br><strong id=\"\">CNN.com:&nbsp;</strong><a href=\"https://www.cnn.com/2019/03/15/health/fda-aid-access-abortion-pill-warning/index.html\" target=\"_blank\" id=\"\">Online abortion pill provider ordered to cease delivery by FDA,</a>3/15/2019<br><br><strong id=\"\">Bustle.com:&nbsp;</strong><a href=\"https://www.bustle.com/p/the-fda-orders-aid-access-to-stop-providing-abortion-pills-by-mail-in-the-us-16961805\" target=\"_blank\" id=\"\">The FDA orders Aid Access to stop providing abortion pills by mail in the US</a>, 3/16/2019</p><p id=\"\"></p>",
    "Date": "Sun Mar 31 2019 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C Billboards are Live",
    "Slug": "plan-c-billboards-are-live",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/66425376f454bbb114f0cf2b_266.26254.DaytimeApproach.202404221414134381213.jpg",
    "Content": "<p id=\"\"><strong id=\"\">From now through the summer, catch our billboards in:</strong></p><p id=\"\">📍 Rio Grande Valley, TX (Near McAllen and Port Isabel)<br>📍 Knoxville, TN<br>📍 Jackson, MS<br>📍 Near Norman, OK</p><p id=\"\">We began by speaking to local partners in five restricted states to understand if billboards were wanted and needed (they were), to learn where potential abortion seekers were being under-served with information on their options, where billboards might make a big impact, whether any media companies would run our PSA billboards (they would).&nbsp;</p><p id=\"\">The public health PSA billboards are up for 3 months. We are raising funds to extend the length of the campaign and expand it to other areas. If you want to raise or donate funds, or have an idea for a future location, <a href=\"http://plancpills.org/contact\" id=\"\">contact us. </a></p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Want to drive by a billboard? Here are the coordinates:&nbsp;</strong></p><p id=\"\">Rio Grande Valley, TX(Near McAllen): <a href=\"https://maps.app.goo.gl/x1rSmzc9zYx9A5S38\" id=\"\">26.25263714,-98.17254897</a></p><p id=\"\">Rio Grande Valley, TX (Near Port Isabel:) <a href=\"https://maps.app.goo.gl/CYmj9AVV84yWyrr8A\" id=\"\">26.08111,-97.25715</a></p><p id=\"\">Knoxville, TN: <a href=\"https://maps.app.goo.gl/ehkPHfroFFtUscJn8\" id=\"\">35.97031,-83.91529</a></p><p id=\"\">Jackson, MS: <a href=\"https://maps.app.goo.gl/WkM6k35rby7xXHit9\" id=\"\">32.26325,-90.20892</a></p><p id=\"\">Near Norman, OK: <a href=\"https://maps.app.goo.gl/trBf8zeGhGzgZPLG9\">35.141403,-97.465251</a></p><p>‍</p><p id=\"\"><strong id=\"\">To share the billboards online and help them make a national impact:&nbsp;</strong></p><p id=\"\">Repost <a href=\"https://www.instagram.com/p/C6M2TAihQdN/?img_index=1\" id=\"\">from Instagram here,</a> or<a href=\"https://drive.google.com/drive/folders/1hMtMNsMttel5os7nvv_Er703oOy6zYo4?usp=drive_link\"><br>Download photos</a> and post&nbsp;them on your own channels.</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Want to share your experience of visiting the billboards, or share your own photos of a billboard?</strong> <br>‍<a href=\"https://www.jotform.com/form/241244455025146\" id=\"\">Fill out the secure form here</a> and let our Community Leads know.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" style=\"max-width:1500px\" data-rt-type=\"image\" data-rt-align=\"center\" data-rt-max-width=\"1500px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6642550cc7484d461f16e7a0_billboards-2up-blog.png\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure>",
    "Date": "Fri Mar 01 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "‍Plan C on Florida Supreme Court Decision Triggering Six-Week Abortion Ban",
    "Slug": "plan-c-on-florida-supreme-court-decision-triggering-six-week-abortion-ban",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/660b8869d23530fe1c1c88b0_fl-courthouse.jpeg",
    "Content": "<p id=\"\">‍<strong id=\"\">Plan C on Florida Supreme Court Decision Triggering Six-Week Abortion Ban&nbsp;(Which Will Take Effect in 30 Days)</strong><br></p><p id=\"\"><em>April 1, 2024 -</em> Today, the Florida Supreme Court ruled that one of the nation’s strictest abortion bans can go into effect in 30 days. The 6-week ban, signed in 2023 by Governor Ron DeSantis, is not based on the clinical judgment of medical professionals, and is unjust. Everyone deserves access to basic medical care, including abortions.</p><p id=\"\"><em id=\"\">“It is not an accident that politicians and the courts continue to pass legislation and issue rulings that are misleading and confusing, in addition to being contrary to medical science and basic human rights. In the face of this unjust ruling, we want people to have easy access to factual and supportive information about abortion access, including information about how to access pills by mail in Florida from licensed clinicians in other states.&nbsp;</em></p><p id=\"\"><em id=\"\">-</em>Elisa Wells, Plan C co-founder and co-director</p><p id=\"\"><strong id=\"\">It is critically important for Florida residents to know that abortion up to 15-weeks is still available for the next 30 days.&nbsp;Right now, and even after the ban takes effect, people in FL have options to access abortion pills by mail. Here’s how:&nbsp;</strong></p><p id=\"\">1. Access to abortion pills by mail through telehealth providers using shield laws.</p><p id=\"\">Since June of 2023, abortion pills and telehealth abortion services have been available from US-based providers, even in states like Florida with abortion bans, due to new shield laws in some progressive states. These laws are designed to protect clinicians who practice telemedicine abortion and mail pills into restricted states, shielding them from extradition or loss of their medical license. These providers are operating in full compliance with the laws in their state that pertain to them, and are adhering to standard medical protocols for abortion service delivery. Lawyers say there is no increased legal risk to the end user or patient by using these services.&nbsp;</p><p id=\"\">2. Access to abortion pills by mail through online vendors and community support networks.</p><p id=\"\">This includes a robust alternate supply network of abortion pills from international telehealth providers that mail pills, online vendors who ship generic abortion pills for as little as $35 with 3-5 day shipping, as well as community networks who mail free generic abortion pills to people in restricted states who can’t afford other options.&nbsp;</p><p id=\"\">3. You can also access abortion pills in advance just in case.</p><p id=\"\">You do not have to currently be pregnant to order abortion pills in advance. Many people are stocking up on pills in anticipation of future unjust court rulings and bans.&nbsp;</p><p id=\"\">Our website—<a href=\"http://www.plancpills.org\" id=\"\">plancpills.org</a>—lists all of these routes of access, which we have tested for reliability. Our site also includes FAQs about using pills for self-directed care, free and confidential hotlines for support, and other resources, so no one has to go it alone.&nbsp;&nbsp;&nbsp;</p><p id=\"\">These organizations and resources for support are available now and when the six-week ban takes effect.</p><ul id=\"\"><li id=\"\">To find providers who mail pills to all states and territories, including Florida, visit <a href=\"http://plancpills.org\" id=\"\">plancpills.org</a> or <a href=\"http://ineedana.com\" id=\"\">ineedana.com</a>.&nbsp;</li><li id=\"\">To access medical support: the <a href=\"http://mahotline.org\" id=\"\">M+A Hotline</a></li><li id=\"\">To access peer support: <a href=\"http://reprocare.com\" id=\"\">Reprocare.com</a>&nbsp;</li><li id=\"\">To access free, confidential legal services: <a href=\"https://ifwhenhow.cmail19.com/t/d-l-vkiuhik-jkehtjrjt-d/\" id=\"\">Repro Legal Helpline</a>&nbsp;&nbsp;</li><li id=\"\">For help finding the money for an abortion, people can ask the telehealth provider for a partial or full discount or <a href=\"https://abortionfunds.org/find-a-fund/\" id=\"\">reach out to a local abortion fund.</a></li></ul><p id=\"\">‍</p><p id=\"\"><strong id=\"\">About Plan C:</strong></p><p id=\"\">Plan C is a public health information campaign and a catalyst for direct access to abortion pills by mail in the US. Since 2015, Plan C has led the way in normalizing self-directed abortion care: actively increasing awareness of this safe and effective method and how people are directly accessing the medication and support services, from any state. Plan C’s comprehensive <a href=\"http://plancpills.org/guide\" id=\"\">Guide to Pills</a> indexes sources of pills through both mainstream and alternate routes, as well as FAQs and free and confidential support hotlines, all in support of safe self-directed options despite bans to care. As a creative campaign, Plan C works with creators, brands and media and builds cross-sector partnerships to make the method more known and available, especially with audiences facing the biggest barriers to care. Plan C operates under a vision of pills in hands: disentangling the method from politics and moving agency over abortion back to the individual. To learn more, visit <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/MWGWfQ1XWTQW3gZSwd5f63xMW8Ny6Rt5706ZXN20xtvg3qn9gW69sMD-6lZ3p1W2hqVJ594cqTGW4vGlv46WvQr2W67FgTx7sB54VW3rQ-mD29nkrmW138wTL3TN_yfW3ZNBhR4sh9cXN5kc7ynQS6nbW7hd-v31vxWxmVmcNgg42QS10W4wKWGP5zbVzXV7hQDP2HcVnlN37M4GqFhQwdW2_NL8j864p5bW8qZzl93pRpYQTCmXl2Gf7n_W8Rqf6D4nHVB7VbfBQN3hCL28W76PtlK5GXpFpW3L4nPK1FyzdQW26-_yV5Y1T2rf3dsVpq04\" id=\"\">plancpills.org </a>or find Plan C @plancpills on Instagram, Facebook, Twitter, and TikTok.&nbsp;</p><p id=\"\">Abortion is basic health care and a human right. Everyone deserves full, legal access to mifepristone through clinics, telehealth, and self-managed sources in every zip code in the US.&nbsp;</p><p id=\"\">Plan C will continue to <a href=\"http://plancpills.org/guide\" id=\"\">provide research-based information</a> about where to obtain medication abortion, both mifepristone and misoprostol, throughout this fight.&nbsp;</p>",
    "Date": "Thu Apr 13 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C on SCOTUS decision to hear abortion pill access case 12.13.23",
    "Slug": "plan-c-on-scotus-decision-to-hear-abortion-pill-access-case-12-13-23",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c265aade6faedb2e869_654590e33975ada32cec779a_adam-michael-szuscik-zu-eJEhMFEU-unsplash.jpeg",
    "Content": "<p id=\"\">December 13, 2023 -<strong id=\"\"> </strong>The SCOTUS decision to hear the consolidated cases <em id=\"\">FDA vs Alliance for Hippocratic Medicine </em>as well as <em id=\"\">Danco Laboratories, L.L.C. vs Alliance for Hippocratic Medicine</em> means that access to mifepristone is maintained for the near term, but leaves the final outcome of the case uncertain.&nbsp;</p><p id=\"\">We hope that the eventual SCOTUS decision will affirm that decisions about access to abortion medications should be based on the FDA's rigorous evaluation of scientific data about their safety and effectiveness as well as the clinical judgement of medical professionals, not on baseless political claims. However, the current makeup of the court—and its failure in the <em id=\"\">Dobbs</em> case to uphold abortion rights—does not bode well for a good outcome.&nbsp;</p><p id=\"\">As SCOTUS considers the case, mifepristone will remain available in the United States. This includes the availability of abortion pills by mail, even in states with abortion bans.&nbsp;</p><p id=\"\">Since June, abortion pills and telehealth abortion services have been available from US-based providers, even in states with abortion bans, due to new shield laws in some progressive states. These laws are designed to protect clinicians who practice telemedicine abortion and mail pills into restricted states, shielding them from extradition or loss of their medical license. These providers are operating in full compliance with the laws in their state that pertain to them, and are adhering to standard medical protocols for abortion service delivery. Lawyers say there is no increased legal risk to the end user or patient by using these services.&nbsp;</p><p id=\"\">Even if the SCOTUS decision results in restrictions on mifepristone, mifepristone and misoprostol pills will remain available by mail through alternate delivery systems that serve all US&nbsp;states and territories. This includes a robust alternate supply network of abortion pills from both online vendors who ship generic abortion pills for as little as $42 with 3-day shipping, as well as volunteer groups who mail free generic abortion pills to people in restricted states who can’t afford other options.&nbsp;</p><p id=\"\">Given the uncertainty around the outcome of this case, we also know that many people are stocking up on mifepristone + misoprostol in case they need them later. For example, at least one pharmacy in India offers a telehealth service that includes a basic medical screening, abortion pills, anti-nausea medication, and ibuprofen for $25, with 3-4 week shipping.</p><p id=\"\">Our website—<a href=\"https://www.plancpills.org\" id=\"\">plancpills.org</a>—lists all of these routes of access, including the ecommerce sites which we continue to test for reliability. Our site also includes FAQs about using pills for self-directed care, referrals to free and confidential hotlines for support, and other person-centered resources, so no one has to go it alone.&nbsp;&nbsp;&nbsp;</p><p id=\"\"><em id=\"\">“We want people to know that abortion pills are everywhere. Laws and court rulings will not stop us from accessing safe abortion. Instead, restrictions of any kind will just strengthen our resolve to demonstrate new models of access that put abortion pills, and the agency to have an abortion, directly in the hands of the person who needs it.”&nbsp;</em></p><ul id=\"\"><li id=\"\"><strong id=\"\"><em id=\"\">Elisa Wells, Plan C co-founder and co-director</em></strong></li></ul><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Your journalism can help: by letting people know there are still organizations and resources for support.&nbsp;</strong></p><ul id=\"\"><li id=\"\">To find providers who mail pills to all states visit <a href=\"http://plancpills.org/\" id=\"\">plancpills.org</a> or <a href=\"http://ineedana.com/\" id=\"\">ineedana.com</a>.&nbsp;</li><li id=\"\">To access medical support: the <a href=\"http://mahotline.org/\" id=\"\">M+A Hotline</a></li><li id=\"\">To access peer support: <a href=\"http://reprocare.com/\" id=\"\">Reprocare.com</a>&nbsp;</li><li id=\"\">To access free, confidential legal services: <a href=\"https://ifwhenhow.cmail19.com/t/d-l-vkiuhik-jkehtjrjt-d/\" id=\"\">Repro Legal Helpline</a>&nbsp;</li><li id=\"\">For help finding the money for an abortion, people can ask the telehealth provider or <a href=\"https://abortionfunds.org/find-a-fund/\" id=\"\">reach out to a local abortion fund.</a></li></ul><p id=\"\">‍</p><p id=\"\"><strong id=\"\">About Plan C:</strong></p><p id=\"\">Plan C is a public health information campaign and a catalyst for direct access to abortion pills by mail in the US. Since 2015, Plan C has led the way in normalizing self-directed abortion care: actively increasing awareness of this safe and effective method and how people are directly accessing the medication and support services, from any state. Plan C’s comprehensive <a href=\"https://plancpills.org/guide\" id=\"\">Guide to Pills</a> indexes sources of pills through both mainstream and alternate routes, as well as FAQs and free and confidential support hotlines, all in support of safe self-directed options despite bans to care. As a creative campaign, Plan C works with creators, brands and media and builds cross-sector partnerships to make the method more known and available, especially with audiences facing the biggest barriers to care. Plan C operates under a vision of pills in hands: disentangling the method from politics and moving agency over abortion back to the individual. To learn more, visit <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/MWGWfQ1XWTQW3gZSwd5f63xMW8Ny6Rt5706ZXN20xtvg3qn9gW69sMD-6lZ3p1W2hqVJ594cqTGW4vGlv46WvQr2W67FgTx7sB54VW3rQ-mD29nkrmW138wTL3TN_yfW3ZNBhR4sh9cXN5kc7ynQS6nbW7hd-v31vxWxmVmcNgg42QS10W4wKWGP5zbVzXV7hQDP2HcVnlN37M4GqFhQwdW2_NL8j864p5bW8qZzl93pRpYQTCmXl2Gf7n_W8Rqf6D4nHVB7VbfBQN3hCL28W76PtlK5GXpFpW3L4nPK1FyzdQW26-_yV5Y1T2rf3dsVpq04\" id=\"\">plancpills.org </a>or find Plan C @plancpills on Instagram, Facebook, Twitter, and TikTok.&nbsp;</p><p id=\"\">Abortion is basic health care and a human right. Everyone deserves full, legal access to mifepristone through clinics, telehealth, and self-managed sources in every zip code in the US.&nbsp;</p><p id=\"\">Plan C will continue to <a href=\"https://plancpills.org/guide\" id=\"\">provide research-based information</a> about where to obtain medication abortion, both mifepristone and misoprostol, throughout this fight.&nbsp;</p><p id=\"\"><br></p><p id=\"\"><strong id=\"\"><em id=\"\">Previous Plan C statements on this matter: </em></strong></p><p id=\"\"><a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKMp3q90JV1-WJV7CgPvSW96CYbD1m1Y9JW5lWQF79j-wL6W4Pcxg22dn4qdW3GcR9c3SD_PwW4q223n7j2XJnN5LdqXGs_FJXW1Cmd9y25-z3QW2Sby7N5VSd-QVF4N-v8wldHVW59f_s75pKVj_W1JlR9f1SDbKMN6f3CyDQ0R_BW1ZqDJR4Bv2wWV2_9NZ4kv1dgW2j9QmQ5SF3FLW1TZv5X7zxZyJW7zYRLT97FJT6VJgK2X47fgvSN502G_d-K8W8W4qHlHj7gN0yRW4rPqY695ZSsVW8Mvcfw7KQTh3W2gmd4B2-D8KCW5t40Xp2x_V0sW6Z7Vt47XvRyVW5P84sZ9crt7VN6HwqWDFRcRKW4cv3GS2nKpVc3gsD1\" target=\"_blank\" id=\"\">4/8/23, on the original FDA rulings from Texas and Washington states</a>.</p><p id=\"\"><a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKMp3q90JV1-WJV7CgTzjW8S9Pj81ZN8G_V6PqN577CPpgVhVQsW6pcmN5W6ky7C536XbDpN5vZvj__hG-YVQDyDf5GQB7dW9dpGP0421qt_V_wmlD6tL2ZLN7JcvCCfvVVSN84xJtnWhlcZW1xYWW72C2-y1N1XjZsxMsPc2W1DNmkZ5gszZjW1z9FwB3XPm0PW5trZKX2yXR-yW5KmlyZ89HMWzW8ZlS_-5MyK1SW6vvfQS96_R_tW1slbZq1gVL29N8nHCs0GnRZKVg14k067BJRTTflC23F_-ZSW64ZMqG8lMlZ9N8fjghwTTt-CW5P9FZ91Rg3TRW4Kfxg04vmVgNW6Y14Lp5RgSdyW1f-WkG31kqGz3k_31\" target=\"_blank\" id=\"\">4/13/23, updated to comment on the 5th Circuit ruling</a>.</p>",
    "Date": "Wed Dec 13 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "The Abortion Road Trip to End All Road Trips",
    "Slug": "plan-c-road-trip-for-abortion-access-in-west-texas",
    "Author": "Plan C Team",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c27e54d41c8dad9dc2e_6131606c981072a7c1e6b658_PLan%2520C%2520Truck%2520back%2520-%2520Credit%2520Plan%2520C.jpeg",
    "Content": "<p id=\"\">When the announcement of SB8 spread in May 2021, it immediately had the “chilling effect” it was designed to accomplish. This six-week abortion ban or “heartbeat law” was vague enough to scare providers and clinics alike, and had a most unusual twist: not only did it target people who helped someone get an abortion (and not the pregnant person), its enforcement was put in the hands of private citizens, with a financial incentive for those who filed suits. The media called out the reality of creating “bounty hunters for abortion,” a $10k or higher reward incentivizing them to act and no clear penalty for frivolous suits. Besides introducing vigilante enforcement rarely seen in this country since the Wild West, this strategy made it near impossible for the ACLU or Planned Parenthood to serve a lawsuit before Sept 1st when it was slated to take effect. </p><p id=\"\">Despite the clear illegitimacy of the law, if it went into effect there was no clear way to protect small organizations against legal expenses. Clinics and abortion funds began to assess their risk in being sued as a “helper,” and next we heard the news of clinic after clinic planning to pause on abortions within the state. What the press didn’t cover, and continues to underreport, is the story that Plan C has shared all along: the very real opportunity to access abortion pills by mail, for a safe and private home abortion. <br></p><p id=\"\">In response to this developing situation of a statewide “abortion desert” on September 1st, Plan C took action: first, securing a mobile billboard truck that would traverse West Texas in the final days of August, and second by collaborating with a handful of Texas artists to creatively interpret online abortion pill access and abortion by mail in Texas, commissioning original artwork that would be easy to amplify and repost.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1274px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1274px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/613183b2264b19eb9a04c8ad_three-across.jpg\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div><figcaption id=\"\">1) <a href=\"http://instagram.com/thesweetfeminist\" target=\"_blank\" id=\"\">@thesweetfeminist</a>, 2) SI Design Loft, 3) <a href=\"http://instagram.com/yessiichula http://instagram.com/yessiichula\" target=\"_blank\" id=\"\">@yessiichula</a></figcaption></figure><p id=\"\">‍</p><p id=\"\">The mobile billboard arrived in West Texas on August 27th. Why a roving vehicle? To make a statement that “times have changed, and the ‘abortion road trip’ is no longer needed.” In the days before SB8 took effect, we took a 4-day <em id=\"\">road trip to end all road trips</em> to inform Texans about their option of self-managed abortion, with telehealth and pills mailed to their home. </p><p id=\"\">We began at Texas Tech, hopping out in the central plaza to talk with students and answer questions. We accompanied the billboard as it passed through campus, and then followed it as it drove through traditionally conservative areas of West Texas. We were headed to Lubbock, recently voted in as a “sanctuary for the unborn.” We didn’t know but while we were making noise IRL in Texas, our online Instagram account was suspended. We had been sharing &nbsp;original activist art and watching lively dialogue take place in the comments of the posts. But unlike other accounts that host this kind of chatter all day long, ours was swiftly silenced after a flurry of activity: if we had to guess it was likely reported by an anti-choice observer. Marie Solis wrote a brief update about the shutdown for Jezebel.com (read it <a href=\"http://jezebel.com/instagram-suspended-an-ab…\" id=\"\">here</a>).</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/61315fbc1a9e9d08639facd6_Truck_color%20-%20Credit%20Plan%20C.jpg\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div><figcaption id=\"\">The Plan C&nbsp;Truck in West Texas. </figcaption></figure><p id=\"\">‍</p><p id=\"\">Instead of being discouraged, we took this as a reminder that we cannot accomplish equitable abortion access alone: and we watched our supporters flock to Twitter and TikTok to raise their voices in our absence. It’s a reminder that this information is not ours: it belongs to everyone. It can and should be shared by anyone who gets the opportunity in front of us: that by mainstreaming abortion by mail, the method becomes undeniable and access is unstoppable. The internet is unstoppable. The next generation doesn’t want to be told they can’t have something, especially a simple and safe tool for their well-being and autonomy. Once they know about it, there’s no going back. The information revolution is unstoppable. </p><p id=\"\">&nbsp;</p><p id=\"\">In Texas, we continued our art-meets-activism journey at the historic Cadillac Ranch: a DIY art installation in Amarillo featuring a row of cadillacs jutting out of the sandy soil. Each one is decorated in decades of spray paint tags, mark upon mark layered on to create a chaotic and beautiful collective collage. </p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-floatleft\" data-rt-type=\"image\" data-rt-align=\"floatleft\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6131601204bd9ca85e709939_Cadillac%20Ranch%20Car%201%20-%20Credit%20Plan%20C.jpeg\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div><figcaption id=\"\">Car at Cadillac Ranch, Amarillo TX.</figcaption></figure><p id=\"\">We left our mark, of course.</p><p id=\"\">Our final days of road tripping were spent visiting West Texas A&amp;M, Lubbock Christian University, Midland &amp; Odessa Colleges, and UT Permian Basin. We handed out flyers and talked with more students, who approached the truck not with hostility (as our friends &amp; supporters had feared when they heard we were taking our abortion billboard to the “Bible Belt”) but with genuine curiosity, interest and gratitude. They pocketed the flyers and stickers, scanned our QR codes and signed up for our Ambassadors program. There was a heaviness to some conversations as these Texans realized SB8's looming start date--but we were able to provide some hope as we described the power and independence of abortion by mail. </p><p id=\"\">Back to that fact above about the difficulty of a lawsuit when the state is not the enforcer of the law? On Sunday night we learned that the singular court case that had been scheduled to contest the law, and possibly block it, had been cancelled. No reason was given. Later we heard news that Whole Woman’s Health had appealed the case to the Supreme Court, which is where it now rests. And at Plan C, we persist.</p><p id=\"\">Aside from the opportunity of pills by mail for early abortion, there is another way Texans can be prepared: our Plan C researchers recently learned of an important change in services from <a href=\"http://aidaccess.org/\" id=\"\">Aid Access</a>, in which they are now allowing Texans to purchase abortion pills <em id=\"\">even before they get pregnant</em>. A normal medical practice called “advance provision,” this means Aid Access doctors will provide abortion pills to people who come to their site worried about getting pregnant in the future. Nothing like having an emergency preparedness kit in your medicine cabinet! They are instructed to get back in touch for telehealth support in the case that they get pregnant and are ready to take the pills. </p><p id=\"\">Our biggest takeaway from road tripping in Texas was how warmly we were received, everywhere we went. &nbsp;People want to know, it’s not a ‘taboo topic’ to students who are curious about all sorts of other things and living their lives independently perhaps for the first time. This information belongs to them, and our conversations reflected it: they were direct, energizing and compassionate. We also learned that in 2019 Texas enacted a bill to make college campuses into 'free speech zones.' This made it even more appropriate to spend the weekend sharing abortion information on campuses across West Texas. As long as we agree on a right to free speech, Plan C has a right to share research and information widely. </p><p id=\"\">The divisions in the US only seem to be deepening at this moment in history. But two tools to help narrow the divide remain consistent, year after year: art and human connection. Art can shift someone’s perspective and touch their heart in a way that facts don’t have the power to. And human connection, 1:1 conversation and listening to the other side is the only way to see how we can share a common view of the world we want to see. </p><p id=\"\">We plan to continue to prioritize both as we pursue our mission. &nbsp;</p><p id=\"\">Onward -- </p><p id=\"\">The Plan C team.</p>",
    "Date": "Tue Aug 31 2021 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C statement on Alliance for Hippocratic Medicine vs FDA",
    "Slug": "plan-c-statement-on-alliance-for-hippocratic-medicine-vs-fda",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/660b8869d23530fe1c1c88b0_fl-courthouse.jpeg",
    "Content": "<p id=\"\">SCOTUS unanimously affirmed Alliance for Hippocratic Medicine’s lack of standing in this case, as many observers pointed out throughout the lawsuit’s progress. This is a minor win on a baseless case that never should have made it past the initial filing. We’re relieved that the court did not take action to further restrict access to mifepristone, a very safe and effective medication that is already overregulated by the Food and Drug Administration. <br><br></p><p id=\"\">Despite this win at the court, the situation regarding access to these life-saving medications continues to deteriorate at the state level. Louisiana’s recent bill designating both mifepristone and misoprostol as controlled substances, and Arkansas’ attempts to limit the provision of information to Arkansans about ways to obtain abortion pills in their state, are clear provocations. These unjust actions demonstrate that states will stop at nothing to keep pregnant people from accessing this basic medical care. &nbsp;<br></p><p id=\"\">It is also critical to acknowledge that media coverage of these bills is equally dispiriting, carrying on anti-abortion activists’ work of sowing fear and confusion forward by omitting or burying what these bills <em id=\"\">don’t</em> do. For example, though some people have been unjustly charged for taking abortion pills, criminal penalties <em id=\"\">do not </em>apply to pregnant people (they are applicable to prescribers and suppliers), and states (with the exception of Nevada after 23 weeks) <em id=\"\">do not </em>prohibit individuals from caring for their own bodies by taking abortion pills at home.<br></p><p id=\"\"><strong id=\"\">So, we want to be clear – abortion pills remain safe and effective medicines.</strong> And, they remain available in all 50 states, including places where abortions are restricted. This is possible due to a robust system of alternative suppliers that has emerged in the United States in response to unjust bans, including community support networks, new telehealth services operating from supportive states, international telehealth services, and online pill vendors. These sources have already served more than a hundred<a href=\"https://jamanetwork.com/journals/jama/fullarticle/2816817?utm_campaign=articlePDF&utm_medium=articlePDFlink&utm_source=articlePDF&utm_content=jama.2024.4266\" target=\"_blank\" id=\"\"> thousand people since Dobbs</a> and are poised to expand to meet demand. <br></p><p id=\"\"><strong id=\"\">We believe individuals have a right to manage their own health care, and Plan C exists to provide the research and information on how people are accessing these safe, effective medications for self-care. </strong><br></p><p id=\"\">“Today, we should celebrate that hundreds of thousands of people, including those in non-restricted ‘blue’ states, will not face interruptions in their access to this safe, effective medication. But we also need to acknowledge that access is continually being impeded by state legislators and that abortion bans have an outsized impact on marginalized and low-income populations. As we work toward a future in which abortion is legally available in all states, Plan C is committed to supporting abortion seekers with information and practical solutions to help them manage their own health outcomes in the face of unjust restrictions. <br></p><p id=\"\">Still, no matter what the legislatures do, abortion pills will remain available in all 50 states. Alternative routes of access are here, safe, and incredibly effective, and we expect abortion-seekers nationwide to take more and more advantage of these options. We’re glad that this will include access to FDA-approved mifepristone that we have come to rely on.”<br></p><p id=\"\">- <em id=\"\">Elisa Wells, co-founder, Plan C Pills</em></p><p id=\"\"><em id=\"\">‍</em><br><strong id=\"\">About Plan C:</strong><br></p><p id=\"\">Plan C is a public health information campaign on abortion pills and a catalyst for direct access to pills by mail in the US. Since 2015, Plan C has led the way in normalizing self-directed abortion care: actively increasing awareness of this safe and effective method and direct access to pills from any state. Plan C’s comprehensive Guide to Pills indexes sources of pills through both mainstream and alternate routes, as well as FAQs and free and confidential support hotlines, all in support of safe self-directed options despite bans to care. As a creative campaign, Plan C works with creators, brands and media and builds cross-sector partnerships to make the method more known and available and to reach audiences facing the biggest barriers to care. Plan C operates under a vision of pills in hands: disentangling the method from politics and moving agency over abortion back to the individual. <br></p><p id=\"\">Our website—<a href=\"http://www.plancpills.org/\" target=\"_blank\" id=\"\">www.plancpills.org</a>—lists the results of our research including these various routes of access, including the ecommerce sites which we continue to test for reliability. Our site also includes FAQs about using pills for self-directed care, free and confidential hotlines for support, and other person-centered resources, so no one has to go it alone.<br></p>",
    "Date": "Thu Apr 13 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C statement on FDA Rulings: Medication abortion will go on",
    "Slug": "plan-c-statement-on-fda-rulings-medication-abortion-will-go-on",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c2637b6a1c4fa34f64d_654590e33975ada32cec779a_adam-michael-szuscik-zu-eJEhMFEU-unsplash.jpeg",
    "Content": "<p id=\"\">April 13, 2023 - Last night, the United States Court of Appeals for the Fifth Circuit issued a ruling in the appeal of <em id=\"\">Alliance for Hippocratic Medicine v. FDA</em>, reinstating prior restrictions on the use of mifepristone. We want to be clear: this decision has no basis in science or administrative law. This ruling supports unverified claims of anti-abortion extremists and is designed to block access and create chaos, confusion, and fear. This new ruling will cause harm by restricting access to essential healthcare. It is a political strategy to block abortion across the U.S. and to discourage pregnant people from seeking access to abortion care.&nbsp;<br></p><p id=\"\"><strong id=\"\">We do not yet know</strong> how the ruling will be interpreted by the companies that distribute mifepristone, medical providers, and the courts.<br></p><p id=\"\"><strong id=\"\">What we do know: </strong>There is overwhelming evidence that<strong id=\"\"> </strong>mifepristone is safe and effective. No matter what courts and politicians have to say about it, there is — and will remain — a robust alternate supply of pills via Aid Access, websites that sell pills, and community networks like Las Libres, Red State Access, and WeSaveUs. <a href=\"https://www.plancpills.org/support-resources\" id=\"\">Free resources for medical and legal support</a> for self-managed abortion with pills are available to help people understand their options and make decisions that meet their needs in the face of these unjust restrictions.&nbsp;</p><p id=\"\"><br></p><p id=\"\"><strong id=\"\">Medication abortion will go on.</strong><br></p><p id=\"\">Abortion is basic health care and we deserve full, legal access to mifepristone through clinics, telehealth, and self-managed sources in every zip code in our country. Plan C will continue to <a href=\"https://plancpills.org/guide\" id=\"\">provide research-based information</a> about where to obtain medication abortion throughout this fight.<br></p>",
    "Date": "Thu Apr 13 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C statement on SCOTUS hearings 3/26/24",
    "Slug": "plan-c-statement-on-scotus-hearings-3-26-24",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c2637b6a1c4fa34f64d_654590e33975ada32cec779a_adam-michael-szuscik-zu-eJEhMFEU-unsplash.jpeg",
    "Content": "<p id=\"\">March 26, 2024 - SCOTUS’s decision to hear the case <em id=\"\">Alliance for Hippocratic Medicine</em> <em id=\"\">vs FDA</em> has not blocked access to mifepristone during the court’s consideration of the case, but today’s arguments indicate that the justices are approaching a final ruling on this baseless case - one that could vastly impact access.&nbsp; While we hope for a just ruling that would uphold the scientific authority of the Food and Drug Administration and the strong data supporting mifepristone’s safety, the current makeup of the court—and its failure in the <em id=\"\">Dobbs</em> case to uphold abortion rights—does not bode well for a good outcome.&nbsp;</p><p id=\"\">Regardless of the eventual decision, abortion pills will remain safe and effective medicines and will also remain available, either through FDA approved routes such as clinics, pharmacies, and the mail system, or through the many alternate avenues of access that have emerged in the United States in response to unjust bans. These alternate access routes–including community support networks, new telehealth services, and online pill vendors–have already served <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2816817?utm_campaign=articlePDF&utm_medium=articlePDFlink&utm_source=articlePDF&utm_content=jama.2024.4266\" id=\"\">tens of thousands of people since Dobbs</a> and are poised to expand to meet demand.&nbsp;</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Invoking the Comstock Act is Ridiculous:</strong></p><p id=\"\">Of particular concern is that the briefs in <em id=\"\">Alliance for Hippocratic Medicine vs. FDA</em> have raised the outrageous prospect of future enforcement of the 1873 Comstock Act as a way of eliminating access to abortion and more. Comstock is an <a href=\"https://www.thefire.org/news/blogs/eternally-radical-idea/mind-censor-and-eye-beholder-introduces-new-generation-infamous\" id=\"\">antiquated</a>, puritanical law designed to suppress “vice in all forms” and criminalize bodily autonomy. This antiquated law has no place in modern society or applied to modern medicine and care.</p><p id=\"\">While it’s tempting to laugh in astonishment at the level of proud ignorance and reactionary attitudes on display, there is too much harm and chaos that will result from imposing restrictions on modern medicine based on an 1873 law: with an outsized impact on communities of color, undocumented individuals, people with special needs, LGBTQ+, low income, and youth.</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">New models of access will be found, and widespread alternative access is already here.</strong><br>As courts and lawmakers continue their attempts to erode access to the basic medical care of abortion, it is becoming ever more critical that we separate the concepts of access from legality. We encourage journalists to begin reporting on the alternative but real, safe, and effective routes of access that are opening up as traditional sources are closed down by unjust actions.&nbsp;</p><p id=\"\">Alternative access routes include community support networks that mail pills for free, international telehealth services that ship pills from India, and ecommerce sites that sell generic abortion pills. Plan C regularly tests these routes of access and has found them to be reliable; periodic laboratory testing of pills supplied by these sites has found them to be real and of acceptable quality.&nbsp;</p><p id=\"\">Alternative access does not necessarily mean illegal access for those who are using these sources to obtain pills. Current laws banning abortion in so many states regulate the provision of abortion care by medical professionals and healthcare facilities, not the people who are having abortions. Most state laws do not—at least, not yet—prohibit an individual from caring for their own bodies by taking abortion pills at home (Nevada excepted after 24 weeks). There is a long history of people in other countries utilizing alternative routes to circumvent unjust laws that ban abortion access, and we expect these routes to increasingly come into play within the United States in response to political restrictions on abortion.&nbsp;</p><p id=\"\">“These are antiquated, puritanical laws and attitudes that have no place being applied in our modern society. But it is becoming clearer with every passing hearing and decision the American government is not here to protect bodily autonomy. We expect abortion-seekers to increasingly move forward with alternative routes of access, which we know are readily available and medically safe. While an unfavorable SCOTUS decision will cause chaos, fear, and harm,&nbsp; we do expect that alternate access to abortion pills will remain available in all 50 states.”</p><p id=\"\">&nbsp;-<em id=\"\"> Elisa Wells, co-founder, Plan C Pills</em></p><p id=\"\">If you’d like to read about <a href=\"https://www.teenvogue.com/story/abortion-pills-are-in-my-medicine-cabinet\" id=\"\">advance provision</a> and all of the current options available to stock up on mifepristone now, in case of future need, <a href=\"https://www.plancpills.org/guide-how-to-get-abortion-pills#faq-overview\" id=\"\">read more here</a>.&nbsp;</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\"><br>About Plan C:</strong></p><p id=\"\">Plan C is a public health information campaign on abortion pills and a catalyst for direct access to pills by mail in the US. Since 2015, Plan C has led the way in normalizing self-directed abortion care: actively increasing awareness of this safe and effective method and direct access to pills from any state. Plan C’s comprehensive Guide to Pills indexes sources of pills through both mainstream and alternate routes, as well as FAQs and free and confidential support hotlines, all in support of safe self-directed options despite bans to care. As a creative campaign, Plan C works with creators, brands and media and builds cross-sector partnerships to make the method more known and available and to reach audiences facing the biggest barriers to care. Plan C operates under a vision of pills in hands: disentangling the method from politics and moving agency over abortion back to the individual.&nbsp;</p><p id=\"\">Our website—<a href=\"http://www.plancpills.org\">www.plancpills.org</a>—lists the results of our research including these various routes of access, including the ecommerce sites which we continue to test for reliability. Our site also includes FAQs about using pills for self-directed care, free and confidential hotlines for support, and other person-centered resources.<br></p>",
    "Date": "Thu Apr 13 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C Statement: SCOTUS preserves status quo for now, but access to abortion is still lacking in the US",
    "Slug": "plan-c-statement-scotus-preserves-status-quo-for-now-but-access-to-abortion-is-still-lacking-in-the-us",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c265aade6faedb2e869_654590e33975ada32cec779a_adam-michael-szuscik-zu-eJEhMFEU-unsplash.jpeg",
    "Content": "<p id=\"\"><strong id=\"\">Plan C Statement: SCOTUS preserves status quo for now, but access to abortion is still lacking in the US</strong></p><p id=\"\">April 21, 2023 - Tonight, the Supreme Court of the United States of America issued a stay on the April 13th Fifth Circuit ruling in <em id=\"\">Alliance for Hippocratic Medicine v. FDA</em> that would have imposed restrictions on mifepristone. The ruling was issued with no acknowledgement of the decades of evidence on the safety and efficacy of mifepristone.</p><p id=\"\">“<em id=\"\">It’s absurd that once again, folks who care about their right and access to abortion are spending their Friday evening interpreting news updates from extremist judges: judges who decided this time around not to make access worse than it is. We would like to think it is because they are realizing the monumental consequences of their harmful and unjust actions — that any and every additional abuse of power will accelerate their own delegitimization and disgrace.</em>” </p><p id=\"\">- Amy Merrill, Plan C Co-founder and Digital Director</p><p id=\"\"> </p><p id=\"\"><em id=\"\">“The longer this court case continues, the further we travel down a path of legitimizing the baseless claims of a small group of extremists as something worthy of the court’s attention. A stay is the correct decision but does not erase the chaos, confusion, and fear that this case was designed to cause. And, even though mifepristone can remain on the market for now, access to abortion care is still severely and unjustly restricted in many states.”</em> </p><p id=\"\">- Elisa Wells, Plan C Co-Founder and Co-Director</p><p id=\"\"> </p><p id=\"\">There is overwhelming evidence that<strong id=\"\"> </strong>mifepristone is medically safe and effective up to twelve weeks from a pregnant person’s last menstrual period, even when used without clinician support to self-manage an abortion. While this stay preserves access to mifepristone while the case is under appeal, it does nothing to address the unjust state bans that are currently blocking access to abortion care for so many communities. Fortunately, in all states and territories, there is — and will remain — a robust alternate supply of pills for medically-safe self-managed abortion. </p><p id=\"\">The <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKLw3q8_QV1-WJV7CgFxrW2Pn_Yp6FX4s6W7Lq7_z1BM3fNW6WFStL2_99Z0W6Bl0VZ4M39bxW3s7vjC8Gb48TW4VPDxT5992FYN8fL5mnyrFHDW6dQ61n4bkkbMW8tcLRL8KCP5FW3Ddkq16wPHXYW8tdbsr4hYkqDW1tg73872JvjxW9bg0fv54C1THW2-LN-03T98wpW9jgdSf7Xwb1DW8Qgfn44t4XzTW5h6pS92YYlY5W7bv74x4TNq7KW8GcGxT9hbdPtW37j0Fl6S8jxxW6CcYQd81W_rfW1QnGHp4kh9DH38Q_1\" target=\"_blank\" id=\"\">Plan C Guide</a> is a research-based resource that describes these alternate routes of access, including Aid Access, websites that sell pills, and community networks like Las Libres, Red State Access, and WeSaveUs. The Guide also highlights potential legal risks and provides links to <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKLw3q8_QV1-WJV7CgFfyW1xM7sQ5pzGkzW8zSk9T7XH5LwW1JpKG32bz9Y6W5VVYky4rYHRKW6cszLJ6FxWHdVjF7TG1Y0m-GW2_BvRQ4DJcfsW6TcM2P6HvLrfN4BVpttnKPGnW91ZMtD7WTzt1W7dRmy764vsZmN3flhdBfPsjtW2fc_t-8m8F9BW7NmCk23_1bmJVznQ2Y77MsY_W58yl2C2j0v4gW49CTVx8PLgqsW9kGL331ZC0d2W4f4PSv212xFqW1QcsWM3csNSmW1Cj9k18Z2PwmW3pxmSW2BLcv53pjQ1\" target=\"_blank\" id=\"\">free resources for medical and legal support</a> for self-managed abortion to help people understand their options and make decisions that meet their needs in the face of this injustice.</p><p id=\"\"><strong id=\"\">Medication abortion will go on.</strong></p><p id=\"\">Plan C will continue to <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKLc3q8_wV1-WJV7CgNNlW4J6b7l86rgnHW5wQ4Gg5bxgGMW3B4fqJ5D_XCCVngQKX3sDBdPN5ljsqFr2LJSW6ysfLM1dSnLnV-q9HS1mNzkSVGNjnt8MhjPcW2_8KX09b2rT7W7fd2VT2DHw4_VMx66p4XkfFbW20HJQJ7NZfmYW8PhmLw6PkrG5W40t7tt63sFX9W1WF1rb6bdWZ3W6FpK8K8KQ4r-W5PntMx6fT-dwW6rgNsF1YkjClN5LXsHmqN603W1Fdc2W5_3t2V2Kt1\" target=\"_blank\" id=\"\">provide research-based information</a> about where to obtain medication abortion throughout this fight. </p><p id=\"\"> </p><p id=\"\"><strong id=\"\"><em id=\"\">Previous Plan C statements on this matter: </em></strong></p><p id=\"\"><a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKMp3q90JV1-WJV7CgPvSW96CYbD1m1Y9JW5lWQF79j-wL6W4Pcxg22dn4qdW3GcR9c3SD_PwW4q223n7j2XJnN5LdqXGs_FJXW1Cmd9y25-z3QW2Sby7N5VSd-QVF4N-v8wldHVW59f_s75pKVj_W1JlR9f1SDbKMN6f3CyDQ0R_BW1ZqDJR4Bv2wWV2_9NZ4kv1dgW2j9QmQ5SF3FLW1TZv5X7zxZyJW7zYRLT97FJT6VJgK2X47fgvSN502G_d-K8W8W4qHlHj7gN0yRW4rPqY695ZSsVW8Mvcfw7KQTh3W2gmd4B2-D8KCW5t40Xp2x_V0sW6Z7Vt47XvRyVW5P84sZ9crt7VN6HwqWDFRcRKW4cv3GS2nKpVc3gsD1\" target=\"_blank\" id=\"\">4/8/23, on the original FDA rulings from Texas and Washington states</a>.</p><p id=\"\"><a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VVmgCw77TLq1W4j8nsp1FHsXXW1PHNH54ZHlbWN4zFKMp3q90JV1-WJV7CgTzjW8S9Pj81ZN8G_V6PqN577CPpgVhVQsW6pcmN5W6ky7C536XbDpN5vZvj__hG-YVQDyDf5GQB7dW9dpGP0421qt_V_wmlD6tL2ZLN7JcvCCfvVVSN84xJtnWhlcZW1xYWW72C2-y1N1XjZsxMsPc2W1DNmkZ5gszZjW1z9FwB3XPm0PW5trZKX2yXR-yW5KmlyZ89HMWzW8ZlS_-5MyK1SW6vvfQS96_R_tW1slbZq1gVL29N8nHCs0GnRZKVg14k067BJRTTflC23F_-ZSW64ZMqG8lMlZ9N8fjghwTTt-CW5P9FZ91Rg3TRW4Kfxg04vmVgNW6Y14Lp5RgSdyW1f-WkG31kqGz3k_31\" target=\"_blank\" id=\"\">4/13/23, updated to comment on the 5th Circuit ruling</a>.</p>",
    "Date": "Sat Apr 22 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C x SXSW",
    "Slug": "plan-c-sxsw",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65e14bbf0a3f06cb7ad3ab60_sxsw-2020-1280x720-1.webp",
    "Content": "<p id=\"\">March 8 - 15, 2024 </p><p id=\"\">The Plan C campaign will have a multifaceted presence at this year’s SXSW conference in Austin, Texas: to join with partners on the ground and spread the word about the reality of pills by mail and free confidential support, in the face of bans to care.&nbsp;<em id=\"\">Abortion pills by mail are still a reality, even in Texas.&nbsp;</em></p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Friday March 8 - International Womens Day &amp; Unified Jam</strong></p><p id=\"\"><em id=\"\">710 West Cesar Chavez Street Austin, TX 78701</em></p><p id=\"\"><em id=\"\">Event starts 9a, Plan C Panel 3p</em> – Plan C at Unified Jam. Unified Jam is an annual celebration of activist culture. Join hundreds of inspiring activists and organizers as they share their insights and lived experiences. Plan C’s Media Manager, Martha Dimitratou,&nbsp; will be featured on a panel entitled “Silenced Choices: Fighting Digital Suppression of Abortion” alongside Jane Eklund from Amnesty International USA, Roopan Gill from the Vitala Global Foundation, and Kiana Tipton from Charley Chatbot.</p><p id=\"\">Austin Public Library. Get tickets and view the schedule <a href=\"https://www.eventbrite.com/e/unified-jam-2024-celebrating-activist-culture-tickets-704857235967\" id=\"\">here</a>.</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Sunday March 10 - Information as Care event at FFTX House <br></strong><em id=\"\">The Future Front House, 1900 e 12th st. Austin, TX</em></p><p id=\"\"><em id=\"\">3p - 9p: </em>INFORMATION IS CARE. Join Autumn Breon, Plan, and Future Front for<em id=\"\"> The Care House, </em>a literal and figurative community salon. For one day only, <em id=\"\">The Future Front House</em> will transform into the official tour stop for <em id=\"\">Care Machine</em>, Autumn Breon’s latest installation, a traveling beauty and sexual health vending machine.&nbsp;</p><p id=\"\">RSVP for the Care House <a href=\"https://carehouseaustin.splashthat.com/\" id=\"\">here.</a></p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Monday March 11 - Panel on Global Impact of Big Tech Suppression of Abortion Information, <em id=\"\">SXSW Digital Civics Track </em>&nbsp;</strong></p><p id=\"\"><em id=\"\">10a</em> - SXSW Panel. Plan C will speak on official SXSW panel titled “<em id=\"\">Big Tech’s Suppression of Abortion Information: Implications for Sexual and Reproductive Healthcare Access in the Americas and Beyond</em>” as part of official SXSW programming. Panel includes Plan C, Amnesty Int’l, Fos Feminista, and Fight For The Future.&nbsp;&nbsp;</p><p id=\"\"><a href=\"https://schedule.sxsw.com/2024/events/PP133270\" id=\"\">Official SXSW event page</a> here.</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">March 10 to 13 - Mobile Billboard Truck&nbsp;&amp;&nbsp;Auto(nomous)&nbsp;Body Shop Van </strong></p><p id=\"\">‍<em id=\"\">All Day </em>- Project for Empty Space/ For Freedoms + Fight For The Future Porject</p><p id=\"\">During the first four days of the festival, mobile billboard trucks will showcase past <a href=\"https://www.forfreedoms.org/\" target=\"_blank\">For Freedoms</a> billboards and curated artwork by <a href=\"https://www.projectforemptyspace.org/\" target=\"_blank\">Project for Empty Space</a>, focusing on body autonomy/reproductive rights and messages calling out Big Tech's responsibility in abortion access. These billboards will target Big Tech attendees, Health and Tech conferences, and key locations such as the Blanton Museum of Art, the Texas Capitol, SXSW attendee hotels, and the Future Front House for eight hours daily.&nbsp;&nbsp;</p><p id=\"\">Projections with the same visuals will be projected in select locations (convention center and surrounding locations) from March 10-13. </p><p>‍</p><p id=\"\">Also on the streets of Austin: the Auto(nomous) Body Shop <a href=\"https://www.instagram.com/the.auto.body.shop/\" id=\"\">(@the.auto.body.shop</a> on IG) will be disseminating Plan C information and SRH products for the duration of our time at the festival.&nbsp;&nbsp;</p><p id=\"\">‍</p><p id=\"\"><em id=\"\">+&nbsp;Our friends at SYA will be doing some radical actions at music events later in the week… more on this soon! </em></p>",
    "Date": "Fri Mar 01 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C Team member Imani Wilson-Shabazz spoke on a panel at Sundance Film Festival entitled: Joy as Cultural Innovation. Watch the conversation",
    "Slug": "plan-c-team-member-imani-wilson-shabazz-spoke-on-a-panel-at-sundance-film-festival-entitled-joy-as-cultural-innovation-watch-the-conversation",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c268f2e343d8fd7e7fc_63f7a50686d96726fd0eeac5_Imani%2520Headshot%25201.jpeg",
    "Content": "<p id=\"\">&nbsp;Plan C Team member Imani Wilson-Shabazz spoke on a panel at Sundance Film Festival entitled: <em id=\"\">Joy as Cultural Innovation. </em>Watch the conversation below.</p><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-fullwidth\" style=\"padding-bottom:56.206088992974244%\" data-rt-type=\"video\" data-rt-align=\"fullwidth\" data-rt-max-width=\"\" data-rt-max-height=\"56.206088992974244%\" data-rt-dimensions=\"854:480\" data-page-url=\"https://www.youtube.com/watch?v=NND9Z53ZzW4&list=PLqTFWS13qKPLy-wuFL8vytSyzH6cQ6mgf&index=6\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/NND9Z53ZzW4\"></iframe></div></figure>",
    "Date": "Thu Jan 26 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Plan C x Amanda Palmer: new abortion music video now out",
    "Slug": "plan-c-x-amanda-palmer-new-abortion-music-video-now-out",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/668c720610c296a7c1ad88cc_Screenshot%202024-06-25%20at%202.35.49%E2%80%AFPM.png",
    "Content": "<h5 id=\"\"><strong id=\"\">Voicemail for Jill:&nbsp;Your Heart Also Matters </strong></h5><p>Plan C&nbsp;recently joined forces with artist/activist Amanda Palmer to create a short film using her powerful abortion song, “<em id=\"\">Voicemail for Jill</em>.” Watch the video below and follow the links to share it widely: to honor the hearts of abortion seekers and activsits, and to spread information about pills by mail. We can continue to show up for one another, and ensure people know they have options for safe abortion, no matter where they live. </p><p>‍</p><p><strong>Background:&nbsp;</strong></p><p>Often in the movement to protect abortion rights and access, we don’t have time to speak on about *why* we do what we do: it’s inherent, assumed, happening. We do it because having the ability to access abortion aligns with our values, our desire for a more liberatory world, our belief in body autonomy and self-determination, our vision of a more equitable future.&nbsp;</p><p id=\"\">As we recognize the anniversary of the <em id=\"\">Dobbs</em> decision, and wait to hear more baseless SCOTUS cases - worthy of the rallies and the rage - we can also acknowledge the brave and tender humans behind the movement. We hope this video offers a pause, a chance to slow down, remembering the tender hearts in both the abortion seekers and the activists, and all that they are holding. Remembering all that folks are doing to overcome barriers to care, pushing through protesters and misinformation, navigating fear and confusion, to find answers and reclaim their futures. All that providers and activists are doing to help ensure seekers can find care in the moment they need it. </p><p id=\"\">Behind the work of providers and abortion organizations and numbers of abortions in the US, there are real people. Their hearts also matter, and so does yours.&nbsp;</p><p><strong>Watch the video</strong> below, or <a href=\"https://www.instagram.com/p/C8ncXNJCCFL/\" id=\"\"><strong id=\"\">watch and repost here on Instagram</strong></a>:&nbsp;along with the message that abortion is still possible and pills by mail are still a reality in all states.</p><p>Full social media toolkit with captions and post suggestions <a href=\"https://docs.google.com/document/d/1r2C93seNMwdE14coD5fcynDrK1RqUMlgCs-d2iPE4Gw/edit\">here</a></p><p id=\"\">Find pills at <a href=\"http://plancpills.org\" id=\"\">plancpills.org</a>&nbsp;</p><p id=\"\">Get medical questions answered <a href=\"http://mahotline.org\" id=\"\">mahotline.org</a>&nbsp;</p><p id=\"\">Get legal questions answered at <a href=\"http://reprolegalhelpline.org\" id=\"\">reprolegalhelpline.org</a>&nbsp;</p><p id=\"\">Take action with <a href=\"http://shoutyourabortion.com\" id=\"\">shoutyourabortion.com</a>&nbsp;</p><p>And donate to fund pills at <a href=\"https://www.plancpills.org/fund-pills\">plancpills.org/fund-pills.&nbsp; </a></p><p id=\"\">‍</p><figure class=\"w-richtext-figure-type-video w-richtext-align-center\" style=\"padding-bottom:33.802816901408455%\" data-rt-type=\"video\" data-rt-align=\"center\" data-rt-max-width=\"\" data-rt-max-height=\"33.802816901408455%\" data-rt-dimensions=\"426:240\" data-page-url=\"https://vimeo.com/948519904\"><div><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/948519904\" title=\"Voicemail for Jill x Plan C: Your Heart Also Matters\"></iframe></div></figure><p>‍<em id=\"\">No one on that</em></p><p id=\"\"><em id=\"\">Pavement's gonna</em></p><p id=\"\"><em id=\"\">Shout at you that</em></p><p id=\"\"><em id=\"\">Your heart also matters</em></p><p>Excerpt from “Voicemail for Jill” by Amanda Palmer</p><h5 id=\"\"><strong id=\"\"> </strong></h5>",
    "Date": "Mon Jun 24 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "PLAN C X Feminist Narrative Feature Series: Priscila Barbosa",
    "Slug": "plan-c-x-feminist-narrative-feature-series-priscila-barbosa",
    "Author": "An Illustrated Conversation with Priscila Barbosa",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/664bb4f569ecd3da34b870ee_prii-barbosa-thumbnail.jpg",
    "Content": "<h5 id=\"\"><strong id=\"\">Tell us about yourself: </strong></h5><p id=\"\">Hello, my name is Priscila Barbosa. I am a visual artist, muralist and illustrator from São Paulo, Brazil. My work investigates the iconography of contemporary revolutionary women with a focus on Latin America, where I propose critical insights into prevailing aesthetic and behavioral patterns, in a strategy of confrontation and questioning of power relations. Through portraits of women and the mixture of elements linked to domestic work – such as dish towels, kitchen and cleaning utensils – with symbols of insubordination, I builds scenes that aim to provoke the spectator through opposition. Images are created that at first glance suggest the docility expected of the female gender, reinforced by the rosy tones, characteristic of my production, but which reveal insurgency and rebellious activities.</p><p id=\"\">For this partnership, made at the invitation of Plan C, I chose to illustrate a scene that promotes care among women and encourages self-valuation and autonomy. I place them in a scenario that refers to the home as this powerful place for transmitting knowledge and welcoming, full of tradition. One of the characters has a sprig of rue in her ear, a very powerful symbol in Brazil for its medicinal and spiritual power, and which today is used by the Brazilian feminist movement with great emphasis. &nbsp;The other character has her hair braided with a scarf that alludes to the green scarf, a symbol of the decriminalization and legalization of abortion in Latin America.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">Can you tell us about how Brazil's culture and environment are shaping your practice?</strong></h5><p id=\"\">A large part of my work is questioning standards that we face as Brazilian women, in a very recent process of self-discovery as latin women. Brazil, due to colonization processes, does not understand itself as part of Latin America and this has been a fundamental factor in my research. &nbsp;Our country has been looking for ways to connect economically, culturally and politically with neighboring countries, which strengthens our collective demands. In this process of cultural appreciation, I revisit elements of my upbringing and the places where I grew up, inserting textile and architectural symbols that are part of the memories of many other Brazilian women.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How do reproductive health and abortion access come up in your circles?</strong></h5><p id=\"\">Within the understanding that our country has diverse realities and cultures, also due to its territorial extension, Brazilian feminism sees the importance of acting to defend women's rights in very diverse contexts. Throughout my career combining political discussions with poetic creations, reproductive health has appeared as a topic of extreme urgency and I have had the pleasure of working with several initiatives that are at the forefront of the discussion in Brazil and the Global South. The urgency of this issue has become so evident that today one of the objectives of my work is to naturalize conversations about reproductive rights, encouraging us to listen to each other and have information at home and with those close to us.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How does access to reproductive health resources in your community affect your artwork or your personal life?</strong></h5><p id=\"\">In Brazil, although abortion is permitted in three situations (fetal anencephaly, risk to the life of the pregnant person and sexual violence), it has placed several barriers to access the procedures that should be protected by legislation. &nbsp;Furthermore, another existing barrier is the community's judgment on the person who has an abortion. My work seeks to precisely address the topic from the perspective of care, support and solidarity, demystifying the profile of the person who aborts. Art has the power to contribute directly to social and cultural changes that need to go hand in hand with changes in the law and new medical protocols, reducing the risk of the population not using available services because they still maintain the stigma that abortion is a moral transgression.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">What initiatives or organizations do you believe are essential for improving reproductive health access in your community?</strong></h5><p id=\"\">Brazil has several organizations that work locally and nationally to ensure that we can not only advance the discussion on reproductive health, but also not lose the few rights achieved in this area. One of these organizations that I greatly admire and have had the pleasure of working with is Anis Bioetica, which promotes reproductive justice and human rights for various marginalized groups through an intersectional, anti-racist and anti-ableism bias.</p><p id=\"\">In my city, São Paulo, another partnership is Projeto Vivas, which helps girls, women and people who are pregnant to access legal abortion services in Brazil and neighboring countries, when necessary.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How do you think the culture and feminist movement in Latin America (green wave etc) conitnue to shape international solidarity?</strong></h5><p id=\"\">Latin America has set a great example of international mobilization, uniting experiences from different countries in maintaining our rights and gaining more space in discussions that directly affect our existence. We have learned a lot from our colleagues in neighboring countries and shared strategies for legislative actions, but also for popular action. This is a big factor, the involvement of the population and the pressure that the people are capable of exerting.</p><p id=\"\">An important point is the promotion of autonomy when we discuss health. In Latin America we have increasingly looked to the past and the knowledge that has been passed down through generations and rescued ways of taking care that are in the process of being forgotten. Community health, medicinal knowledge of plants, food, all of these are ways to de-medicalize health and understand our active role in our own body's decisions.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">What does it mean for you to have access to bodily autonomy?</strong></h5><p id=\"\">Living in a society that does not involve moralism or religion in decisions that should be based on evidence and that deal with public health issues. While white men and neoliberal Christian leaders defend their views in favor of the traditional Brazilian family, thousands of women continue to lose their lives in clandestine procedures. The profile of these women, the vast majority of whom are black and from vulnerable groups, denounces the hygienist nature of the delay in discussions on reproductive rights. Hence the importance of expanding our vision on the topic, understanding that discussing abortion is also discussing the hegemonic structures of our country.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2362px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2362px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/664bb442851a095064be8924_PriscilaBarbosa_IllustratedPost_01.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2362px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2362px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/664bb45179a9fa41f5f23743_PriscilaBarbosa_IllustratedPost_02.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2362px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2362px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/664bb464d64b3ad774bf5a2e_PriscilaBarbosa_IllustratedPost_03.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2362px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"2362px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/664bb46f3f8cf8c23c657662_PriscilaBarbosa_IllustratedPost_04.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><p id=\"\">‍</p><blockquote id=\"\"><strong id=\"\">Find out more about Priscila's work by following her at </strong><a href=\"https://instagram.com/priii_barbosa\" target=\"_blank\" id=\"\"><strong id=\"\">@priii_barbosa</strong></a><strong id=\"\">.<em id=\"\"> </em></strong><em id=\"\"><br><br>The narrative feature series is a collaboration project between Plan C and @Feminist. Learn more about @Feminist and how to support them </em><a href=\"https://www.instagram.com/feminist/?hl=en\" target=\"_blank\" id=\"\"><em id=\"\">here</em></a><em id=\"\">.</em></blockquote>",
    "Date": "Mon May 20 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "PLAN C X Feminist Narrative Feature Series: Reyna Noriega",
    "Slug": "plan-c-x-feminist-narrative-feature-series-reyna-noriega",
    "Author": "An Illustrated Conversation with Reyna Noriega",
    "Thumbnail": "https://cdn.prod.website-files.com/5f7e07d162248b2c1139d2ef/66f4a6b4bcf0efb6849c50c8_PlanC-thumb.jpg",
    "Content": "<h5 id=\"\"><strong id=\"\">Tell us about yourself: </strong></h5><p id=\"\"><em id=\"\">Hello, my name is Reyna Noriega. I am a visual artist and author from Miami, FL. </em></p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">Can you tell us about how your Cuban and Bahamian cultures and environment are shaping your practice?</strong>‍</h5><p id=\"\">There are a variety of ways that my culture as an american born Black woman with parents from the caribbean shape me. I mention them that way because there are distinct ways that each identity shapes me, my practice, my challenges, and my privilege. There are stories that must be told, and specific ways I choose to illustrate those stories. You can see some of that vibrant, rich, culture in the color and subjects of my work but there's also this need to paint and portray women in a peaceful and uplifting manner because in my culture the women are strong matriarchs, carrying the weight of their families on their shoulders. It is often a thankless role that leaves little space for self-prioritization and self-actualization. An endless cycle of sacrifice that is noble yet makes me a bit sad when I reflect on my own child-free independence. Although I desire motherhood for myself, knowing it will be on my terms and I am empowered to chase my dreams leads me to do what I can to empower others.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How do reproductive health and abortion access come up in your circles?</strong>‍</h5><p id=\"\">I was born to parents with Christian and Catholic backgrounds and I know all too well the ideology of the sacredness of life and the hypocrisy that surrounds women's reproductive rights, I’m fortunate that my family has a progressive view and supports a woman's right to choose. I am very passionate about attacking problems at the root. That means having accessible education and also an understanding that one person or one groups belief for their bodies should not encroach on the rights of others. I have been very careful not to tie the right for a woman to access healthcare tied to trauma such as rape because I believe a women should have just as much say in when she becomes a mother as a man, and until contraceptives are 100% effective, denying access to abortions are denying a womens right to bodily autonomy.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How does access to reproductive health resources in your community affect your artwork or your personal life?</strong>‍</h5><p id=\"\">My art is centered on the idea of women's liberation through the ability to envision their most confident, joyful, and peaceful selves. Bodily autonomy is central to women being able to feel like they are in control of their own destinies. A world where women are suppressed is not one where we can hope, dream, and create brighter futures for all.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How do you believe the availability of reproductive health services shapes the broader cultural and societal environment in Florida, particularly in light of the recent implementation of a 6-week abortion ban?</strong>‍</h5><p id=\"\">It creates an environment of fear and hostility. Abortions are not easy decisions for women, it is one that often leaves women in a state of grief for years to come yet the climate during a band suggests that a ban is “nobel” and women that are seeking that type of support are evil and irresponsible. Many women show no symptoms of pregnancy that early and makes it hard for physicians to administer life saving care for mothers experiencing complications that require a medical abortion even in cases where it is certain the fetus will not make it. As a society we need more compassion and support for vulnerable groups.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">What does it mean for you to have access to bodily autonomy?</strong>‍</h5><p id=\"\">To me, Bodily autonomy gives women the confidence and safety in knowing their body is their own. Over the course of history the treatment of women has surrounded an idea that we must only exist to serve the patriarchy, our bodies included. Our hopes, dreams, feelings were seldom accounted for.<strong id=\"\"> </strong> I have had such a complicated journey with my own sensuality due to the ways that our bodies often do not feel like our own. Having bodily autonomy can mean the difference between a women being able to pursue her goals versus becoming entangled in a brutal system that will prove time and time again that her desires do not matter, her contributions do not matter. We must live in a world where we protect and uplift women. We sew life into this world with everything we touch and create, and when we choose to, we bring life into this world and there is nothing more sacred and worth protecting than that.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/5f7e07d162248b2c1139d2ef/66f4a6c4c91d0d8feaaa9ea3_66f4a1caf5595360eb395b8a_PlanC-00.jpeg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/5f7e07d162248b2c1139d2ef/66f4a6c4c91d0d8feaaa9e96_66f4a1dbb1b25d96aab3a70b_PlanC-01.jpeg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/5f7e07d162248b2c1139d2ef/66f4a6c4c91d0d8feaaa9e9f_66f4a1e609346aa48fabad6c_PlanC-02.jpeg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/5f7e07d162248b2c1139d2ef/66f4a6c4c91d0d8feaaa9e9c_66f4a1ef657006d2451293e1_PlanC-03.jpeg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:960px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"960px\"><div id=\"\"><img src=\"https://cdn.prod.website-files.com/5f7e07d162248b2c1139d2ef/66f4a6c4c91d0d8feaaa9ea6_66f4a1fdcaa08549a4f4f8b6_PlanC-05.jpeg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><p id=\"\">‍</p><blockquote id=\"\"><strong id=\"\">Find out more about <em id=\"\">Reyna’s</em> work by following her at </strong><a href=\"https://instagram.com/reynanoriega_\" target=\"_blank\" id=\"\"><strong id=\"\"><em id=\"\">@reynanoriega_</em></strong></a><em id=\"\"><br><br>The narrative feature series is a collaboration project between Plan C and @Feminist. Learn more about @Feminist and how to support them </em><a href=\"https://www.instagram.com/feminist/?hl=en\" target=\"_blank\" id=\"\"><em id=\"\">here</em></a><em id=\"\">.</em></blockquote>",
    "Date": "Mon May 20 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "PLAN C X Feminist Narrative Feature Series",
    "Slug": "plan-c-x-feminist-narrative-feature-series-samantha-vassor",
    "Author": "An Illustrated Conversation with Samantha Vassor",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/661ed1c72ef4d004e4326270_PLAN%20C_CAROUSEL%202.png",
    "Content": "<p id=\"\"><em id=\"\">Hello, my name is Samantha Vassor. I am a CGI artist and designer based in Miami, Florida. I am deeply inspired by the diverse cultures here, as well as my personal experiences as a Haitian-Filipina, first-generation, American woman. Living here has allowed me to reflect on my roots; the natural, tropical environments I grew up in; and all the personal growth I have experienced since.</em></p><p id=\"\"><em id=\"\">The animation I created, ‘The Birds and the Bees’, reflects on the old metaphorical stories taught to young people to explain human sexuality and intercourse. With the current state of our government and our laws, as well as the ban on books in schools, I hoped we could all collectively critique and reflect on contemporary sex education in the United States.</em></p><p id=\"\"><em id=\"\">When working on this piece for PLAN C, I wanted to think of a world where abortion care was so accessible, hummingbirds carried envelopes and let abortion pills rain from the sky. The birds and the bees worked together to create a world full of accessible healthcare for people with uteri. The plant and animal life are reminiscent of Floridian and Caribbean landscapes and bring a sense of comfort: This is a world I long for.</em></p><h5 id=\"\">‍</h5><h5 id=\"\"><strong id=\"\">- Tell us about how Florida’s culture and environment are shaping your practice.</strong></h5><p id=\"\">Living in South Florida and Miami, you can really experience the diverse cultures of Latine/Hispanic, Black, and Caribbean communities. I am constantly inspired by the diversity of foods, music, and languages of the people that live here. Having family and ancestry from Haiti, I am blessed to exist in this city with the largest population of Haitian people in the United States. Miami has a large diaspora of people with rich cultural histories that influence the art communities here. It only inspires me to further learn about my family’s history and tie that into my practice.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">- How does reproductive health and abortion access come up in your circles?</strong></h5><p id=\"\">Because of the varying political opinions of people in Florida, I rarely hear about open conversations on reproductive health and abortion access. A lot of these topics are still considered very taboo to address, even amongst all the current state laws being created on the subject. As a result of this lack of conversation, knowledge and information about resources are limited as well.</p><p id=\"\">‍</p><h5 id=\"\">- How does access to reproductive health resources in your community affect your artwork or your personal life?</h5><p id=\"\">After the overturn of Roe v. Wade in 2022, I went into a small panic. I never imagined my rights to my body and my healthcare would be taken from me so easily, and I felt I had to take more serious measures to protect my health before the government and state laws got more restrictive.I had taken birth control pills before but had horrible side effects from the medication. After the overturn of Roe V. Wade, I felt I had no choice but to revisit exploring birth control options regardless of the negative experiences I previously had. I tried Nexplannon but eventually had it removed because of side effects on my body. I tried a copper IUD and had numerous complications before having to have it removed, twice. I did eventually find something that worked for me; Nuvaring. Without health insurance, however, &nbsp;Nuvaring can cost up to $200 and can be out of many Americans' price range.With the experiences I’ve had in my reproductive health journey, I’ve had to reflect on the discouraging feelings of having a government unsupportive of my needs, and the constant opinions of what a woman or femme person should or should not be. It’s all only inspired me in my art practice further to push my narrative and other feminine narratives alike.</p><p id=\"\">‍</p><h5 id=\"\">- What initiatives or organizations do you believe are essential for improving reproductive health access in your community?</h5><p id=\"\">Plan C and all your work as an organization is imperative. More people need to know that mail-in abortion pills are an option, especially in places where abortion is largely inaccessible. I am so grateful to be supporting your organization in spreading knowledge on these topics. Planned Parenthood has also been a vital organization for reproductive health care, sex education, and information, not only in the United States but worldwide.Feminist is an important media platform I have worked with that advocates for women's and gender-expansive people’s rights, for not only reproductive health but for all-around gender equality.</p><p id=\"\">‍</p><h5 id=\"\">- How do you believe the availability of reproductive health services shapes the broader cultural and societal environment in Florida, particularly in light of the recent implementation of a 6-week abortion ban?</h5><p id=\"\">With the 6-week abortion ban in effect in Florida, millions of people with uteri will be affected. I have been privileged enough to find healthcare options for myself, but Black and Brown, marginalized, and lower-income communities are the most affected. Individuals who don’t know their rights, state laws, or next viable options will be the most affected.According to Health News Florida, people from Miami will have to travel 14 hours by car to the closest abortion clinic, Bristol Women’s Health Center, in Bristol, Virginia. That will become the closest practical option.<br>Health News Florida continues to write, “Stephanie Loraine Piñeiro, executive director of the Florida Access Network, which helps pay for abortion care for Florida women, said getting to another provider will drive the average cost of abortion — including transportation, lodging, meals, child care, and clinic fees — to around $4,000, about twice what it is now. That will strain organizations like hers, which already often hits its budget limit well before the end of the month, as they shift to helping people get care elsewhere.That could strand people who can't get time off work, afford travel, arrange child care or lack documentation to travel, Piñeiro said.‘The people who are most marginalized are going to continue to not have access,’ she said.”</p><p id=\"\">‍</p><h5 id=\"\">- What does it mean for you to have access to bodily autonomy?</h5><p id=\"\">I would like to exist in a world where people without a uterus did not have law-creating opinions on what I should and should not do with my own body, or what healthcare I should or should not have access to. I do not believe a democratic government should have that type of power over large masses of women and their choices.Regardless of individual opinion on what is right and ethical, every person will have their own reasons, circumstances, and health concerns that would affect their decision to have an abortion. We should all have an individual right to an abortion and an agency over our own bodies.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1080px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1080px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/661ec690dc6c0a7994d9c6d9_PLAN%20C_CAROUSEL%202.png\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1080px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1080px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/661ec6b4e25361f726d7c62a_PLAN%20C_CAROUSEL%203.png\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1080px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1080px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/661ec6bc2096e282febc581b_PLAN%20C_CAROUSEL%204.png\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1080px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1080px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/661ec6c7206fa86b735806af_PLAN%20C_CAROUSEL%205.png\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-video w-richtext-align-fullwidth\" style=\"padding-bottom:125%\" data-rt-type=\"video\" data-rt-align=\"fullwidth\" data-rt-max-width=\"\" data-rt-max-height=\"125%\" data-rt-dimensions=\"240:300\" data-page-url=\"https://vimeo.com/935592326?share=copy\"><div id=\"\"><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://player.vimeo.com/video/935592326\" title=\"An Illustrated Conversation with Samantha Vassor\"></iframe></div></figure><p id=\"\">‍</p><blockquote id=\"\"><strong id=\"\">You can find more about Samantha’s work by following her at </strong><a href=\"https://www.instagram.com/svassor/?hl=en\" target=\"_blank\" id=\"\"><strong id=\"\">@svassor</strong></a><strong id=\"\">.</strong><em id=\"\"> <br><br>The narrative feature series is a collaboration project between Plan C and @Feminist. Learn more about @Feminist and how to support them </em><a href=\"https://www.instagram.com/feminist/?hl=en\" target=\"_blank\" id=\"\"><em id=\"\">here</em></a><em id=\"\">.</em></blockquote><p id=\"\">‍</p><p id=\"\">‍</p>",
    "Date": "Tue Apr 16 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "PLAN C X Feminist Narrative Feature Series: Tracie Ching",
    "Slug": "plan-c-x-feminist-narrative-feature-series-tracie-ching",
    "Author": "An Illustrated Conversation with Tracie Ching",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6685d517169170f454d874e8_TChing-thumbnail.jpg",
    "Content": "<h5 id=\"\"><strong id=\"\">Tell us about yourself: </strong></h5><p id=\"\"><em id=\"\">Hello, my name is Tracie Ching. I am an artist and illustrator living in Washington, DC ….</em></p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">Can you tell us about how Hawaiʻi’s culture and environment are shaping your practice?</strong>‍</h5><p id=\"\">I was born on the island of Oʻahu but moved away when I was young. To heal some of my diasporic wounds, I earned a degree in Hawaiian Studies to better understand my people and my culture. One thing that was clear in my studies was the importance of mālama. In the Hawaiian language mālama has a nuanced meaning - &nbsp;to take care of, preserve, protect, save. It is often used in reference to ka ʻāina, or the land. In Hawaiian culture, everything and everyone throughout time are connected - tied to the earth. Our duty to all those that came before and all that will come after is to care for the land, care for each other, and care for our bodies. This was the inspiration for this feature’s illustration. For as an artist, it is my hope to perpetuate these ideals by serving as both conduit and representation.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How do reproductive health and abortion access come up in your circles?</strong>‍</h5><p id=\"\">It always comes back to access - or these days, the lack thereof. So many folks my age and younger are ultimately deciding to alter major life plans due to the mounting restrictions. The growing void of accessible care, especially for sexual health, is convincing many I know to avoid having children, move to a different state, or even leave the country altogether. I don’t think the impact the repeated infringement on our bodily autonomy can be understated, and many of us are very aware of the long-term, long-reaching impact on our individual and collective futures.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How does access to reproductive health resources in your community affect your artwork or your personal life?</strong>‍</h5><p id=\"\">The immediate concern I have is for my children, especially as they near pre-teen age. My children and their friends are approaching a crucial time where systems should be educating and supporting them as they grow and learn about their bodies and all the related natural processes. Unfortunately, these systems are being dismantled or were already failing, placing the responsibility on parents and the community. As a parent and artist, I feel a duty to educate, advocate, and listen while learning alongside my children. However, fear persists. What if my efforts are in vain when the system criminalizes those exercising bodily autonomy? </p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">What initiatives or organizations do you believe are essential for improving reproductive health access in your community?</strong>‍</h5><p id=\"\">I have always believed organizations like PlannedParenthood are essential. They continue to serve the community, especially those already historically underserved, by offering a plethora of services that include sexual health and education, testing and vaccines, mental health and more. That being said, organization like Planned Parenthood can only do so much when their ability to operate is at risk. For this reason voting initiatives are equally as essential. Mālama for our communities means voting for government officials who will defend our basic rights at all levels. This is more important now than ever before. </p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">How do you believe the availability of reproductive health services shapes the broader cultural and societal environment, particularly in light of the recent implementation of a 6-week abortion ban?</strong>‍</h5><p id=\"\">I believe that in a classic fashion these rules will not apply to the privileged. That the very proponents of this ban will continue to receive reproductive healthcare and seek abortions for themselves or those close to them. The heaviest blows will inevitably be dealt to minoritized communities. For that is the point, isn’t it? To divest anyone with a uterus of power. To shackle people to life-altering circumstances, even when those circumstances are no fault of their own. To further impoverish and criminalize Black, Indigenous and Hispanic folks in this country. Forgive the soap box, but the wealth gap will continue to stretch and the powerful will remain powerful so long as these infringement on our rights is allowed to persist.</p><p id=\"\">‍</p><h5 id=\"\"><strong id=\"\">What does it mean for you to have access to bodily autonomy?</strong>‍</h5><p id=\"\">Bodily autonomy, the right to control your own body, is central to the human experience. We are born free individuals, answerable only to ourselves and the natural world. When others attempt to undermine this right, taking away our choices and hindering our ability to care for ourselves and our loved ones under the pretense of questionable morals, it fundamentally contradicts what it means to be human.</p><p id=\"\">‍</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1025px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1025px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6685d4432607bf70f84fb7b8_TChing-PlanC-Final4x5.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1025px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1025px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6685d4552e148b308bdcc4d4_TChing-PlanC-Final4x5-Slide1.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1025px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1025px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6685d45b23a823951172522a_TChing-PlanC-Final4x5-Slide2.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1025px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1025px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6685d462169170f454d7ef4f_TChing-PlanC-Final4x5-Slide3.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1025px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1025px\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6685d47f6dfb298f36380c6b_TChing-PlanC-Final1x1.jpg\" loading=\"lazy\" alt=\"__wf_reserved_inherit\" width=\"auto\" height=\"auto\" id=\"\"></div></figure><p id=\"\">‍</p><blockquote id=\"\"><strong id=\"\">Find out more about Priscila's work by following her at </strong><a href=\"https://instagram.com/priii_barbosa\" target=\"_blank\" id=\"\"><strong id=\"\"><em id=\"\">@tracieching</em></strong></a><em id=\"\"><br><br>The narrative feature series is a collaboration project between Plan C and @Feminist. Learn more about @Feminist and how to support them </em><a href=\"https://www.instagram.com/feminist/?hl=en\" target=\"_blank\" id=\"\"><em id=\"\">here</em></a><em id=\"\">.</em></blockquote>",
    "Date": "Mon May 20 2024 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Press Release: Abortion Access Campaign Plan C Will Not Let Ruling Against the FDA Halt Access to Pills",
    "Slug": "press-release-abortion-access-campaign-plan-c-will-not-let-ruling-against-the-fda-halt-access-to-pills",
    "Author": "Amy Merrill, Plan C Digital Director",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a48c27969bf33254bd616d_6431d4343bf6017159339f1b_Screen%2520Shot%25202022-07-29%2520at%25203.33.09%2520PM.png",
    "Content": "<p>‍<strong id=\"\">Abortion Access Campaign Plan C Will Not Let Ruling Against the FDA Halt Access to Pills</strong></p><p id=\"\"></p><p id=\"\">Request Interview at: <a href=\"mailto:press@plancpills.org\">press@plancpills.org</a></p><p id=\"\">More information at: <a href=\"https://plancpills.org/media\" target=\"_blank\">plancpills.org/media</a></p><p id=\"\"> </p><p id=\"\">April 8, 2023 - Yesterday, Judge Kaczmaryk issued a<a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/MX3xtttSzqQW21yVwz1Dz0J_W2C4PM94Z6QDcN4313K53q90_V1-WJV7CgLmrW1bx5dN1nfbXcW2T-ZBh1rl2wfW788MdG8n-p1sW33gRSS7RWD4KW6Ssgw5764bczW1DpGxP7-MQPmW1Flynr4nTRHCW7SX_Dt87Xx6yVv3Tbc6XjqWrW1ng4qY5Gbs4gVm0_yD8sfZ1cVk6kjN7Df1RXW6-_gvJ3BBnSBW6nHWy22KgRhLVtKYPV19-xMXW3nVxbx5dnGXtVBs6lz20GMMJW5Lg_MG6ycZ37W8RVJsZ409bbFV5pCDT4kM5KcW5ry85h3Th8rPW3F55tV8zr88nW7_XmBx7PCdfYW2gMX6B95cmCxW2lJp8n29kCp5W6RTwWG7JmN2yW3Yf8Fx9ktr4LW5Yh6yv4X2g-LW8SW0SQ3SkMYtW2359Y724H11L33kN1\" target=\"_blank\"> decision</a> in <em id=\"\">Alliance for Hippocratic Medicine v. FDA</em> staying the FDA’s approval of mifepristone (but giving the FDA seven days to appeal before the order goes into effect). Almost immediately after, Judge Thomas Rice of the Eastern District of Washington issued a<a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/MX3xtttSzqQW21yVwz1Dz0J_W2C4PM94Z6QDcN4313K53q90_V1-WJV7CgJP5M1jJcR-b-p0W5cjBd52pJRFpW3DYYpr3DtmR4W1rMCcC8byZ8lW8j0FCJ4rHs6JVYN2Dc3-RFpfW4h9zY88MFDlmW7zr4TC4S5gDPN346cwM4nj04N7LCPZqT_Np-W2KpY-88cHxh4W8-xLlZ8vNLjtW2vFJwm59PtR9VvkXq05TnZdnW6scq6J1x0g1RW66R8Zr8KSsxjW2gM7095B3jMsW2NP54Y8TBNbFN42Q7y_fsHGZN79_7gC6jJsPW9m00sR8lp6MpW34MFjL8Hk_QhW87ZRrM7Dwy9sW76GBKP4XkbkYW2yjLQC8T86KqW754pTz2ZbvrBN4zBg_f23GBdW4xX4Pb4trC3-N8q3YqBCHm_dW8v7mkv1Gjdzr3pRn1\" target=\"_blank\" id=\"\"> decision</a> blocking the FDA from making any changes to access to mifepristone in Washington State and the 16 other states and the District of Columbia that joined in that action. </p><p id=\"\">Multiple politicians and experts then tweeted their beliefs that the FDA has the authority to ignore the Texas ruling, including Senator Wyden (Chair of the Senate Finance Committee, which oversees the FDA) and <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/MX3xtttSzqQW21yVwz1Dz0J_W2C4PM94Z6QDcN4313JQ3q90JV1-WJV7CgMGCW28Hc6X250vBGW2r-N7s57mbM_W7-x-z52HmyLdW3Fh5zM7r5XskW5ybY_s7sW2NDVPxY3l4ZN4Z9W5t60h43s99hzMpHLcHRSllzW4QdCgv32w708W5bj6qH2grRbFN6RNXV-wxvDyW9d1_Ry7ytMFYW4lSDw63-NKL-W8bNYpG6QzDzvW1FFk6z5vRHBmW7gfynH29rVmBW2bXF074xrDM0W3GXCqd5hTnFXW7VryLG1MQ0pzW6Z4HZx9bgQmQW80sq1b7x4SjCW325GBc1_96ngW4Y3xw44J_V04W8qHTgL5KtPc0W60jj7V5Cs7TPW4dKTqk8XQ9SdW16_xz33B1js9W4d8N0K573bgC3qj71\" target=\"_blank\" id=\"\">lawyer David Cohen</a>. </p><p id=\"\">From Plan C’s perspective, any ruling that invalidates the long-standing FDA approval of mifepristone is purely political, with no basis in scientific fact, but nevertheless has the potential to deal a severe blow to abortion access throughout the country. The decision is not expected to have an immediate impact due to the stay and the question of who has actual authority over the FDA. Both cases will likely go to higher courts. </p><p id=\"\"><em id=\"\">“Once again a court has failed to protect access to basic medical care for people who are pregnant. We will not let this unjust ruling in Texas stop people from accessing abortion pills, which are readily available through alternate supply routes in the US. Our website lists vetted sources that will ship abortion pills directly to your mailbox, no matter what state you live in.”</em> - Elisa Wells, Plan C Co-Director</p><p id=\"\">Despite this baseless ruling, people in the US who want to self-manage their abortions will continue to have options, through the robust alternate supply systems that now exist in the US. Medically-safe sources of pills include Aid Access (<a href=\"http://aidaccess.org/\" target=\"_blank\">aidaccess.org</a>), community-based networks who distribute pills for free, and websites that sell abortion pills for profit. Additionally free resources like the M+A Hotline (<a href=\"http://mahotline.org/\" target=\"_blank\">mahotline.org</a>) and the ReproLegalHelpline (<a href=\"http://reprolegalhelpline.org/\" target=\"_blank\" id=\"\">reprolegalhelpline.org</a>) support anyone in answering medical or legal questions. This is critical information at this moment, and often it is missing from mainstream narratives that erroneously state that medication abortion is now illegal or no longer available. We encourage members of the media to ground themselves in the scope of information that includes medically-safe self-managed options. &nbsp; </p><p id=\"\">Since the SCOTUS <em id=\"\">Dobbs</em> decision and the subsequent actions by many states to unjustly ban or severely restrict provision of abortion care, tens of thousands of people have used the resources documented in Plan C’s <a href=\"/\" target=\"_blank\">Guide to Abortion Pills</a> to access medication abortion through alternate routes to have medically safe self-managed abortions. In the past year, the Plan C website has received 2.2M visitors. Self-managed abortion using pills has been common in other countries for decades, with <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/MX3xtttSzqQW21yVwz1Dz0J_W2C4PM94Z6QDcN4313Jc3q905V1-WJV7CgzYBW73xvBG6_1zVJW7Rr7n_5Jg8clW1H4wz_7Cn8ZdW4ZMdwc6Bgyz-W84bk348_PVfpW6-wyhQ8tSWjTW1svpVl6r2RZ2VgdYkf4gMS-3W4y9hdr2xjrVHW7M6QTw5YBVcqW4Kcg-s1jTQZyW6PMBD98KhfsZW7v2bD77t71yXN8PCn38LRMWVV4vcg82rR-YFW3dc3cz91hJs1VrHBpk7pzjkdVR0yxB2qgjlfW3ZrxjY5S9VxPW6w7PTr110Xw1W7n4VsP2LsYhDW8Dt_Gl56fRRNW69krrj2mldf9W8qRskd7rrQxm39HM1\" target=\"_blank\">millions</a> of people each year either sourcing pills through feminist networks or purchasing them directly off pharmacy shelves, as is allowed in many countries. &nbsp;</p><p id=\"\">Alternate routes of access to abortion pills are likely to continue to grow in the United States as access to abortion through mainstream medical services is gutted by political maneuvering. Fortunately, self-managed abortion using pills is medically safe. What causes harm are efforts to criminalize people for the outcomes of their pregnancies and attempts by anti-chioce extremists to restrict access to care, such as this lawsuit. It is well documented that preventing people from accessing abortion care causes harm and &nbsp;that people who already face access barriers and systemic oppression, including people of color, youth, those who lack financial resources, and those living in rural areas are disproportionately affected. Any criminalization of people for their pregnancy outcomes is unacceptable. Our Guide to Abortion Pills highlights sources of pills that may carry legal risk and directs people to sources of free legal information so that they can fully understand potential risks and make informed decisions about their options. &nbsp;</p><p id=\"\"><em id=\"\">“We know that full legal access to all forms of abortion, through all modalities and in all states for any reason, is what is needed to ensure people are able to safely control their reproductive futures. In the absence of such a reality, we want people to know that alternatives still exist. Given the robust digital marketplace for abortion pills, access to safe, self-managed abortion with pills in the US has not been—and cannot be—stopped.”</em></p><p id=\"\">Amy Merrill, Plan C Digital Director</p>",
    "Date": "Mon Mar 13 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Press Release: FDA Partially Removes Mifepristone REMS",
    "Slug": "press-release-fda-partially-removes-mifepristone-rems",
    "Author": "Elisa Wells",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\">FOR IMMEDIATE RELEASE</strong>‍</p><p id=\"\">Contact: Elisa Wells, Co-Director Plan C </p><p id=\"\"><a href=\"mailto:info@plancpills.org\" id=\"\">info@plancpills.org</a></p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">Press Release: FDA Partially Removes Mifepristone REMS </strong></p><p id=\"\"><em id=\"\">Plan C shares information on how people in the US are accessing safe abortion pills online and through the mail, from all 50 states.</em></p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">New York, NY </strong>– REMS Update: On December 16, the FDA announced a partial update to the Risk Evaluation and Mitigation Strategies (REMS) for mifepristone, one of two medications used for medication abortion. This decision makes permanent the ability for certified providers to deliver abortion pills by mail (including by contracting with mail-order pharmacies), but does not allow the medication to be filled in regular pharmacies nor eliminate the requirement for prescribers to be specially certified by the distributors. While this decision allows for the modern telehealth abortion services that currently exist in more than 20 states to continue, the failure of the FDA to remove all restrictions on access to mifepristone perpetuates medically-unnecessary barriers to accessing this safe and effective medication. &nbsp;</p><ul id=\"\"><li id=\"\"><strong id=\"\">Plan C’s reaction to the REMS: </strong><em id=\"\">Today’s decision is a long overdue victory for abortion access, but the FDA’s failure to remove all restrictions on mifepristone is inexcusable. We have decades of data proving that mifepristone is extremely safe. It should be available through regular pharmacies and able to be prescribed by clinicians without having to specially register with the distributor. Today’s decision is yet another delay in and obstacle to better abortion access in our country. &nbsp;</em></li><li id=\"\">Plan C shares and will continue to share &nbsp;research-based information and resources about the availability of &nbsp;abortion pills by mail in all 50 states. </li><li id=\"\">It is important to understand that, even in states with restrictive laws, these medications are still readily available online, with or without telehealth support. </li><li id=\"\">Plan C’s website has had over 200,000 visitors in the past three months (since Sept 1st) with 88% new visitors. The largest number of visitors in that time period have come from the state of Texas (approx. 25%). </li><li id=\"\">Plan C is <strong id=\"\">not a healthcare provider, service or pharmacy</strong>, but instead a database of research-based information on how and where people are already accessing pills by mail, and an information hub for publicly-available information about their safe self-use. </li><li id=\"\">Plan C is also spreading the news about <strong id=\"\">people’s ability to order pills before they are &nbsp;pregnant</strong>, through AidAccess.org’s new ‘Advance Provision’ service. Ordering pills in advance is a way to have a built-in safety net in your medicine cabinet.</li><li>‍</li></ul><p id=\"\"><em id=\"\">“Today’s decision by the FDA that abortion pills can be distributed by mail is a long-overdue victory for abortion access. However, the FDA’s failure to remove all of the restrictions on mifepristone ignores the science and smacks of political interference. The science is clear: abortion pills are safe and effective and should be available in regular pharmacies, just like most other drugs. Removing all of the restrictions would have made it easier for a wider group of clinicians to prescribe them, including family physicians, who are often our most trusted and convenient sources of care. And, even with the FDA decision, state-based restrictions on providing abortion pills using telemedicine still keep this safe and effective medication out of reach of many, with the biggest impact on people who are already underserved by our healthcare system. Yes, the FDA’s decision is essential to better access, but we still have a lot of work to do to ensure that abortion is equally available in all zip codes.” &nbsp;” &nbsp; &nbsp;</em></p><p>- Elisa Wells, Plan C Co-Founder and Co-Director</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">About Plan C: </strong>Plan C (plancpills.org) is a reproductive health campaign for universal abortion pill access in the US. Plan C’s website and <em id=\"\">Guide to Pills</em> includes information on safe self-managed abortion, medical and legal hotlines, and a research-driven directory of abortion pills by mail: where they’re found online, with or without telehealth support, from all 50 states. Plan C works closely with partners in reproductive justice, healthcare, and tech to catalyze new initiatives that disrupt old barriers to access. </p><p id=\"\">To learn more visit <a href=\"http://www.plancpills.org./\">www.plancpills.org.</a> For updates, follow us on <a href=\"http://facebook.com/plancpills\">Facebook</a>, <a href=\"http://twitter.com/plancpills\" id=\"\">Twitter</a>, <a href=\"https://www.tiktok.com/@plancpills\" id=\"\">TikTok</a> and <a href=\"http://instagram.com/plancpills\" id=\"\">Instagram</a>. </p>",
    "Date": "Wed Dec 01 2021 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Press Release: SB8 #1 | ICYMI: Plan C’S Mobile Billboard is Road Tripping for Abortion Access - So Texans Don’t Have To",
    "Slug": "press-release-sb8-1-icymi-plan-cs-mobile-billboard-is-road-tripping-for-abortion-access---so-texans-dont-have-to",
    "Author": "Elisa Wells",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\">FOR IMMEDIATE RELEASE: </strong></p><p id=\"\">August 30, 2021</p><p id=\"\">Contact: Diana Gómez, Progress Texas <br>diana@progresstexas.org<br>(512) 762-5474 </p><p id=\"\">Contact: Elisa Wells, Plan C <br>info@plancpills.org <strong id=\"\">‍</strong></p><h2 id=\"\"><strong id=\"\">ICYMI: Plan C’S Mobile Billboard is Road Tripping for Abortion Access - So Texans Don’t Have To </strong></h2><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\" data-rt-max-width=\"\"><div><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65a49187ac27b9de68e0e6eb_ogoK3-HIEtCqjaqlmopqvWYVKa0RyCXreBYkcq7HZVt6BT76dzf03NSxotpsbkXJ-OtFCqDa8OADNY7lRtsedB4dXL5QlZois5Z61wHgyW_jEFUEMD9_XP6UImNWAs1cH6OjyzTASFh-XfH4ZrLGeYI.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></figure><p id=\"\"><em id=\"\">No abortion ban will stop the need for abortion care in Texas. </em></p><p id=\"\"><strong id=\"\">TEXAS </strong>– Plan C is finishing up a ”road trip to end all road trips” for abortion access, traveling through Lubbock and West Texas with a mobile billboard truck in response to Texas’s six-week abortion ban (SB 8), which is set to go into effect on Wednesday.</p><ul id=\"\"><li>They visited colleges and universities like West Texas A&amp;M and Texas Tech, talking to students and handing out flyers. They were met with <strong id=\"\">interest and gratitude </strong>for the information they provided, often educating an individual for the first time about online access to abortion pills and especially under the weight of SB8's looming start date. </li><li>But on Saturday while making noise in person in Texas, <strong id=\"\">the Plan C Instagram account was suspended. </strong>They had been sharing activist art and hosting lively dialogue in the comments. But unlike other accounts who do this all day long, the wave of activity resulted in the account being silenced<strong id=\"\">. </strong>They are now waiting for an internal review of the account. </li><li>Instead of being discouraged, they took this as a reminder that equitable abortion access cannot be accomplished alone: and watched as their supporters flocked to other platforms like TikTok and Twitter to raise their voices and amplify information and art. </li><li>On Sunday they learned that an SB8 court case, scheduled for Monday (today) to contest the law and possibly end in an injunction or blocking of the law, was cancelled. No reason was given. And so, they persist. </li><li>Now more than ever, it’s crucial Texans know that abortion pills are safe, effective, and accessible online for self-managed care. </li><li>The mobile billboard was on the road in West Texas for three days total. <strong id=\"\">We’ve compiled images and videos of the mobile billboard here for press use. </strong></li></ul><p id=\"\">“Times have changed, and the ‘abortion road trip’ is no longer needed,” said <strong id=\"\">Francine Coeytaux, codirector at Plan C (plancpills.org). </strong>“While many Texans will be able to travel to neighboring states to find care, we also know that many more may not be able to. We want everyone to understand they can take advantage of internet technology and the post office to access and complete an early abortion entirely from home. As Texas increases restrictions on abortion care, we’re here to let folks know that abortion pills by mail are a safe and effective alternative.” </p><p id=\"\">Aside from banning abortion after six weeks (before many people even know they are pregant), Senate Bill 8 is designed to drive fear and confusion by allowing citizen “bounty hunters” to bring civil suits of $10,000 or more against anyone helping someone to access abortion care outside of the restrictive timeline designated by anti-abortion extremists. </p><p id=\"\">“When Texans decide to have an abortion, they should be able to do so safely and with dignity - and without fear of legal consequences,” <strong id=\"\">said Diana Gómez, advocacy manager at Progress Texas. </strong>“The choice to have an abortion is a health care decision and should be treated as such. Regardless of these draconian anti-abortion laws being passed by extremists in our state, there are alternatives available to give Texans autonomy over our own bodies. Our state and the failed</p><p id=\"\">Republican lawmakers running it should get out of the way and give Texans the freedom to make decisions about our health care needs.” </p><p id=\"\"><strong id=\"\">About Plan C: </strong>Plan C (plancpills.org) is a public health &amp; equity campaign for abortion pill access in the US. Plan C provides research-driven information on abortion pills: where they’re found and how they’re used for a safe home abortion, as well as catalyzing new initiatives that disrupt old barriers to access. To learn more visit www.plancpills.org. For updates, follow us on Facebook, Twitter, TikTok and Instagram. </p><p><strong id=\"\">About Progress Texas: </strong>Progress Texas is a statewide nonprofit media organization committed to promoting and amplifying progressive values. For updates, follow us on Facebook, Twitter, and Instagram.</p>",
    "Date": "Mon Aug 30 2021 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Press Release: SB8 #2 | Plan C is uniquely positioned to be a resource for Texans seeking to self-manage an abortion.",
    "Slug": "press-release-sb8-2-plan-c-is-uniquely-positioned-to-be-a-resource-for-texans-seeking-to-self-manage-an-abortion",
    "Author": "Elisa Wells",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\">FOR IMMEDIATE RELEASE: </strong></p><p id=\"\">September 2, 2021 </p><p id=\"\">Contact: Elisa Wells, Plan C </p><p id=\"\">info@plancpills.org </p><h2 id=\"\"><strong id=\"\">Plan C is uniquely positioned to be a resource for Texans seeking to self-manage an abortion. </strong></h2><p id=\"\"><em id=\"\">Plan C shares research and information on how Texans are already accessing safe abortion pills online: and they will continue to do so under the First Amendment. </em></p><p id=\"\"><strong id=\"\">TEXAS </strong>– On Wednesday September 1st, after inaction from the Supreme Court, Texas’s unprecedented six-week abortion ban (SB 8) went into effect. As reminder: aside from banning abortion after six weeks (before many people even know they are pregant), Senate Bill 8 is designed to drive fear and confusion by allowing citizen “bounty hunters” to bring civil suits of $10,000 or more against anyone helping someone to access abortion care outside of the restrictive timeline designated by anti-abortion extremists. </p><p id=\"\"><strong id=\"\">Despite the draconian restrictions of SB8, people in Texas are finding ways to access abortion care and safely end an early pregnancy--all without leaving their homes. </strong></p><ul id=\"\"><li>Plan C shares information and resources on abortion pill access across all 50 states, thanks to a First Amendment right to free speech. <strong id=\"\">This makes Plan C and its online Guide to Pills uniquely positioned as an information resource for Texans seeking to safely self-manage an abortion</strong>. </li><li>Plan C is <strong id=\"\">not a provider, service or pharmacy</strong>, but instead a database of research-based information on how and where people are already accessing pills by mail, and an information hub for publicly-available information about their safe self-use. </li><li>Our online accounts are rapidly growing this week (IG account 3x’d in 24 hours), and <strong id=\"\">conversations are exploding about abortion pills by mail and @plancpills as a resource. </strong></li><li>As attention and energy builds, so does resistance: and Plan C’s Instagram account has been <strong id=\"\">suspended then reinstated twice</strong>. (Read about it in Jezebel). </li><li>Plan C is also spreading the news about <strong id=\"\">Texans’ ability to order pills before they are pregnant</strong>, through AidAccess.org’s new ‘Advance Provision’ policy. Ordering pills in advance is a way to have a built-in safety net in your medicine cabinet.</li><li>Aid Access has recently shared they will be o<strong id=\"\">ffering advanced provision to not just Texas but all 50 states. </strong></li></ul><p id=\"\">Last week we took a road trip through West Texas to draw attention to fact that the “abortion road trip” is a thing of the past. </p><p id=\"\">We <strong id=\"\">wrote a blog post about it here</strong>, </p><p id=\"\">and <strong id=\"\">Ms. Magazine wrote about it here. </strong>We’ve compiled <strong id=\"\">images and videos of the mobile billboard here </strong>for press use. </p><p id=\"\">A public <strong id=\"\">social media toolkit </strong>can be found here. </p><p id=\"\"><em id=\"\">“SB8 is an abhorrent legislation that is forcing people to change how they access abortion in TX. The good news is that an “abortion road trip” is no longer needed to access a safe abortion. The availability of modern, safe abortion pills by mail—either through physician supported services like Aid Access or through online pharmacies—means that people no longer have to find transportation, take time off from work, arrange childcare, or needlessly expose themselves to COVID to have an abortion. Plan C provides the information that pregnant people in Texas need to take back the power from failed Republican legislators and safely manage their own abortion care.” </em></p><p id=\"\">- Elisa Wells, Plan C Co-Founder and Co-Director </p>",
    "Date": "Wed Sep 01 2021 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Press Release: SB8 #3 | Texans have a “Plan C.”",
    "Slug": "press-release-sb8-3-texans-have-a-plan-c",
    "Author": "Elisa Wells",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\">FOR IMMEDIATE RELEASE: </strong></p><p id=\"\">September 6, 2021 </p><p id=\"\">Contact: Elisa Wells, Plan C </p><p id=\"\">info@plancpills.org </p><p id=\"\">‍</p><h2 id=\"\"><strong id=\"\">Press Release: Texans have a “Plan C.” </strong></h2><p id=\"\"><em id=\"\">Plan C shares research and information on how Texans are already accessing safe abortion pills online: and they will continue to do so under the First Amendment. </em></p><p id=\"\"><em id=\"\">As legislators shut down in-state abortion access, Plan C is uniquely positioned to be a resource for Texans seeking to self-manage an abortion. </em></p><p id=\"\"><strong id=\"\">TEXAS </strong>– On Wednesday September 1st, after inaction from the Supreme Court, Texas’s unprecedented six-week abortion ban (SB 8) went into effect. As reminder: aside from banning abortion after six weeks (before many people even know they are pregant), Senate Bill 8 is designed to drive fear and confusion by allowing citizen “bounty hunters” to bring civil suits of $10,000 or more against anyone helping someone to access abortion care outside of the restrictive timeline designated by anti-abortion extremists. </p><p id=\"\"><strong id=\"\">Despite the draconian restrictions of SB8, people in Texas are finding ways to access abortion care and safely end an early pregnancy--all without leaving their homes. </strong>● Plan C shares information and resources on abortion pill access across all 50 states, thanks to a First Amendment right to free speech. <strong id=\"\">This makes Plan C and its online Guide to Pills uniquely positioned as an information resource for Texans seeking to safely self-manage an abortion</strong>. </p><ul id=\"\"><li id=\"\">Plan C is <strong id=\"\">not a provider, service or pharmacy</strong>, but instead a database of research-based information on how and where people are already accessing pills by mail, and an information hub for publicly-available information about their safe self-use. </li></ul><p id=\"\"><strong id=\"\">The Plan C Campaign just became “mainstream.” </strong></p><ul id=\"\"><li id=\"\">Our online accounts are rapidly growing this week (IG account 5x’d in 5 days), and conversations are exploding on all major platforms about abortion pills by mail and @plancpills as a resource.</li><li id=\"\">AOC even tweeted Plan C’s information on Friday afternoon. </li><li id=\"\">The Plan C Website traffic went from approx. 500 visits a day in early August to 86,000 visits in the last week (since Aug 30). <strong id=\"\">30% of those visits are from Texas. ● </strong>As attention and energy builds, so does resistance: and Plan C’s Instagram account has been <strong id=\"\">suspended then reinstated twice</strong>. (Read about it in Jezebel). </li><li id=\"\">Plan C is also spreading the news about <strong id=\"\">Texans’ ability to order pills before they are pregnant</strong>, through AidAccess.org’s new ‘Advance Provision’ service. Ordering pills in advance is a way to have a built-in safety net in your medicine cabinet. </li><li id=\"\">Aid Access has recently shared they will be o<strong id=\"\">ffering advanced provision to not just Texas but all 50 states. </strong></li></ul><p id=\"\"><strong id=\"\">Prior to Sept 1st, Plan C took a <em id=\"\">“Road Trip to End All Road Trips.” </em></strong></p><ul id=\"\"><li id=\"\">Prior to Sept. 1st we took a road trip through West Texas to draw attention to fact that the “abortion road trip” is a thing of the past. </li><li id=\"\">We <strong id=\"\">wrote a blog post about it here</strong>, </li><li id=\"\">and <strong id=\"\">Ms. Magazine wrote about it here. </strong>We’ve compiled <strong id=\"\">images and videos of the mobile billboard here </strong>for press use. </li><li id=\"\">A public <strong id=\"\">social media toolkit </strong>can be found here. </li></ul><p id=\"\"><em id=\"\">“SB8 is an abhorrent legislation that is forcing people to change how they access abortion in TX. The good news is that an “abortion road trip” is no longer needed to access a safe abortion. The availability of modern, safe abortion pills by mail—either through physician supported services like Aid Access or through online pharmacies—means that people no longer have to find transportation, take time off from work, arrange childcare, or needlessly expose themselves to COVID to have an abortion. Plan C provides the information that pregnant people in Texas need to take back the power from failed Republican legislators and safely manage their own abortion care.” </em></p><p id=\"\">- Elisa Wells, Plan C Co-Founder and Co-Director </p>",
    "Date": "Wed Sep 01 2021 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "RFK Jr. is yet another move toward anti-abortion politics",
    "Slug": "rfk-jr-is-yet-another-move-toward-anti-abortion-politics",
    "Author": "Plan C",
    "Thumbnail": "",
    "Content": "<h4 id=\"\">Plan C: RFK Jr. is yet another move toward anti-abortion politics</h4><p id=\"\">Contact: <a href=\"mailto:press@plancpills.org\" id=\"\">press@plancpills.org</a>&nbsp;</p><p id=\"\">Releases and background at: <a href=\"http://plancpills.org/media\" id=\"\">plancpills.org/media</a> and <a href=\"http://plancpills.org/about\" id=\"\">plancpills.org/about</a>&nbsp;</p><p id=\"\">‍</p><p id=\"\">We’re appalled that Robert F. Kennedy Jr. has been confirmed to head the Department of Health and Human Services, coming on the heels of some <a href=\"https://www.jezebel.com/pam-bondi-meets-louisiana-on-abortion\" target=\"_blank\" id=\"\">very disturbing recent signaling</a> from Attorney General Pam Bondi about her potential plans around shield laws and Comstock enforcement. &nbsp;</p><p id=\"\"><strong id=\"\"><em id=\"\">\"Americans deserve access to evidence-based health care, including abortion. Kennedy’s lack of respect for scientific data, and clear capitulation to Trump's agenda, will create a dangerous situation for anyone who finds themselves pregnant when they don't want to be.</em></strong> </p><p id=\"\"><strong id=\"\"><em id=\"\">Furthermore, despite Trump’s talk about states’ rights to regulate abortion access, any attempts to bring federal ‘consistency’ to the availability of abortion pills by mail are likely to build a legal or regulatory apparatus to prevent access to pills by mail, which science has shown are safe, effective, and convenient medical care.”</em></strong></p><p id=\"\"> <strong id=\"\"><em id=\"\"> - Elisa Wells, Access Director and Co-founder, Plan C Pills</em></strong></p><p id=\"\">We know that we won’t be able to trust Kennedy to use scientific evidence in his decision-making about our healthcare options. Trusting evidence and believing in science are the most critical parts of this job. Within the assembling apparatus of the loyalist/extremist Trump administration, Kennedy’s lack of expertise, experience, and critical thinking skills will have an outsized effect on policies that impact every person in the country, especially abortion-seekers. </p><p id=\"\">As Trump’s unqualified nominees are confirmed across the board, we’re disappointed (but not surprised) to have our worst expectations confirmed. Public health experts across the US will have their work cut out for them, to mitigate harm in the years to come. Despite Trump’s noncommittal answers on a national abortion ban during the campaign, based on his actions so far, we expect to see his extremist nominees and unelected staffers have a serious adverse impact on health outcomes over the next few years. While Kennedy has held similarly inconsistent positions on abortion, his anti-science, anti-evidence posturing bodes dangerously for the management of HHS, and for continued abortion access through traditional routes. </p><p id=\"\">Specifically during his Senate Finance Committee hearing, Kennedy told Senator James Lankford “I agree with President Trump that every abortion is a tragedy. I serve at the pleasure of the president. I’m going to implement his policies.” This is after decades of value statements confirming his belief in body autonomy, which Senator Hassan delivered back to him during the hearing. “You have clearly stated in the past that bodily autonomy is one of your core values,” Hassan stated. “The question is do you stand for that value or not.” At this point, it’s quite clear that he no longer does: and as with so many loyalist nominees, political power has become more important.</p><p id=\"\">At this time of uncertainty, we do know several things: evidence-based information is critical in healthcare and beyond. People will continue to have abortions. And the evidence shows that abortion pills are safe, effective, life-saving medications, whether obtained through a clinic visit, via telehealth, or as a self-managed option. Abortion pills are accessible in all states and territories, including states with heavy restrictions, and can be kept on hand for two years. Thanks to alternative routes of access, from abroad, and through community groups, abortion is here to stay.</p><p id=\"\">Here are a few specific actions people we see people taking to protect this access and share information: </p><ul id=\"\"><li id=\"\">Learn about pills in advance. People can access highly affordable (as low as $70) abortion pills now before they need them, so they have access to this vital form of health care. Visit <a href=\"http://plancpills.org/pills-in-advance\" target=\"_blank\" id=\"\">plancpills.org/pills-in-advance</a> to learn more and find pill options.<br> </li><li id=\"\">Order Plan C stickers. To date, we’ve distributed more than 4M stickers that direct people to our website with accurate, up-to-date information about how people are accessing abortion pills. We plan to continue to share this information under a Trump administration.<a href=\"https://plancpills.org/stickers\" target=\"_blank\" id=\"\">plancpills.org/stickers</a><br> </li><li id=\"\">Spread the word about resources. We encourage people to know about and bookmark the following resources which will have information on how to access abortion: <ul id=\"\"><li id=\"\">For pills by mail sources and info on using them, visit <a href=\"http://plancpills.org/\" target=\"_blank\" id=\"\">plancpills.org</a> </li><li id=\"\">For clinics, travel and pills by mail visit <a href=\"http://ineedana.com/\" target=\"_blank\" id=\"\">ineedana.com</a> &nbsp;</li><li id=\"\">For medical support, <a href=\"http://mahotline.org/\" target=\"_blank\" id=\"\">mahotline.org</a></li><li id=\"\">For legal support, <a href=\"http://reprolegalhelpline.org/\" target=\"_blank\" id=\"\">reprolegalhelpline.org</a> </li><li id=\"\">And for a one-stop URL for reproductive access information, <a href=\"http://youhaveoptions.com/\" target=\"_blank\" id=\"\">youhaveoptions.com</a>.</li></ul></li></ul><p id=\"\"> </p><p id=\"\"><strong id=\"\">About Plan C:</strong></p><p id=\"\">Plan C does research and shares information on abortion pills by mail and safe self-managed care options in the US. &nbsp;</p><p id=\"\">Since 2015, Plan C has helped to lead the way in normalizing this method, already common in other countries: actively increasing its awareness of direct access to pills by mail and with free and confidential support, from any state. Plan C maintains the only comprehensive, research-based<a href=\"http://plancpills.org/\" target=\"_blank\" id=\"\">Guide to Pills</a>, which includes both mainstream and alternate routes of access to pills by mail and support. Plan C also runs creative campaigns, works with brands and media, and builds cross-sector partnerships to educate and advocate, make the method more known and available and reach audiences facing the biggest barriers to care. We do this under a vision of disentangling this safe and effective medication from politics, and moving agency over abortion back to the individual seeker.</p><p id=\"\">Plan C is a project under the fiscal sponsorship of <a href=\"http://possibilitylabs.org/\" target=\"_blank\" id=\"\">Possibility Labs</a>, a 501c3 organization. </p>",
    "Date": "Thu Feb 13 2025 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "Statement from Plan C on several big developments in the abortion pills landscape",
    "Slug": "statement-from-plan-c-on-several-big-developments-in-the-abortion-pills-landscape",
    "Author": "Plan C",
    "Thumbnail": "",
    "Content": "<p id=\"\"><strong id=\"\">Statement from Plan C Pills on several big developments in the abortion pills landscape</strong></p><p id=\"\">The team at Plan C is thrilled to re-share the news that California has joined New York, Washington, and three other states in signing a shield law designed to protect clinicians and pharmacists who mail abortion pills to patients in states with restricted access. </p><p id=\"\">Each state’s shield law operates slightly differently, but overall these laws appear to protect clinicians who practice telemedicine abortion into restricted states, shielding them from extradition or loss of their medical license. These providers are operating in full compliance with the laws in their state that pertain to them and are adhering to standard medical protocols for abortion service delivery.</p><p id=\"\">More and more patients are requesting help from providers who are willing to mail pills into restricted states under protection of these new shield laws. And just yesterday, another service launched: the <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VWWwGC3xsQzhW3HF4lf7DpHzWW3NdgT5541K7zN5SJSmC3qn9gW7Y8-PT6lZ3mjW2sdRkK5kn5cXW4VXDq34JTPJGW1Xz-L88NHLjgW7ltZHh2y69lcW8YcYKs4FsZZTW57QjSB2Vmn73W4WjrkV6hZyLPW1LjWd873Mxs-Vhq7C56hXgQmW4RL2gp2Zyp8YW53bmHf7q-HGgW5xQ9y57Bk-rGW28bdXl1Kyg5kW3XG1PD53DNffw2kghYdncPW7k6Nc16rJy6TW7Jyn8w7WS2WDW1mLMYV47QVhNW3mzJTk48YL2QW8_m5jN4jdX8GW98yPbV1QqVTrMpHgMV4S230W1sf9_V1Qn07hMGn7dMnpPQ5W86h9Cn4m3b2jW6LwhNH8FVMq0f75zzjM04\" target=\"_blank\" id=\"\">Massachusetts Medication Abortion Access Project</a> which is an asynchronous telemedicine service that provides abortion care by mail in all 50 states. <strong id=\"\">‍</strong></p><p id=\"\"><strong id=\"\">How this improves access:</strong></p><ul id=\"\"><li id=\"\"><strong id=\"\">Abortion pills by mail for $150 or less, 2-5 day ship time, in any state.:</strong> It’s true: people in states with abortion bans can now access modern telehealth from licensed US-based clinicians who prescribe and ship FDA approved abortion pills for $150 &nbsp;or less, with 2-5 day ship times. Lawyers say there is no increased legal risk to the patient, since they are receiving a US -based prescription and provider-given care.</li><li id=\"\"><strong id=\"\">Thousands are using the services</strong>. This is not just a theory or future strategy: thousands of people are already using these services every month, via groups like Aid Access, Abuzz, and MAP. This is a stigma-free, equitable, and accessible model which improves access to medication abortion in all 50 states, and we’re thrilled to see how many providers are coming online to fill the need. </li><li id=\"\"><strong id=\"\">CA law includes digital security protections: </strong>The California law goes one step further, including a provision that bars state-based social media companies from complying with out-of-state subpoenas or warrants, which will protect the identity of patients seeking medication - a very necessary step for this state, and one we call on others to adopt.<br><strong id=\"\">The providers need funding. </strong>These innovative providers are on the cutting edge of what’s legally possible in America right now, doing incredibly necessary work, but they will need funding to continue to provide these services. Not every abortion fund is funding clinicians who operate under shield laws, but we know that <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VWWwGC3xsQzhW3HF4lf7DpHzWW3NdgT5541K7zN5SJSm03qn9gW6N1vHY6lZ3kVW2gWK4Q64n-StW5mDN5c4Mr2xDW7dT4n33jqtx5VYCdmD3xVmpwW7gpWjG6-SlLMV492-j8SwhhwN7v-6y1DWWRdW7L3GC28PG-C-W9kwsCP399PsDW5HrgL_98qJg7W10QGRt2jkdCtW35nTn67F_FxBW1nLtB64N9B0hW24ZgYP1LKC8YW7Lj7MC8sySNyW8l-MCl5Y9N7nW47JqXQ8BJMBzW729j6P3lMRT-W2TsxhH1jZXNPW6vNKY1272jsSW79lyYH4h9MvLW1897bq20R9Mgf4RpRBg04\" target=\"_blank\" id=\"\">Abortion Freedom Fund</a> is specifically funding shield law providers and helping them cover part or all of the costs of this service. &nbsp;</li><li id=\"\"><strong id=\"\">The laws will be tested.</strong> These laws are strong, but also new and untested, and lawyers believe they will be challenged.</li></ul><p id=\"\">If you’re writing about shield laws, or looking for a source on using them to procure a medication abortion, please reach out. It’s a complex topic and we’d love to make someone available to walk you through this and the many options that remain available for abortions - including pills in advance! - in the U.S. today. <br><br></p><p id=\"\"><strong id=\"\">About Plan C: </strong></p><p id=\"\">Since 2015, Plan C (<a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VWWwGC3xsQzhW3HF4lf7DpHzWW3NdgT5541K7zN5SJSlK3qn9gW69sMD-6lZ3kCM17f43QCN9dN15S93R7PB9dVm-0ZP1w9P_fW489sfQ7R-ZDMW2STKDL5NrKb_V4M1yZ8byQDXW4wJPkN50W4JDW28pGdB7hVYR6W56Yb796kM41PW130rVZ8dv1C1W7FwDF38c1Px5W8zkyJ26RnhZ_W2ky8GT4ydNCtW3rpddN1Ll_K7W4tSLv434V6s6N4NMQJmvRNQlW15h4Xc3hRgT2W5bmtbF7Mlww0W88Jp5f7gFpGGW2FBhgH8jpZLVf8grJpq04\" target=\"_blank\" id=\"\">plancpills.org</a>) has grown into a leading resource for abortion pills and information on how they’re used for a safe self-managed abortion. Plan C’s website and Guide includes sources of pills, referrals to medical legal and peer support hotlines, FAQs and more. Plan C works closely with partners in grassroots organizations, healthcare, creative and tech to bring this concept to the forefront and catalyze new initiatives that disrupt old barriers to access. Plan C’s mission is to destigmatize the method and make it more known and available – just like it is around the world – to help people reclaim agency over abortion in the U.S. and mitigate harm caused by state-based bans. To learn more, visit <a href=\"https://d11mfr04.na1.hubspotlinks.com/Ctc/2M+113/d11MFr04/VWWwGC3xsQzhW3HF4lf7DpHzWW3NdgT5541K7zN5SJSm03qn9gW6N1vHY6lZ3lFW12rqmV6rsSB6N1qNYHTf43VmW949TFR3D4Km5W3sgtHl1DfQ4XW1ykmRB4P2kjkW2NqLLB1n_MsbW1HN6VC3c-XKfW5rrm9c3Y3slfW8_2Xm93vnc3dW40PndR1dMLW6W73gRq91w6KxQW9886M32XTM2RW1bTF286xr4GlV4RlDm8jP1HHW35gfr_2QGJPzVRMt_p1r2k68W3FsJR_2gLjN7N2QHmBzM7-KPW93FYpz2BpWQ2W4SSnNX5wqlzvN2PLtWqP1j6XW208HmR2vbbRxf5fRcls04\" target=\"_blank\" id=\"\">www.plancpills.org or find Plan C @plancpills on </a>Facebook, Twitter, and Instagram. &nbsp;</p>",
    "Date": "Fri Sep 29 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"
  },
  {
    "Name": "The Plan C 2023 Holiday Gift Guide",
    "Slug": "the-plan-c-2023-holiday-gift-guide",
    "Author": "Plan C",
    "Thumbnail": "https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65527810b568803afd6c0264_mife-miso-tote.png",
    "Content": "<p id=\"\">The holiday season is fast approaching, and this year’s gift-giving theme is abortion! We’ve curated the perfect gift guide for the loved-ones in your life that also supports some of the organizations and artists working to increase access to and destigmatize abortion nationwide. What’s not to love? There’s a little something for everyone here, so happy shopping!</p><p id=\"\">‍</p><h3 id=\"\"><a href=\"https://www.plancpills.org/guide\" target=\"_blank\" id=\"\">1. Abortion Pills in Advance</a> </h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-floatright\" style=\"max-width:30%\" data-rt-type=\"image\" data-rt-align=\"floatright\" data-rt-max-width=\"30%\"><a href=\"http://www.plancpills.org/guide\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526683ef69ec4cc346d7bb_Pgv-WXg5HACLMOhftIBTdEkBX0k4mL9J5gPYF0dnYtQCAhpC6UL6LwpXtbrX5mhbqjED3eWXezUqYiLB218sk3ym0idAPCjOIEQh-jGN2hluE3CNFXG5RdWXAO3nhIQfh2SBR85-m4omDskgThnoThk.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><strong id=\"\">Because at Plan C we're all about well-being and self-directed care, we're going to start this list with you. </strong></p><p id=\"\">Don't forget about yourself this holiday season. Abortion pills are available by mail in all 50 states and can even be ordered before you’re pregnant, just in case. Give yourself the gift of peace of mind and visit <a href=\"http://plancpills.org/guide\" id=\"\">plancpills.org</a> to find abortion pills by mail in your state! (Bonus: pick up some <a href=\"http://plancpills.org/stickers\" id=\"\">Plan C stickers</a> to spread around your hometown while you’re there.)</p><p id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong>Plan C is a national nonprofit campaign for direct access to abortion pills and safe self-managed options in the U.S. Established in 2015, Plan C's <a href=\"http://plancpills.org/guide\" id=\"\">Guide to Pills</a> includes a directory of information on how the method is used, where people are accessing it from all states, and resources for support. Plan C partners with activists and artists, grassroots organizations, lawyers and researchers to spread the word, and catalyzes new routes of access in the face of ongoing stigma, information suppression and unjust bans. </p><p id=\"\">Learn more at <a href=\"http://plancpills.org/\" id=\"\"><strong id=\"\">plancpills.org</strong></a><strong id=\"\">.</strong>&nbsp;&nbsp;</p><p id=\"\">‍</p><h3 id=\"\"><a href=\"https://abortiononourownterms.threadless.com/accessories/bag/tote-bag\" target=\"_blank\" id=\"\">2. Abortion on our Own Terms Tote Bag</a> </h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:50%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"50%\"><a href=\"https://abortiononourownterms.threadless.com/accessories/bag/tote-bag\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/655266828810d529e71bda26_9wXDpixG8-Mj-zG5oALupnX2JghPZLz1MZmfv95KKxAkvJ3PiC9KhuHjre7-VVKqJvsvvvLxf3TN6h2NpJNdfePbSogzV7rkjPzXB4eWpiM8jZe4OnM0lLwE29VB-EFrnj-FxQpOWLYpTo4DDUs_bII.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><strong id=\"\">Looking to hook your friends up with a cute bag and some abortion pill information? Of course you are! </strong><a href=\"https://abortiononourownterms.threadless.com/accessories/bag/tote-bag\" target=\"_blank\" id=\"\"><strong id=\"\">Check out this tote bag</strong></a><strong id=\"\"> from Abortion On Our Own Terms that lists the abortion pill regimen loud and proud!&nbsp;</strong></p><p id=\"\"><a href=\"https://abortiononourownterms.org\" id=\"\">Abortion On Our Own Terms</a> is a national campaign that uses culture change and advocacy to make safe, effective self-managed abortion accessible to all people without stigma or legal risk.&nbsp;</p><p id=\"\">‍</p><h3 id=\"\"><a href=\"https://www.bonfire.com/rhymes-with-abortion-2/?productType=b2ffe678-62bc-415a-be70-acc2e9b75bbc\" id=\"\">3. Rhymes With Abortion Crewneck Sweatshirt</a>&nbsp;</h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:60%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"60%\"><a href=\"https://www.bonfire.com/rhymes-with-abortion-2/?productType=b2ffe678-62bc-415a-be70-acc2e9b75bbc\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526d409dddf8e7d57a96ec_2up-sweater-rhymes.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></a></figure><p id=\"\"><strong id=\"\">It’s cozy szn. Keep your friends warm </strong><a href=\"https://www.bonfire.com/rhymes-with-abortion-2/?productType=b2ffe678-62bc-415a-be70-acc2e9b75bbc\" target=\"_blank\" id=\"\"><strong id=\"\">with this playful sweatshirt</strong></a><strong id=\"\"> from Indigenous Women Rising’s merch store!&nbsp;</strong></p><p id=\"\"><a href=\"https://www.iwrising.org\" id=\"\">Indigenous Women Rising</a> (IWR) is committed to honoring Native &amp; Indigenous People's inherent right to equitable and culturally safe health options through accessible health education, resources and advocacy. IWR’s abortion fund is open to all Native and Indigenous people in the United States and Canada who have the capacity to become pregnant and are seeking an abortion in the United States.</p><p id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></p><h3 id=\"\"><a href=\"https://shout-your-abortion.square.site/product/pre-order-laws-aren-t-real-tee/135?cs=true&cst=custom\" target=\"_blank\" id=\"\"><strong id=\"\">4. </strong></a><a href=\"https://shout-your-abortion.square.site/product/pre-order-laws-aren-t-real-tee/135?cs=true&cst=custom\" id=\"\"><strong id=\"\">Laws Aren’t Real Abortion T-shirt</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" data-rt-type=\"image\" data-rt-align=\"normal\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526dbdf5423e066d9213df_2up-laws-arent-real-t.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></figure><p id=\"\"><strong id=\"\">For your friend who loves to rock band tshirts and rep their values: </strong><a href=\"https://shout-your-abortion.square.site/product/pre-order-laws-aren-t-real-tee/135?cs=true&cst=custom\" target=\"_blank\" id=\"\"><strong id=\"\">set them up with a tee</strong></a><strong id=\"\"> to promote a new world order that includes abortion pills.&nbsp;</strong></p><p id=\"\"><a href=\"https://shoutyourabortion.com\" id=\"\">Shout Your Abortion</a> is normalizing abortion and elevating safe paths to access, regardless of legality. SYA makes resources, campaigns, and media intended to arm existing activists, create new ones, and foster collective participation in abortion access all over the country.</p><p id=\"\">* Bonus Item: <a href=\"https://shout-your-abortion.square.site/product/mife-miso-necklace/129?cp=true&sa=false&sbp=false&q=false&category_id=6\" id=\"\">Check out this super cute mife/miso gold plated necklace&nbsp; </a>&nbsp;or <a href=\"https://shout-your-abortion.square.site/product/mife-miso-hoops/116?cp=true&sa=false&sbp=false&q=false&category_id=6\" id=\"\">these mife &amp; miso hoop earrings</a> – for the jewelry lover in your life.</p><p id=\"\">‍</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://www.readreceipts.co.uk/shop/healthcare-hat\" id=\"\">5. Abortion is Healthcare </a><a href=\"https://www.readreceipts.co.uk/shop/healthcare-hat\" target=\"_blank\" id=\"\">Baseball Cap</a> </h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:50%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"50%\"><a href=\"https://www.readreceipts.co.uk/shop/healthcare-hat\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/655266825fbea95bd8e3d44c_QkxuYTdJ7HzI0Peto_p6uM_iJan9mfhj-SWUu2XmttI5WlbNeWCMd9HRCpyW637hD6viyDrIC0QkFoM5fi6oTe28dVIlQDv313f73L8TvbPu-x7TSlBEXGD-8qhguXM41Xas5C8ueSA8mDv4XtBZA3k.jpeg\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><strong id=\"\">For the friend that wants to keep the sun out but abortions widely accessible, </strong><a href=\"https://www.readreceipts.co.uk/shop/healthcare-hat\" target=\"_blank\" id=\"\"><strong id=\"\">check out this baseball cap</strong></a><strong id=\"\"> from Chantal Strasburger. All proceeds from these hats go to the Lilith Fund in Texas.</strong></p><p id=\"\">(Bonus: Love the print, but want it on a t-shirt or sweatshirt? You’re in luck!<a href=\"https://www.readreceipts.co.uk/shop/abortion-is-health-care\" id=\"\"><strong id=\"\"> Find those options here.)</strong></a></p><p id=\"\"><a href=\"https://www.readreceipts.co.uk\" id=\"\">Chantal Strasburger</a> - Chantal is an embroidery artist and ceramist from Austin, Texas.&nbsp;</p><p id=\"\"><a href=\"https://www.lilithfund.org\" id=\"\">The Lilith Fund</a>: The Lilith Fund provides financial assistance and emotional support while building community spaces for people in Texas who need abortions.</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></h3><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://www.bonfire.com/vote-for-abortion160/\" id=\"\"><strong id=\"\">6. Vote for Abortion T-Shirt</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" data-rt-type=\"image\" data-rt-align=\"normal\"><a href=\"https://www.bonfire.com/vote-for-abortion160/\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526f003c8afc4be7a92d27_2up-vote-for-abortion-tshirt.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></a></figure><p id=\"\"><strong id=\"\">When abortion is on the ballot, it wins!&nbsp; For the friend that likes to wear their politics proudly, this </strong><a href=\"https://www.bonfire.com/vote-for-abortion160/\" target=\"_blank\" id=\"\"><strong id=\"\">“Vote for Abortion” T-shirt</strong></a><strong id=\"\"> is the perfect gift.&nbsp; <br><br></strong>2024 is going to be a big year for abortion rights, so make sure you and your friends are <a href=\"https://www.vote.org/\" target=\"_blank\" id=\"\"><strong id=\"\">registered to vote</strong></a> so everyone can do their part to protect abortion access. </p><p id=\"\"><a href=\"https://www.aafront.org\" id=\"\">Abortion Access Front</a> is a team of comedians, activists, writers, and producers that uses humor to destigmatize abortion and expose the extremist anti-choice forces working to destroy access to reproductive rights in all 50 states.</p><p id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></p><h3 id=\"\">7. <a href=\"https://plancpills.threadless.com/designs/know-your-plan-c-beach-towel\" target=\"_blank\" id=\"\">Plan C Swag</a></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:50%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"50%\"><a href=\"https://plancpills.threadless.com/designs/know-your-plan-c-beach-towel\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/6553cd33435555fc5267905a_Plan%20C%20beach%20towel.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></a><figcaption><em>Plan C&nbsp;beach towel, on threadless</em></figcaption></figure><p id=\"\"><strong id=\"\">Deck your friends out with abortion merch this holiday season from the </strong><a href=\"https://plancpills.threadless.com/designs/know-your-plan-c-beach-towel\" target=\"_blank\" id=\"\"><strong id=\"\">Plan C&nbsp;Threadless shop</strong></a><strong id=\"\">. </strong></p><p id=\"\"><a href=\"https://wrrap.org\" id=\"\">Proceeds benefit WRRAP:</a> the largest national, independent, nonprofit abortion fund. We provide urgently-needed financial assistance nationwide to individuals seeking abortion services or emergency contraception.</p><p id=\"\">‍</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://shop.abortionfunds.org/collections/new/products/abortion-funding-thats-refreshing-glass\" id=\"\"><strong id=\"\">8. Funding Abortion? That’s Refreshing! Glasses</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:50%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"50%\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/655266824572c48992d2bfc4_XR3PQvSjtIXRmBJCavOPoTbwYnFgNXPIVSJvNWhB5PgweZ4dKqLkmKXwVDTK_Xb4dUW9zAx_EY1FnAFLsYl3rla1eloWX3dKA8fIIs7NJfQl4vqDu7UHobNhdgHFFSrhxgtWeDEWA0O6V6vCtEllBuk.jpeg\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></figure><p id=\"\"><strong id=\"\">Because who doesn’t love cute glasses with a purpose?&nbsp;</strong><a href=\"https://shop.abortionfunds.org/collections/new/products/abortion-funding-thats-refreshing-glass\" target=\"_blank\" id=\"\"><strong id=\"\">Shop this tinted glass</strong></a><strong id=\"\"> for your pro-abortion pals.</strong></p><p id=\"\"><a href=\"https://abortionfunds.org\" id=\"\">National Network of Abortion Funds</a> builds power with members to remove financial and logistical barriers to abortion access by centering people who have abortions and organizing at the intersections of racial, economic, and reproductive justice.</p><p id=\"\">‍</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://www.sarahepperson.com/shop/plan-c\" id=\"\"><strong id=\"\">9. Abortion</strong></a><strong id=\"\"> </strong><a href=\"https://www.sarahepperson.com/shop/protectchoice-sticker\" id=\"\"><strong id=\"\">Stickers</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" data-rt-type=\"image\" data-rt-align=\"normal\"><a href=\"https://www.sarahepperson.com/shop/protectchoice-sticker\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526f5c895d7e7a52f62974_2up-stickers.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></a></figure><p id=\"\"><strong id=\"\">For the friend that is always adding stickers to their laptops and water bottles, </strong><a href=\"https://www.sarahepperson.com/shop/protectchoice-sticker\" target=\"_blank\" id=\"\"><strong id=\"\">check out these awesome abortion stickers</strong></a><strong id=\"\"> from Sarah Epperson. </strong></p><p id=\"\">All proceeds support local abortion funds.&nbsp;</p><p id=\"\"><a href=\"https://www.sarahepperson.com/about\" id=\"\">Sarah Epperson</a> is a Queer Feminist Illustrator that creates art for and about social justice movements. Sarah is based in Los Angeles, California.&nbsp;</p><p id=\"\">‍</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://teafund.threadless.com/designs/abortions-are-normal/accessories/mug/latte\" id=\"\"><strong id=\"\">10. Abortions Are Normal Mug</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:30%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"30%\"><a href=\"https://teafund.threadless.com/designs/abortions-are-normal/accessories/mug/latte\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526683ef69ec4cc346d7b7_n1K4snoc4YfGAEqFRyr40Z40YT3_v2O0ehf-0BDXTnZfpfLsZGPcWO6ywJGxhSxhuE0mNqWico4z8mmWTrqvVU6xR26yycAee3NJnD2MUh0pymuZosZFDV78em93bAeSYIZBfuIA7p9L6P1wfQOoqSQ.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></p><p id=\"\"><strong id=\"\">For the friend who is always looking for another mug to add to the collection, </strong><a href=\"https://teafund.threadless.com/designs/abortions-are-normal/accessories/mug/latte\" target=\"_blank\" id=\"\"><strong id=\"\">shop the \"Abortions Are Normal\"&nbsp;mug</strong></a><strong id=\"\">.&nbsp;</strong></p><p id=\"\"><a href=\"https://teafund.org\" id=\"\">Texas Equal Access Fund</a> provides funding to low-income people in the northern region of Texas who are seeking abortion and cannot afford it, while simultaneously working to end barriers to abortion access through community education and shifting the current culture toward reproductive justice.</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://plancmovie.com/watch\" id=\"\"><strong id=\"\">‍</strong></a></h3><h3 id=\"\"><a href=\"https://plancmovie.com/watch\" id=\"\"><strong id=\"\">11. Plan C Documentary</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:30%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"30%\"><a href=\"https://plancmovie.com/watch\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526682d513a11f1814e3d4_rirCRe4wPW9-iNf8-gqBMcgatD1-OLw54dPa9k1SBk2IuYoKfBLFq8rwMPBe_ayoIkn0cItQcDjrpeYGku5fSW1cCPUZXqiRzSNb59F92yIgBtl6ATla0oUVqmbuI5t7d6k3YyFxRdjKBB6rrBXALAc.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><strong id=\"\">Looking for a film to watch around the fire? The Plan C Documentary is sure to be a crowd favorite. </strong></p><p id=\"\">PLAN C documents the work of determined women in the United States expanding access to medication abortion by any means necessary and it’s now available on digital platforms. Check your local streaming platform, and learn more at <a href=\"http://plancmovie.com\" target=\"_blank\" id=\"\"><strong id=\"\">plancmovie.com</strong></a><strong id=\"\">.</strong></p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></h3><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://www.etsy.com/listing/958634869/hex-the-cis-tem-tee?click_key=450b03369091dec9e0a4acca6747d09d6d1b8235%3A958634869&click_sum=2847fb1f&ref=shop_home_recs_3\" id=\"\"><strong id=\"\">12. Hex the Cis-tem T-shirt</strong></a><strong id=\"\">&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:50%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"50%\"><a href=\"https://www.etsy.com/listing/958634869/hex-the-cis-tem-tee?click_key=450b03369091dec9e0a4acca6747d09d6d1b8235%3A958634869&click_sum=2847fb1f&ref=shop_home_recs_3\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526fe57fddc86a4f6fb2a9_2up-tshirt-hex-the-cistem.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></a></figure><p id=\"\">‍<strong id=\"\">The pro-abortion witches in your life are sure to love</strong><a href=\"https://www.etsy.com/listing/958634869/hex-the-cis-tem-tee?click_key=450b03369091dec9e0a4acca6747d09d6d1b8235%3A958634869&click_sum=2847fb1f&ref=shop_home_recs_3\" target=\"_blank\" id=\"\"><strong id=\"\"> this spell-tastic shirt</strong></a><strong id=\"\"> from The Reproductive Freedom Fund of New Hampshire.&nbsp;</strong></p><p id=\"\"><a href=\"https://www.reprofund.org\" id=\"\">Reproductive Freedom Fund of New Hampshire</a> (RFFNH) was founded in 2019 to meet the need in New Hampshire for an accessible source of financial aid for abortions.&nbsp;</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></h3><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://liberaljane.store/collections/prints/products/copy-of-lil-ravioli-against-fascism-print\" id=\"\"><strong id=\"\">13. Mifepristone (Mife)</strong></a><strong id=\"\"> and </strong><a href=\"https://liberaljane.store/collections/prints/products/copy-of-lil-ravioli-against-fascism-print-1\" id=\"\"><strong id=\"\">Misoprostol (Miso)</strong></a><strong id=\"\"> Art Prints&nbsp;</strong></h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:50%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"50%\"><a href=\"https://liberaljane.store/collections/prints/products/copy-of-lil-ravioli-against-fascism-print-1\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65527a978dcad7c46d6d971c_2up-mife-miso-prints.png\" loading=\"lazy\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\"></div></a></figure><p id=\"\"><strong id=\"\">Give the gift of badass art to the abortion activists in your life with </strong><a href=\"https://liberaljane.store/collections/prints/products/copy-of-lil-ravioli-against-fascism-print\" target=\"_blank\" id=\"\"><strong id=\"\">these spectacular mife/miso prints</strong></a><strong id=\"\"> from Liberal Jane.&nbsp;</strong></p><p id=\"\"><a href=\"https://www.liberaljane.com\" id=\"\">Liberal Jane</a>, also known as Caitlin Blunnie, is a queer reproductive justice artivist living in Virginia.</p><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></h3><h3 id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong><a href=\"https://accessrj.threadless.com/designs/skateboard/accessories/phone-case/iphone-12-pro\" id=\"\">14. I Hella Love ACCESS Phone Case</a>&nbsp;</h3><p id=\"\"><strong id=\"\"><em id=\"\">‍</em></strong></p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:30%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"30%\"><a href=\"https://accessrj.threadless.com/designs/skateboard/accessories/phone-case/iphone-12-pro\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526683fe0527ecae7e3a93_GZITGYuUtrbJffLGgXgdCB4KoMZ96Sy2554SCzjnZUHEGdXT6RHdur0b__yCXhFIEA5dDz9eL4G_pmdlKxczlQa21LSUI6edzB9Ez7AVHjqbqPj_U2S8dMoLqWh7b9N5dRbO2vqTPklL2nFcJzFkLrU.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><strong id=\"\">Protect phones and abortion access with </strong><a href=\"https://accessrj.threadless.com/designs/skateboard/accessories/phone-case/iphone-12-pro\" target=\"_blank\" id=\"\"><strong id=\"\">this case</strong></a><strong id=\"\"> from ACCESS RJ.&nbsp;</strong></p><p id=\"\"><a href=\"https://accessrj.org\" id=\"\">ACCESS Reproductive Justice</a> removes barriers to sexual and reproductive health care and builds the power of Californians to demand health, justice, and dignity.</p><p id=\"\">‍</p><h3 id=\"\"><strong id=\"\">15. </strong><a href=\"https://www.bonfire.com/fck-abortion-bans-beanie/\" id=\"\">F*ck Abortion Bans Beanie</a>&nbsp;</h3><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-normal\" style=\"max-width:30%\" data-rt-type=\"image\" data-rt-align=\"normal\" data-rt-max-width=\"30%\"><a href=\"https://www.bonfire.com/fck-abortion-bans-beanie/\" target=\"_blank\" id=\"\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/5f7e07d162248b2c1139d2ef/65526682c5064337250747b2_t_HxnkGuB64G3qIJhWf5nDO2wLGEwfHUfCrP-TCs8HtcfirTtkxBALWim3mTPUueNMnuUAy5KiCvtOp9Qc92ty0QxtNKiCKl8Ph9CXq0i2ZHwVfXv4LFPiMXAlrM-whFHp3qmk0m9tgmfd2ZyPmvruc.png\" id=\"\" width=\"auto\" height=\"auto\" alt=\"\" loading=\"auto\"></div></a></figure><p id=\"\"><a href=\"https://www.bonfire.com/fck-abortion-bans-beanie/\" target=\"_blank\" id=\"\"><strong id=\"\">Shop the beanie</strong></a><strong id=\"\"> that can help your friends can stay warm and say f*ck abortion bans.&nbsp;</strong></p><p id=\"\"><a href=\"https://www.midwestaccesscoalition.org\" id=\"\">Midwest Access Coalition</a>: MAC envisions a world in which all people have access to safe, free, legal abortions wherever they live. As a practical abortion fund, MAC helps people traveling to, from, and within the Midwest access a safe abortion by assisting with travel coordination and costs, lodging, food, medicine, and childcare</p><p id=\"\"><strong id=\"\"><em id=\"\">A note on gendered language:</em></strong><em id=\"\"> The Plan C team knows that abortion is not just a women’s issue and that trans and non-binary folks also have and need access to abortions. We always try our best to use inclusive language, but some of the research studies and links included in this page do use gendered language.</em></p><p id=\"\">Abortion pills, often called ‘medication abortion’ or ‘the abortion pill,’ are a safe and effective way to end a pregnancy. <a href=\"https://www.guttmacher.org/article/2022/02/medication-abortion-now-accounts-more-half-all-us-abortions\" id=\"\">More than half</a> of all abortions in the US are now done with pills. There are two ways (aka protocols or methods) to have an abortion with pills. One is through a combination of two medicines: Mifepristone and Misoprostol, (often called ‘Mife’ and ‘Miso’). The other is using <a href=\"https://societyfp.org/wp-content/uploads/2023/02/SFP_ScienceSays_misoprostol.pdf\" id=\"\">only Misoprostol</a>. These videos explain <a href=\"https://youtu.be/pB3JsJiz82E\" id=\"\">how to take</a> Misoprostol and <a href=\"https://www.youtube.com/watch?v=AyZgY7zbCBM\" id=\"\">what to expect</a> when having an abortion with pills.</p><p id=\"\">Conservatives and the anti-abortion movement are politically motivated to <a href=\"https://docs.google.com/document/d/1f4J5BB9H2Bl4vu1n-qf0D4vuHtOcEV2yLYv2B-x0tqs/edit\" id=\"\">restrict access to Mifepristone</a>, and in the future Misoprostol-alone may be the only option US clinicians can offer, but you may still be able to get both mifepristone and misoprostol online from places like Aid Access, websites that sell pills, or from trusted advocates in your community. </p><p id=\"\">See <a href=\"https://www.plancpills.org/find-pills\" id=\"\">our guide</a> for how to access abortion pills by mail in your state. And stay safe, warm and well this holiday season!&nbsp;</p><p id=\"\">‍</p><h4 id=\"\"><em id=\"\">Love, the team at Plan C</em></h4>",
    "Date": ""
  },
  {
    "Name": "The Stop Comstock Act is a step in the right direction",
    "Slug": "the-stop-comstock-act-is-a-step-in-the-right-direction",
    "Author": "Plan C",
    "Thumbnail": "",
    "Content": "<p id=\"\">Contact: <a href=\"mailto:press@plancpills.org\" id=\"\">press@plancpills.org</a>&nbsp;</p><p id=\"\">Releases and background at: <a href=\"http://plancpills.org/media\" id=\"\">plancpills.org/media</a> and <a href=\"http://plancpills.org/about\" id=\"\">plancpills.org/about</a>&nbsp;</p><p>‍</p><p id=\"\"><strong>The Stop Comstock Act is a step in the right direction</strong></p><p id=\"\"><em>March 13, 2025</em></p><p id=\"\">Senator Tina Smith (D-MN) and Representative Becca Balint (D-VT) have <a href=\"https://reproductivefreedomforall.org/news/democrats-introduce-legislation-to-serve-as-barrier-for-impending-comstock-act-revival/\" target=\"_blank\" id=\"\">introduced the Stop Comstock Ac</a>t to keep Donald Trump and his allies from misapplying the long-dead, ineffective Comstock Act. This is a step in the right direction.</p><p id=\"\">Comstock is an antiquated, puritanical law designed to criminalize bodily autonomy. It has no place in modern society and does not apply to modern medicine or healthcare. Attempts to use Comstock are overtly political, coercive and unethical, and go against widespread public support of abortion access. Any law that would rely on policing people through the mail would also be highly unpopular, would contradict the 4th amendment, and would likely fail.</p><p id=\"\">However, application of this law remains a looming possibility, with a number of anti-abortion activists pushing the Administration to leverage it in order to curb the mailing of abortion pills. It’s a good move for members of Congress to introduce a bill as an effort to keep this dead law where it belongs: in history’s trash bin. </p><p id=\"\">No matter what the current administration does, all research indicates that <strong id=\"\">abortion pills are safe, effective, and here to stay</strong>. A Comstock enforcement attempt would no doubt sow short-term chaos and cause harm, with an outsized impact on communities of color, undocumented individuals, people with special needs, LGBTQ+, low income, and youth. But thanks to widespread alternative access and supply in advance, abortion pills are and will remain available by mail, even in states where abortion is banned.</p><p id=\"\"><em id=\"\">“We applaud this effort to keep the antiquated Comstock Act from being misapplied. But, &nbsp;regardless of what happens in the political or policy spheres, access to abortion pills by mail cannot be stopped. Abortion pills are currently available by mail in all 50 states and that access will continue, no matter what.” - Plan C Co-founder and Access Director Elisa Wells</em></p><p id=\"\"> </p><p id=\"\"><strong id=\"\">About Plan C:</strong></p><p id=\"\"> Plan C is an information campaign and catalyst for access to abortion pills by mail in the US. </p><p id=\"\">Since 2015, Plan C has helped to lead the way in normalizing self-directed abortion care in the US: actively increasing awareness of this safe and effective method and catalyzing new routes of direct access to pills by mail and with free and confidential support, from any state. Plan C maintains the only comprehensive, research-based <a href=\"http://plancpills.org/\" target=\"_blank\" id=\"\">Guide to Pills</a>, which includes both mainstream and alternate routes of access to pills by mail and support in the US. Plan C also runs creative campaigns, works with brands and media, and builds cross-sector partnerships to educate and advocate, make the method more known and available, and reach audiences facing the biggest barriers to care. We do this under a vision of disentangling this safe and effective medication from politics, and moving agency over abortion back to the individual seeker. </p><p id=\"\">Plan C is a fiscally sponsored project of Possibility Labs, a 501(c)(3) nonprofit organization.</p><p id=\"\">‍</p>",
    "Date": "Fri Mar 14 2025 00:00:00 GMT+0000 (Coordinated Universal Time)"
  }
]